<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
<TITLE>Ayuda de GSview</TITLE>
</HEAD>
<BODY>
<H1>Ayuda de GSview</H1>
<HR>
<H1><A NAME="Presentaci&#243;n">Presentaci&#243;n</A></H1>
<B>GSview</B> es un interfaz gr&#225;fico para utilizar Ghostscript en MS-Windows o 
OS/2. 
Ghostscript es un int&#233;rprete del lenguaje de descripci&#243;n de p&#225;ginas PostScript 
utilizado por las impresoras l&#225;ser. 
Para los documentos construidos siguiendo las especificaciones de Adobe acerca 
de la estructura de los documentos PostScript (DSC), GSview permite 
seleccionar las p&#225;ginas que ser&#225;n visualizadas o impresas. GSview 3.6 requiere 
Ghostscript 4.03 - 6.99, siendo preferible la versi&#243;n 6.0 o superior. 
<P>
<A HREF="#Instalación">Instalación</A><BR>
<A HREF="#Registro">Registro</A><BR>
<A HREF="#Convención_para_la_Estructuración_de_Documentos">Convención para la Estructuración de Documentos</A><BR>
<A HREF="#Portable_Document_Format">Portable Document Format</A><BR>
<A HREF="#Abrir_un_documento">Abrir un documento</A><BR>
<A HREF="#Seleccionar_página">Seleccionar página</A><BR>
<A HREF="#Información_del_documento">Información del documento</A><BR>
<A HREF="#Imprimiendo">Imprimiendo</A><BR>
<A HREF="#Conversiones">Conversiones</A><BR>
<A HREF="#Medir">Medir</A><BR>
<A HREF="#Opciones">Opciones</A><BR>
<A HREF="#Orientación_de_página">Orientación de página</A><BR>
<A HREF="#Parámetros_de_pantalla">Parámetros de pantalla</A><BR>
<A HREF="#Tamaño_de_página">Tamaño de página</A><BR>
<A HREF="#Teclas_calientes">Teclas calientes</A><BR>
<A HREF="#Opciones_de_la_línea_de_comandos">Opciones de la línea de comandos</A><BR>
<A HREF="#World_Wide_Web">World Wide Web</A><BR>
<A HREF="#Derechos_de_autor">Derechos de autor</A><BR>
<A HREF="#Problemas_usuales">Problemas usuales</A><BR>
<A HREF="#Otros_programas_útiles">Otros programas útiles</A><BR>
<A HREF="#Otros_temas_de_ayuda">Otros temas de ayuda</A><BR>
<P>
<HR>
<H1><A NAME="Instalaci&#243;n">Instalaci&#243;n</A></H1>
Para la instalaci&#243;n de GSview, es recomendable utilizar el programa de 
instalaci&#243;n que se acompa&#241;a, denominado <B>setup.exe</B> en la versi&#243;n para 
MS-Windows y <B>os2setup.exe</B> en la versi&#243;n para OS/2. 
La versi&#243;n de GSview para MS-Windows se distribuye como un archivo que se 
descomprime autom&#225;ticamente y ejecuta el programa de instalaci&#243;n. 
Es necesario que, previamente, se haya instalado Ghostscript. 
<P>Si desea instalar GSview manualmente, lea el tema <A HREF="#Instalación_manual">Instalaci&#243;n manual</A>. 
<P>La primera vez que se ejecuta GSview se debe configurar el programa. Si 
posteriormente desea modificar la configuraci&#243;n, debe seleccionar 
<A HREF="#Opciones">Opciones</A> | <A HREF="#Configuración_sencilla">Configuraci&#243;n sencilla</A> u <A HREF="#Opciones">Opciones</A> | <A HREF="#Configuración_avanzada">Configuraci&#243;n avanzada</A>. 
<P>Vea tambi&#233;n <A HREF="#Opciones">Opciones</A> | <A HREF="#Idioma">Idioma</A>. 
<P>
<A HREF="#Conseguir_Ghostscript">Conseguir Ghostscript</A><BR>
<A HREF="#Instalación_de_Ghostscript">Instalación de Ghostscript</A><BR>
<A HREF="#Desinstalando_GSview">Desinstalando GSview</A><BR>
<A HREF="#Instalación_manual">Instalación manual</A><BR>
<A HREF="#Instalación_manual_avanzada">Instalación manual avanzada</A><BR>
<A HREF="#Instalación_en_red">Instalación en red</A><BR>
<A HREF="#Ejecutar_GSview_desde_el_Administrador_de_Programas_o_el_Explorador_de_Windows">Ejecutar GSview desde el Administrador de Programas o el Explorador de Windows</A><BR>
<P>
<HR>
<H2><A NAME="Conseguir_Ghostscript">Conseguir Ghostscript</A></H2>
GSview necesita Aladdin Ghostscript. GSview y Aladdin Ghostscript est&#225;n 
disponibles por separado en 
<PRE>
 http://www.cs.wisc.edu/~ghost/
</PRE>
<P>Para configurar GSview, obtenga e instale, por este orden, Aladdin Ghostscript 
y GSview, y posteriormente ejecute GSview. 
<P>
<P>
<HR>
<H2><A NAME="Instalaci&#243;n_de_Ghostscript">Instalaci&#243;n de Ghostscript</A></H2>
La versi&#243;n de Aladdin Ghostscript para Win32 est&#225; disponible como un archivo 
que se descomprime autom&#225;ticamente e instala la aplicaci&#243;n. 
Para m&#225;s detalles sobre c&#243;mo instalar manualmente Ghostscript, lea los 
archivos <B>Install.htm</B> y <B>Use.htm</B> que vienen con la documentaci&#243;n de Ghostscript. 
<P>
<P>
<HR>
<H2><A NAME="Desinstalando_GSview">Desinstalando GSview</A></H2>
Para desinstalar GSview en Windows 95 o NT 4.0, utilice el icono <B>Agregar o quitar 
programas</B> de la ventana <B>Panel de control</B>. 
<P>
<A HREF="#Desinstalación_manual">Desinstalación manual</A><BR>
<P>
<HR>
<H3><A NAME="Desinstalaci&#243;n_manual">Desinstalaci&#243;n manual</A></H3>
Para desinstalar GSview, elimine los archivos del directorio de <B>gsview</B>. 
<P>Elimine tambi&#233;n 
<PRE>
 c:\windows\gsview32.ini
</PRE>
<P>del directorio de sistema adecuado. 
Para Windows NT ser&#225; preciso eliminar tambi&#233;n los archivos gsview32.ini del 
directorio de perfiles (Profiles). 
<P>Elimine el grupo <B>Ghostgum</B> del Administrador de Programas o del men&#250; Inicio. 
<P>Si sabe c&#243;mo editar el Editor de registros de configuraciones, elimine las 
claves siguientes: 
<PRE>
 HKEY_CLASSES_ROOT\psfile
 HKEY_CLASSES_ROOT\.eps
 HKEY_CLASSES_ROOT\.ps
 HKEY_CLASSES_ROOT\MIME\Database\Content Type\application/postscript
</PRE>
<P>Si durante la instalaci&#243;n, o posteriormente, asoci&#243; la extensi&#243;n PDF con 
GSview, tambi&#233;n necesitar&#225; eliminar las siguientes claves: 
<PRE>
 HKEY_CLASSES_ROOT\pdffile
 HKEY_CLASSES_ROOT\.pdf
 HKEY_CLASSES_ROOT\MIME\Database\Content Type\application/pdf
</PRE>
<P>El m&#233;todo preferible para desinstalar Ghostscript es utilizando el icono <B>Agregar o quitar 
programas</B> de la ventana <B>Panel de control</B>. 
Para desinstalar manualmente Ghostscript, elimine los archivos del directorio 
<B>gsN.NN</B> donde N.NN indica el n&#250;mero de la versi&#243;n de Ghostscript. 
<P>
<P>
<HR>
<H2><A NAME="Instalaci&#243;n_manual">Instalaci&#243;n manual</A></H2>
Para instalar GSview se recomienda utilizar el programa de instalaci&#243;n. Las 
siguientes instrucciones describen c&#243;mo puede instalarse GSview sin utilizar 
el programa de instalaci&#243;n. 
<P>Fije la variable de entorno TEMP para indicar el directorio donde guardar los 
archivos temporales. Por ejemplo: 
<PRE>
 SET TEMP=c:\temp
</PRE>
<P>El directorio debe existir y tiene que poder escribirse en &#233;l. 
<P>En primer lugar, debe instalar Ghostscript, incluyendo las librer&#237;as y las 
fuentes. Necesitar&#225; la versi&#243;n de Ghostscript que se indica en la 
<A HREF="#Presentación">Presentaci&#243;n</A>. 
Esta versi&#243;n de GSview no funcionar&#225; con otras versiones de Ghostscript. 
Instale Ghostscript en un directorio c:\gs\gsN.NN 
(reemplazando N.NN por el n&#250;mero de la versi&#243;n de Ghostscript 
correspondiente). 
<P>Cree un directorio, por ejemplo, c:\ghostgum\gsview 
<P>Seguidamente instale 
GSview para MS-Windows, copiando gsview32.exe, gsv16spl.exe, gvwgs32.exe, 
gsvw32de.dll, gsvw32es.dll, gsvw32fr.dll, gsvw32it.dll, 
gsviewen.hlp, gsviewde.hlp, gsviewes.hlp, gsviewfr.hlp, gsviewit.hlp 
y printer.ini 
al directorio <B>c:\ghostgum\gsview</B>. 
<P>Inicie GSview y seleccione la versi&#243;n de Ghostscript adecuada (usualmente la 
&#250;ltima). Para cambiar la versi&#243;n posteriormente debe seleccionar <A HREF="#Opciones">Opciones</A> | 
<A HREF="#Configuración_sencilla">Configuraci&#243;n sencilla</A>. 
<P>Para un mayor control sobre la configuraci&#243;n, lea el tema 
<A HREF="#Instalación_manual_avanzada">Instalaci&#243;n manual avanzada</A>. 
<P>
<P>
<HR>
<H2><A NAME="Instalaci&#243;n_manual_avanzada">Instalaci&#243;n manual avanzada</A></H2>
En lugar de utilizar <A HREF="#Opciones">Opciones</A> | <A HREF="#Configuración_sencilla">Configuraci&#243;n sencilla</A> debe seleccionar 
<A HREF="#Opciones">Opciones</A> | <A HREF="#Configuración_avanzada">Configuraci&#243;n avanzada</A>. 
<P>En primer lugar, complete adecuadamente los tres campos de texto (vea 
<A HREF="#Configuración_avanzada">Configuraci&#243;n avanzada</A>). 
<P>En el cuadro de di&#225;logo <A HREF="#Configuración_avanzada">Configuraci&#243;n avanzada</A> seleccione las opciones 
<B>Copiar los valores predeterminados para la impresora</B>, 
<B>Asociar los archivos .ps a GSview</B> y 
<B>Crear las entradas en el men&#250; de Inicio</B>, o realice las siguientes tres etapas. 
<P>1. Salga de GSview y a&#241;ada el archivo printer.ini al archivo INI de GSview 
(usualmente c:\windows\gsview32.ini, c:\winnt\gsview32.ini o c:\os2\gvpm.ini). 
<P>2. A&#241;ada los tipos de archivos .ps y .eps (y opcionalmente el tipo .pdf) en el 
<A HREF="#_Ejecutar_GSview_desde_el_Administrador_de_Programas_o_el_Explorador_de_Windows">Registro de configuraciones</A>. 
<P>3. Cree un elemento para GSview en el Administrador de Programas o en el Men&#250; 
Inicio. 
<P>Si dispone en su sistema de fuentes Tipo 1, entonces es posible configurar 
Ghostscript para que las utilice. Examine los archivos <B>Fontmap.os2</B> y 
<B>Fontmap.atm</B> que acompa&#241;an Ghostscript para ver algunos ejemplos de c&#243;mo 
hacerlo. Vea el tema <B>Fuentes</B>. 
<P>Si tiene problemas durante la instalaci&#243;n, lea el tema <A HREF="#Problemas_usuales">Problemas usuales</A>. 
<P>
<P>
<HR>
<H2><A NAME="Instalaci&#243;n_en_red">Instalaci&#243;n en red</A></H2>
Instale GSview en un directorio de una unidad que est&#233; en red. 
<P>Cuando un usuario inicie GSview por primera vez, o inicie GSview tras un 
cambio en el n&#250;mero de la versi&#243;n, GSview configurar&#225; el ordenador del 
usuario. 
<P>Los directorios no pueden indicarse seg&#250;n las normas UNC cuando se trabaja en 
Windows 3.1, aunque s&#237; puede hacerse trabajando en Windows 95 o superior. 
<P>GSview intenta mantener un archivo de configuraci&#243;n para cada usuario. Si se 
utilizan perfiles de usuario, trabajando con Windows 95 o superior, GSview 
almacenar&#225; el archivo INI en el subdirectorio del perfil del usuario, tal y 
como est&#233; especificado en el registro de configuraciones. Si GSview no 
localiza la clave correspondiente en el registro, y la clave USERPROFILE est&#225; 
definida y es un directorio, entonces GSview almacenar&#225; el archivo INI en 
dicho directorio. Si esta opci&#243;n tampoco funciona, entonces GSview almacenar&#225; 
el archivo INI en el directorio por defecto, el directorio del sistema de 
Windows. 
En caso de que el directorio de perfil del usuario exista pero est&#233; protegido 
contra escritura, entonces GSview tendr&#225; problemas. 
<P>Si desea finalizar GSview estando en el cuadro de di&#225;logo 
<A HREF="#Configuración_sencilla">Configuraci&#243;n sencilla</A> cuando se ejecuta la aplicaci&#243;n por primera vez, o cuando GSview se 
est&#225; actualizando, guarde un archivo INI en el directorio GSview. <B>Recuerde 
que debe eliminar este archivo en el futuro antes de proceder a una 
actualizaci&#243;n de GSview</B>. 
Este archivo debe contener solamente las entradas que desee sobrescribir en 
los archivos de configuraci&#243;n de usuarios. 
El procedimiento recomendado es instalar GSview y posteriormente configurarlo. 
Copie el archivo gsview32.ini o gvpm.ini desde el directorio del sistema, o 
desde el directorio del perfil de usuario, al directorio de GSview, ed&#237;telo y 
elimine todas las entradas excepto: 
<PRE>
 [Options]
 Version=3.6
 GSversion=650
 Configured=1
 GhostscriptDLL=e:\gs\gs6.50\bin\gsdll32.dll
 GhostscriptInclude=e:\gs\gs6.50\lib;e:\gs\fonts
 GhostscriptOther=-dNOPLATFONTS -sFONTPATH="c:\psfonts"
</PRE>
<P>Cuando un usuario inicia GSview, se utiliza normalmente su archivo INI. La 
primera vez que GSview se ejecuta, o cuando la versi&#243;n de GSview no coincide 
con el valor almacenada en el archivo INI, ocurre una de las siguientes 
posibilidades: 
<P>1. El archivo INI del directorio GSview ser&#225; le&#237;do, sobrescribiendo los 
archivos INI de los usuarios. 
<P>2. La lista de impresoras ser&#225; actualizada utilizando el archivo printer.ini 
del directorio GSview. 
<P>3. Las asociaciones de los archivos con extensiones .ps, .eps y .pdf NO ser&#225;n 
realizadas o modificadas. Si desea cambiar esto,  debe seleccionar 
<A HREF="#Opciones">Opciones</A> | <A HREF="#Configuración_avanzada">Configuraci&#243;n avanzada</A>. 
<P>4. Los grupos del Administrador de Programas, los elementos del Men&#250; Inicio y 
los accesos directos del escritorio NO ser&#225;n modificados. 
Si desea cambiarlos debe seleccionar <A HREF="#Opciones">Opciones</A> | <A HREF="#Configuración_avanzada">Configuraci&#243;n avanzada</A>. 
<P>Si un usuario intenta ejecutar el programa de desinstalaci&#243;n de GSview, 
entonces se procurar&#225; eliminar los archivos de GSview y Ghostscript que est&#233;n 
en la red. Aseg&#250;rese que los directorios donde est&#225;n instalados GSview y 
Ghostscript est&#225;n protegidos contra escritura (para los usuarios normales). 
Es aconsejable, para extremar las precauciones, eliminar el archivo 
<B>uninstal.txt</B> del directorio GSview. 
<P>
<P>
<HR>
<H2><A NAME="_Ejecutar_GSview_desde_el_Administrador_de_Programas_o_el_Explorador_de_Windows"> Ejecutar GSview desde el Administrador de Programas o el Explorador de Windows</A></H2>
Al utilizar el programa setup.exe de GSview y responder <B>SI</B> a todas las 
preguntas, se efect&#250;a la instalaci&#243;n descrita a continuaci&#243;n . 
Si no actualiza la informaci&#243;n del registro durante la instalaci&#243;n de 
GSview, entonces debe seguir las instrucciones que siguen a continuaci&#243;n para 
concluir la actualizaci&#243;n manualmente. 
<P>Para iniciar la aplicaci&#243;n GSview cada vez que sobre un archivo Postscript 
se realiza un doble-click, deben seguirse las siguientes instrucciones 
para configurar el Explorador de Windows o el Administrador de Archivos. 
<P>En el <B>Explorador de Windows</B> seleccionar <B>Ver</B> | <B>Opciones...</B> y a 
continuaci&#243;n seleccionar la pantalla <B>Tipos de archivo</B>. Pulsar el bot&#243;n 
<B>Nuevo tipo...</B> e introducir la siguiente informaci&#243;n: 
<PRE>
 Descripci&#243;n de tipo = Archivo Postscript
 Extensi&#243;n asociada = ps eps
 Tipo de contenido (MIME) = application/postscript
</PRE>
<P>A continuaci&#243;n debe a&#241;adir las siguientes acciones, pulsando el bot&#243;n 
<B>Nueva...</B>: 
<PRE>
 Acci&#243;n = Abrir
 Aplicaci&#243;n a utilizar para realizar la acci&#243;n = c:\ghostgum\gsview\gsview32 "%1"
 Utilizar DDE = no seleccionar
</PRE>
<P>Pulse el bot&#243;n <B>Aceptar</B> y a continuaci&#243;n seleccione <B>Nueva...</B> para 
a&#241;adir otra acci&#243;n: 
<PRE>
 Acci&#243;n = Imprimir
 Aplicaci&#243;n a utilizar para realizar la acci&#243;n = c:\ghostgum\gsview\gsview32 /p "%1"
 Utilizar DDE = no seleccionar
</PRE>
<P>Pulse <B>Aceptar</B> y de nuevo <B>Aceptar</B>. 
<P>&#161;Y esto es todo! A partir de ahora, cada vez que hagamos doble click sobre un archivo Postscript, 
el Explorador de Windows iniciar&#225; GSview. Al seleccionar un archivo 
Postscript con el rat&#243;n y pulsar el bot&#243;n derecho se despliega un men&#250; en 
el que, entre otras, aparecen las acciones <A HREF="#Abrir_un_documento">Abrir</A> e <A HREF="#Imprimiendo">Imprimir</A> 
previamente introducidas. Si disponemos de una impresora Postscript, 
entonces la acci&#243;n <A HREF="#Imprimiendo">Imprimir</A> no es necesaria y puede suprimirse. 
<P>
<P>
<HR>
<H1><A NAME="Registro">Registro</A></H1>
Si desea apoyar el desarrollo de GSview o desea desactivar la 
molesta pantalla, por favor piense en registrarse. No hay necesidad de 
registrarse. GSview est&#225; disponible con la Aladdin Free Public Licence, 
contenida en el archivo <B>LICENCE</B>. 
Esto permite su libre utilizaci&#243;n, pero restringe su distribuci&#243;n comercial. 
<P>La cuota para registrarse es actualmente de 40$ australianos. 
Puede registrarse en l&#237;nea en la direcci&#243;n 
http://www.ghostgum.com.au/ 
o enviando por fax o correo ordinario el formulario de registro 
que se encuentra en el archivo <B>regorder.txt</B> situado en el directorio de GSview. 
Ghostgum Software prefiere que utilice el registro en l&#237;nea. 
<P>
<P>
<HR>
<H1><A NAME="Convenci&#243;n_para_la_Estructuraci&#243;n_de_Documentos">Convenci&#243;n para la Estructuraci&#243;n de Documentos</A></H1>
Adobe ha definido un conjunto de convenciones para comentarios extendidos 
que proporciona informaci&#243;n adicional acerca de la estructura de las p&#225;ginas y de los 
recursos requeridos por un archivo PostScript. 
Si un archivo contiene comentarios acordes con la Convenci&#243;n para la Estructuraci&#243;n 
de Documentos (DSC), GSview puede mostrar las p&#225;ginas en un orden aleatorio utilizando 
<A HREF="#Seleccionar_página">Ir a la p&#225;gina</A> y mostrar las p&#225;ginas en orden inverso utilizando <A HREF="#Seleccionar_página">P&#225;gina anterior</A>. 
Las p&#225;ginas seleccionadas pueden ser extra&#237;das a otro archivo o imprimidas. 
<P>Si un archivo no contiene comentarios DSC GSview s&#243;lo puede mostrar 
sus p&#225;ginas en el orden original. 
<P>Los archivos que son conformes a la DSC comienzan con la l&#237;nea de comentario: 
<PRE>
 %!PS-Adobe-3.0
</PRE>
<P>donde el n&#250;mero 3.0, que representa el n&#250;mero de versi&#243;n de la DSC, puede cambiar. 
Algunos programas escriben archivos PostScript con un Control-D como primer car&#225;cter, 
seguido de la l&#237;nea de comentario antes mencionada. GSview informar&#225; de la no 
conformidad a la DSC de dichos ficheros, a pesar de lo cual los mostrar&#225; con las 
posibilidades de selecci&#243;n de p&#225;gina disponibles. 
Reclame al autor del programa que produce tales archivos PostScript. 
Para hacer que el archivo sea conforme a la DSC, ed&#237;telo y suprima el car&#225;cter 
Control-D. 
<P>Los archivos conformes a la DSC contienen l&#237;neas como las siguientes: 
<PRE>
 %%Pages: 24
 %%Page: 1 1
</PRE>
<P>Estas l&#237;neas indican a GSview cu&#225;ntas p&#225;ginas contiene el documento y 
en qu&#233; n&#250;mero comienzan. GSview utiliza esta informaci&#243;n para seleccionar 
p&#225;ginas particulares. 
<P>Los archivos PostScript Encapsulado (EPSF) son documentos de una sola p&#225;gina 
que contienen una parte de los comentarios DSC y de los comandos PostScript. 
Los archivos EPS comienzan con la l&#237;nea de comentario: 
<PRE>
  %!PS-Adobe-3.0 EPSF-3.0
</PRE>
<P>Los archivos EPS son normalmente utilizados para su inclusi&#243;n en otros 
documentos y por esta raz&#243;n necesitan el comentario referido a las dimensiones de 
la caja: 
<PRE>
  %%BoundingBox: llx lly urx ury
</PRE>
<P>donde llx, lly, urx y ury son n&#250;meros enteros que dan las coordenadas x e y de las 
esquinas inferior izquierda y superior derecha de una caja que incluye 
todos los elementos incluidos en la p&#225;gina. 
<P>Algunos archivos EPS contienen una vista preliminar del documento PostScript. Esta vista 
preliminar puede ser un archivo de tipo Windows Metafile,  TIFF o 
Interchange (formato EPSI). 
En las vistas preliminares de tipo Windows Metafile o TIFF, los archivos EPS bajo DOS 
contienen una cabecera binaria que especifica la localizaci&#243;n y las dimensiones de 
dicha vista y las secciones de lenguaje PostScript del archivo EPS. 
En el formato Interchange la vista preliminar est&#225; contenida en comentarios DSC 
que se inician con 
<PRE>
 %%BeginPreview: anchura altura profundidad l&#237;neas
</PRE>
<P>Un archivo EPS con una vista preliminar puede ser creado a partir de un archivo EPS 
sin ella utilizando <A HREF="#Vista_preliminar_en_EPS">A&#241;adir vista preliminar a EPS</A>. 
<P>GSview puede enviar mensajes de precauci&#243;n cuando los documentos contienen comentarios 
DSC incorrectos. Esta posibilidad puede evitarse con <A HREF="#Opciones">Opciones</A> | <A HREF="#Mensajes_DSC">Mensajes DSC</A>. 
<P>
<P>
<HR>
<H1><A NAME="Portable_Document_Format">Portable Document Format</A></H1>
GSview puede mostrar e imprimir archivos PDF, aunque existen un cierto n&#250;mero de 
restricciones en el m&#233;todo actual. 
<P>En el momento de mostrar, GSview ignora el tama&#241;o de p&#225;gina seleccionado en el men&#250; 
Formatos y, en su lugar, utiliza el comando /MediaBox del archivo PDF. 
Si <A HREF="#Opciones">Opciones</A> | <A HREF="#Recortar_EPS">Recortar EPS</A> est&#225; activo, GSview utilizar&#225; el /CropBox 
del archivo PDF. 
<P>GSview necesita <A HREF="#Abrir_un_documento">Abrir</A> un archivo PDF para contar sus p&#225;ginas.  Si selecciona 
el archivo (con el men&#250;  <A HREF="#Abrir_un_documento">Seleccionar</A>) GSview no ser&#225; capaz de <A HREF="#Extraer">Extraer texto</A>, 
<A HREF="#Extraer_texto_y_buscar">Buscar</A>, <A HREF="#Seleccionar_página">Ir a la p&#225;gina</A> ni ninguna otra operaci&#243;n que necesite conocer cu&#225;ntas 
p&#225;ginas tiene el documento. 
<P>El mantenimiento de los marcadores de enlaces PDF (<B>pdfmark</B>) es tosco. 
<P>Para convertir un archivo PostScript en un archivo PDF, utilice <A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Convertir">Convertir</A>, 
seleccionando despu&#233;s el dispositivo <B>pdfwrite</B>. 
<P>Para convertir un archivo PDF en un archivo PostScript utilice 
<A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Convertir">Convertir</A>, seleccionando despu&#233;s el dispositivo <B>pswrite</B>. 
<P><A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Extraer">Extraer</A> no funciona con archivos PDF. 
Si se extraen p&#225;ginas de un archivo PDF se obtendr&#225;n archivos PostScript y no PDF. 
<P>Para convertir por lotes varios archivos consulte los archivos ps2pdf.bat y pdf2ps.bat 
en el directorio de Ghostscript. 
Necesitar&#225; utilizar 
gswin32c.exe 
en lugar de gs.exe. Puede ser que necesite adem&#225;s asignar el camino de 
b&#250;squeda de ficheros de Ghostscript utilizando <B>-I</B> o la variable de entorno <B>GS_LIB</B>. 
<P>
<P>
<HR>
<H1><A NAME="Abrir_un_documento">Abrir un documento</A></H1>
El comando <B>Abrir</B> del men&#250;  <B>Archivo</B> abre un archivo y muestra su primera p&#225;gina. 
<P>Si el archivo contiene comentarios <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A> las p&#225;ginas pueden ser seleccionadas 
utilizando <A HREF="#Seleccionar_página">P&#225;gina siguiente</A>, <A HREF="#Seleccionar_página">P&#225;gina anterior</A> e <A HREF="#Seleccionar_página">Ir a la p&#225;gina</A>. 
<P>Si el archivo no contiene comentarios <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A>, <A HREF="#Seleccionar_página">P&#225;gina anterior</A> e <A HREF="#Seleccionar_página">Ir a la p&#225;gina</A> 
no funcionar&#225;n. No deber&#237;a ser seleccionado otro archivo hasta que la &#250;ltima p&#225;gina 
del archivo activo haya sido mostrada. 
<P>Cuando se abre un archivo GSview mostrar&#225; su nombre, la p&#225;gina actual (si est&#225; disponible) 
y, mientras el cursor se sit&#250;e sobre la imagen, las coordenadas de su localizaci&#243;n, en las 
unidades especificadas por <A HREF="#Opciones">Opciones</A> | <A HREF="#Unidades">Unidades</A>.  Estas unidades pueden ser puntos PostScript 
(1/72"), mil&#237;metros o pulgadas. 
La localizaci&#243;n del cursor es &#250;til para calcular las dimensiones de las cajas. 
<P>El comando <B>Seleccionar archivo</B> es semejante a <B>Abrir</B> pero no muestra el documento. 
Este comando es &#250;til para imprimir un documento, sin necesidad de verlo. 
<P>El comando <B>Guardar como</B> salva una copia del documento actual. 
Esto es &#250;til si GSview se est&#225; utilizando como visor de PostScript por otra aplicaci&#243;n 
y usted desea salvar el documento mostrado. 
<P>El comando <B>Cerrar</B> cierra el documento que se encuentra abierto en el momento actual. 
Esto debe ser utilizado antes de que el archivo actual sea modificado por otro programa. 
Si no procede de esta forma y GSview detecta que la longitud o la fecha del archivo han 
cambiado, GSview cerrar&#225; Ghostscript y volver&#225; a leer el documento. 
<P>Vea tambi&#233;n <A HREF="#Imprimiendo">Imprimir</A>. 
<P>
<P>
<HR>
<H1><A NAME="Seleccionar_p&#225;gina">Seleccionar p&#225;gina</A></H1>
<B>Ver</B> | <B>P&#225;gina siguiente</B> o el bot&#243;n  <B>+</B> muestran la p&#225;gina siguiente del documento. 
Esto funciona incluso si el documento no contiene comentarios <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A>. 
<P><B>Ver</B> | <B>P&#225;gina anterior</B> o el bot&#243;n <B>-</B> muestran la p&#225;gina anterior. 
<P><B>Ver</B> | <B>Actualizar</B> o la tecla <B>F5</B> vuelve a mostrar la p&#225;gina actual. 
<P><B>Ver</B> | <B>Ir a la p&#225;gina</B> o el bot&#243;n <B>dedo indicador</B> muestra un cuadro de di&#225;logo que permite la 
selecci&#243;n del n&#250;mero de la p&#225;gina que se desea mostrar a continuaci&#243;n. 
El cuadro de di&#225;logo <B>Seleccionar p&#225;gina</B> muestra las etiquetas de las p&#225;ginas ya que &#233;stas 
suelen ser m&#225;s &#250;tiles que una numeraci&#243;n de p&#225;gina secuencial. 
<P><B>Ver</B> | <B>Cabecera de p&#225;gina siguiente</B> o la barra espaciadora desplazan la visi&#243;n a la 
parte superior de la p&#225;gina siguiente del documento actual. 
<P><B>Ver</B> | <B>Cabecera de p&#225;gina anterior</B> o la tecla de retroceso muestran la parte superior 
de la p&#225;gina anterior. 
<P>Los comandos <B>P&#225;gina anterior</B>, <B>Actualizar</B> e <B>Ir a la p&#225;gina</B> funcionan solamente si 
el documento contiene comentarios <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A>. 
<P><B>Ver</B> | <B>Ajustar a la ventana</B> o la tecla <B>F6</B> cambia la resoluci&#243;n a la que se muestra el 
documento a fin de ajustar toda la p&#225;gina a la ventana actual. Al repetir este comando 
se va obteniendo una p&#225;gina ajustada a la ventana en anchura y altura, alternativamente. 
<P><B>Ver</B> | <B>Pantalla completa</B> o la tecla  <B>F4</B> muestran el documento a pantalla completa 
(sin barra de t&#237;tulo, barras de desplazamiento, etc.). 
Para volver a la vista normal presione la tecla Esc. 
<P>
<P>
<HR>
<H1><A NAME="Informaci&#243;n_del_documento">Informaci&#243;n del documento</A></H1>
GSview posee un &#225;rea de informaci&#243;n breve, en la parte superior de la ventana, 
para mostrar el nombre del documento, el n&#250;mero de la p&#225;gina actual y su etiqueta 
(si est&#225; disponible) y, mientras el cursor est&#233; sobre la imagen, las coordenadas de 
su ubicaci&#243;n (relativas a la esquina inferior izquierda del papel), expresadas en las 
unidades especificadas por <A HREF="#Opciones">Opciones</A> | <A HREF="#Unidades">Unidades</A>. 
La localizaci&#243;n del cursor es &#250;til para el c&#225;lculo de las dimensiones de las cajas. 
<P>El comando <B>Informaci&#243;n</B> en el men&#250; <A HREF="#Abrir_un_documento">Archivo</A> muestra un cuadro de di&#225;logo con la siguiente 
informaci&#243;n acerca de los comentarios <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A> en el documento actual. 
<P><B>Archivo </B>es el nombre del documento con el camino completo. 
<P><B>Tipo</B> es<B> DSC</B>,<B> EPS</B>, <B>Sin comentarios DSC</B> o <B>Ignorando comentarios DSC</B>. 
<A HREF="#Convención_para_la_Estructuración_de_Documentos">EPS</A> es un  archivo Encapsulado PostScript - un documento con una &#250;nica p&#225;gina 
que contiene un parte de los comentarios <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A> y de los comandos PostScript. 
Los archivos <A HREF="#Convención_para_la_Estructuración_de_Documentos">EPS</A> son usualmente utilizados para su inclusi&#243;n en otros documentos. 
Se mostrar&#225; <B>Ignorando comentarios DSC</B> en caso de que se haya seleccionado 
<A HREF="#Opciones">Opciones</A> | <A HREF="#Ignorar_los_comentarios_DSC">Ignorar los comentarios DSC</A>. 
Esto puede ser fijado de antemano mediante <B>Ctrl-D seguido por</B> o <B>PJL seguido por</B>. 
Ambos indican que el documento no cumple la DSC debido a la presencia de alguna basura 
en el comienzo del mismo. Para corregir el primero, vea <A HREF="#Problemas_usuales">Problemas usuales</A>. 
Para corregir el &#250;ltimo no utilice un controlador HP LaserJet al crear documentos 
PostScript que deban ser distribuidos a otras personas. 
<P><B>T&#237;tulo</B> es un texto que puede ser utilizado como 
t&#237;tulo al imprimir p&#225;ginas iniciales de presentaci&#243;n y separaci&#243;n en colas de impresi&#243;n, 
as&#237; como para rastrear o reconocer documentos. 
<P><B>Fecha</B> indica el d&#237;a y la hora en que el documento fue creado. 
<P><A HREF="#PS_a_EPS">BoundingBox</A> especifica una caja que incluye todos los elementos 
dibujados en la p&#225;gina. Los cuatro valores enteros son las coordenadas de las 
esquinas inferior izquierda 
y superior derecha de la caja expresadas en las unidades por defecto  (1/72 inch). 
<P><B>Orientaci&#243;n </B>indica la orientaci&#243;n por defecto con la que se muestra la p&#225;gina, su valor es 
<B>Vertical</B> o <B>Apaisada</B>.  Vea el men&#250; <A HREF="#Orientación_de_página">Orientaci&#243;n</A>. 
<P><B>Paginaci&#243;n</B> es <B>Ascendente</B>, <B>Descendente</B> o <B>Especial</B>. 
Si <B>Paginaci&#243;n</B> es <B>Descendente</B> GSview invierte autom&#225;ticamente 
las p&#225;ginas cuando las muestra o imprime,  de forma que aparecen en orden descendiente. 
Cuando se extrae o imprime, GSview puede 
recibir la instrucci&#243;n de imprimir las p&#225;ginas en orden descendente (inverso). 
<B>Especial</B> significa que las p&#225;ginas no deben ser reordenadas. 
<P><B>Tama&#241;o del papel</B> proporciona el nombre del formato de papel seguido de la anchura 
y altura del mismo, expresado en las unidades por defecto (1/72 inch). 
<P><B>N&#186; de P&#225;ginas</B> es el n&#250;mero total de p&#225;ginas del documento. 
<P><B>P&#225;gina</B> proporciona la etiqueta y el n&#250;mero de la p&#225;gina actual. 
<P><B>Bitmap </B>es el tama&#241;o en pixels del bitmap mostrado; esto puede ser 
&#250;til si est&#225; copiando la imagen mostrada al portapapeles. 
<P>
<P>
<HR>
<H1><A NAME="Imprimiendo">Imprimiendo</A></H1>
El comando <B>Imprimir</B> en el men&#250; <B>Archivo </B>permite la impresi&#243;n del documento utilizando 
Ghostscript.  Los m&#233;todos utilizados por GSview para imprimir 
son tres: <A HREF="#Impresora_Windows">Impresora Windows</A>, <A HREF="#Impresora_Ghostscript">Salida Ghostscript</A> o <A HREF="#Impresora_PostScript">Impresora PostScript</A>. 
<P><A HREF="#Impresora_Windows">Impresora Windows</A> utiliza Ghostscript para crear bitmaps de cada p&#225;gina 
y las imprime utilizando el controlador est&#225;ndar de Windows de la impresora. 
Este es el m&#233;todo m&#225;s lento, pero deber&#237;a funcionar con la mayor&#237;a de 
impresoras. 
<P><A HREF="#Impresora_Ghostscript">Salida Ghostscript</A> utiliza los controladores de impresora de Ghostscript. 
Este m&#233;todo es m&#225;s r&#225;pido, pero necesitar&#225; que Ghostscript tenga un controlador para 
su impresora y deber&#225; conocer c&#243;mo se llama &#233;ste. Por ejemplo, la HP LaserJet 4 utiliza ljet4. 
Vea la documentaci&#243;n de Ghostscript para m&#225;s detalles. 
<P><A HREF="#Impresora_PostScript">Impresora PostScript</A> no utiliza Ghostscript para imprimir archivos 
PostScript.  En su lugar el archivo es enviado directamente a 
la impresora. 
<P>Hay bastante interacci&#243;n entre los distintos par&#225;metros del cuadro de di&#225;logo 
de impresi&#243;n.  Por ejemplo, si se selecciona <A HREF="#Impresora_Ghostscript">Salida Ghostscript</A> 
el bot&#243;n <A HREF="#Propiedades">Propiedades</A> se desactiva ya que se hace irrelevante. 
M&#225;s detalles aparecen en los temas siguientes. 
<P>Vea tambi&#233;n <A HREF="#Conversiones">Conversiones</A> y <A HREF="#Convertir">Convertir</A>. 
<P>
<A HREF="#Páginas">Páginas</A><BR>
<A HREF="#Impresora_Windows">Impresora Windows</A><BR>
<A HREF="#Impresora_Ghostscript">Impresora Ghostscript</A><BR>
<A HREF="#Impresora_PostScript">Impresora PostScript</A><BR>
<A HREF="#Imprimir_un_archivo">Imprimir un archivo</A><BR>
<A HREF="#Propiedades">Propiedades</A><BR>
<P>
<HR>
<H2><A NAME="P&#225;ginas">P&#225;ginas</A></H2>
Al imprimir se puede seleccionar un rango de p&#225;ginas. 
Dentro de este rango, puede seleccionar todas las p&#225;ginas, las impares 
o las pares. Si, por ejemplo, selecciona las p&#225;ginas impares en el rango 10 a 20, 
la primera impresa ser&#225; la p&#225;gina 11. 
<P>El bot&#243;n <B>P&#225;ginas</B> puede ser desactivado si no est&#225; soportado 
por el m&#233;todo de impresi&#243;n seleccionado. 
<P>Si se selecciona la casilla de verificaci&#243;n <B>Inverso</B> las p&#225;ginas 
se imprimir&#225;n en orden descendiente. Esta casilla est&#225; disponible si el 
documento contiene comentarios <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A>. 
<P>Si desea imprimir las p&#225;ginas seleccionadas desde un documento  conforma a la  <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A> 
pero que tiene un orden de p&#225;ginas especial (es decir, tal que las p&#225;ginas no pueden ser 
reordenadas), seleccione <A HREF="#Impresora_Windows">Impresora Windows</A> e <B>Ignorar DSC</B>. 
<P>
<P>
<HR>
<H2><A NAME="Impresora_Windows">Impresora Windows</A></H2>
Este m&#233;todo utiliza Ghostscript para crear un bitmap para cada p&#225;gina, 
y las p&#225;ginas se imprimen utilizando el controlador de impresora est&#225;ndar de Windows. 
Esto deber&#237;a funcionar con todas las impresoras que soportan gr&#225;ficos de rastreo. 
<P>Por defecto se utiliza un bitmap monocromo a fin de obtener la m&#225;xima velocidad. 
Si desea obtener color necesitar&#225; activar esta posibilidad utilizando 
el bot&#243;n<B> Configuraci&#243;n</B>. 
<P>Si <B>Papel prefijado</B> est&#225; seleccionado (lo que ocurre por defecto), GSview utilizar&#225; 
el tama&#241;o de la p&#225;gina indicado en el men&#250; <B>Formatos </B>e ignorar&#225; cualquier tentativa de 
cambio del tama&#241;o de p&#225;gina de los documentos 
PostScript o PDF. 
Esto es &#250;til con archivos PDF que contengan tanto p&#225;ginas orientadas verticalmente 
como apaisadas. 
Si <B>Papel prefijado</B> no est&#225; seleccionado GSview fijar&#225; el tama&#241;o por defecto de 
las p&#225;ginas a partir del valor dado en el men&#250;<B> Formatos</B>, pero permitir&#225; que dicho tama&#241;o 
sea cambiado. 
<P><B>Opciones </B>est&#225;, normalmente, vac&#237;o, pero puede contener opciones de la l&#237;nea de comandos 
de Ghostscript. &#161;Util&#237;celo con cuidado! 
<P>Este m&#233;todo de impresi&#243;n permite imprimir las p&#225;ginas seleccionadas, 
incluso si un documento PostScript no contiene comentarios <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A>. 
Esto se lleva a cabo interpretando todas las p&#225;ginas, pero enviando a 
la impresora s&#243;lo las requeridas o seleccionadas. Como consecuencia puede ser muy lento. 
<P>
<P>
<HR>
<H2><A NAME="Impresora_Ghostscript">Impresora Ghostscript</A></H2>
El cuadro de di&#225;logo <B>Seleccionar recurso Ghostscript</B> permite la selecci&#243;n del recurso de 
impresi&#243;n y de la resoluci&#243;n propios de Ghostscript. 
La lista de recursos y resoluciones mostrada se encuentra almacenada en 
la secci&#243;n [Devices] de gsview32.ini y est&#225; tomada de la distribuci&#243;n est&#225;ndar 
de la versi&#243;n 6.0 de Ghostscript. 
Puede utilizar otros recursos y resoluciones. 
<P>Es posible a&#241;adir algunas opciones de Ghostscript 
utilizando o el campo <B>Opciones </B>o el bot&#243;n <A HREF="#Propiedades">Propiedades</A>. 
<P>El bot&#243;n <B>uniprint</B> selecciona el recurso denominado uniprint y muestra la lista 
de  los ficheros de configuraci&#243;n (*.upp) disponibles para dicho recurso. 
Si selecciona uno de estos ficheros de configuraci&#243;n, 
el nombre del fichero seleccionado ser&#225; colocado en el campo <B>Opciones </B>del 
cuadro de di&#225;logo Configurar impresi&#243;n. 
V&#233;ase el fichero <B>Devices.htm</B> de Ghostscript para los detalles acerca de 
c&#243;mo configurar el recurso uniprint. 
<P>
<P>
<HR>
<H2><A NAME="Impresora_PostScript">Impresora PostScript</A></H2>
Si se ha seleccionado <B>Impresora PostScript</B> las p&#225;ginas seleccionadas ser&#225;n enviadas 
directamente a la cola de impresi&#243;n, sin utilizar Ghostscript. 
Esto es an&#225;logo a <B>Archivo </B>| <A HREF="#Imprimir_un_archivo">Imprimir un archivo</A>, excepto en que usted debe especificar 
qu&#233; p&#225;ginas desea imprimir. 
<P>Cuando una impresora PostScript est&#225; conectada a trav&#233;s de un puerto serie se requiere, 
en ocasiones, que un car&#225;cter Ctrl+D sea enviado despu&#233;s del archivo PostScript, 
y, dependiendo del comportamiento de otros programas, a veces tambi&#233;n antes. 
Esto es propio del protocolo de comunicaciones a trav&#233;s de puertos serie, utilizado por 
estas impresoras, y no del lenguaje PostScript. 
El cuadro de di&#225;logo <B>Opciones PostScript avanzadas</B> le permite elegir si desea 
enviar Ctrl+D  antes y/o despu&#233;s del archivo PostScript. 
<P>Algunas impresoras PostScript entienden varios lenguajes, por lo que requieren un pr&#243;logo 
para activar el modo de PostScript. 
Por ejemplo, las impresoras HP LaserJet (con la opci&#243;n de PostScript) 
requieren el siguiente pr&#243;logo 
<PRE>
 ^[%-12345X@PJL JOB
 @PJL ENTER LANGUAGE = POSTSCRIPT
</PRE>
<P>y el siguiente ep&#237;logo 
<PRE>
 ^[%-12345X@PJL EOJ
 ^[%12345X
</PRE>
<P>Los ficheros de pr&#243;logo y ep&#237;logo le permiten enviar un fichero 
a la impresora antes y despu&#233;s del env&#237;o del archivo PostScript. 
<P>Otra utilidad del pr&#243;logo podr&#237;a ser solicitar la impresi&#243;n a doble cara 
<PRE>
 &lt;&lt; /Duplex true /Tumble false &gt;&gt; setpagedevice
</PRE>
<P>Si el documento es <A HREF="#Portable_Document_Format">PDF</A> se utilizar&#225; Ghostscript para convertir 
el documento a PostScript, para ser posteriormente enviado a la impresora. 
<P>
<P>
<HR>
<H2><A NAME="Imprimir_un_archivo">Imprimir un archivo</A></H2>
<B>Archivo </B>| <B>Imprimir un archivo</B> env&#237;a un archivo a un puerto local, evitando 
el controlador de impresoras de Windows. 
Esto es &#250;til para enviar un documento a una impresora PostScript, 
o para enviar un fichero producido por Ghostscript a una impresora. 
<P>
<P>
<HR>
<H2><A NAME="Propiedades">Propiedades</A></H2>
El bot&#243;n <B>Propiedades</B> permite que algunos recursos de Ghostscript configuren 
propiedades adicionales, as&#237; como especificar los m&#225;rgenes de impresi&#243;n. 
<P>Se puede especificar un margen de impresi&#243;n para cada impresora. 
El margen de impresi&#243;n es &#250;til para corregir la posible diferencia entre 
el origen de la p&#225;gina para un recurso de impresi&#243;n de Ghostscript 
y el de una impresora particular. 
Incrementando el valor de X la imagen se trasladar&#225; hacia la derecha. 
Incrementando el valor de Y la imagen se trasladar&#225; hacia abajo. 
<P>Las <B>Propiedades</B> son utilizadas t&#237;picamente para establecer el valor de 
BitsPerPixel para una impresora a color o para otros tipos de correcciones sobre 
color o densidad. 
<P>Las <B>Propiedades</B> son espec&#237;ficas de cada impresora. Cambiando el valor de 
la propiedad <B>BitsPerPixel</B> para una impresora no se altera su valor 
para ninguna otra. 
<P>Cuando presiona el bot&#243;n <B>Aceptar</B> en el cuadro de di&#225;logo <B>Propiedades</B> 
los par&#225;metros actuales son escritos en el archivo gsview32.ini 
gsview32.ini 
<P>Algunas <B>Propiedades</B> est&#225;n predefinidas en GSview, pero &#233;stas pueden no coincidir 
con las disponibles en Ghostscript.  Los botones <B>Editar</B> y <B>Nueva</B> 
le permiten modificar las <B>Propiedades</B> disponibles para la impresora elegida. 
Vea el tema <A HREF="#Editar_propiedades">Editar propiedades</A> para m&#225;s detalles. 
<P>
<A HREF="#Editar_propiedades">Editar propiedades</A><BR>
<P>
<HR>
<H3><A NAME="Editar_propiedades">Editar propiedades</A></H3>
No todas las impresoras admiten el uso de <A HREF="#Propiedades">Propiedades</A> opcionales. 
Para descubrir qu&#233; impresoras admiten estas <A HREF="#Propiedades">Propiedades</A> y qu&#233; <A HREF="#Propiedades">Propiedades</A> 
son reconocidas por cada impresora, lea el archivo de Ghostscript 
<B>Devices.htm</B> o examine el c&#243;digo fuente de Ghostscript. 
<P>Hay dos formas de a&#241;adir o editar <A HREF="#Propiedades">Propiedades</A>. 
<P>El primer m&#233;todo utiliza el bot&#243;n <B>Editar</B> o el bot&#243;n <B>Nueva</B> del cuadro 
de di&#225;logo <A HREF="#Propiedades">Propiedades</A>. 
<P>Cada propiedad debe ser o un n&#250;mero o una cadena.  Las propiedades de tipo n&#250;mero 
son equivalentes a la opci&#243;n <B>-d</B> de la l&#237;nea de comandos de Ghostscript.  Las propiedades 
de tipo cadena son equivalentes a la opci&#243;n <B>-s</B> de la l&#237;nea de comandos de 
Ghostscript. 
Cada propiedad consiste en un <B>Nombre</B> y un <B>Valor</B>.  Estos son usados en la forma 
<B>-dNOMBRE=VALOR</B> o <B>-sNOMBRE=VALOR</B>. 
El <B>Valor</B> se elige de la lista de <B>Valores</B>, separados por comas, introducidos en 
el cuadro de di&#225;logo <B>Editar propiedades</B>.  No se deben incluir espacios en 
<B>Nombre</B> ni en <B>Valores</B>. 
<P>Para eliminar una propiedad selecci&#243;nela en el cuadro de di&#225;logo 
<A HREF="#Propiedades">Propiedades</A> y presione el bot&#243;n <B>Editar</B>, despu&#233;s presione 
el bot&#243;n <B>Eliminar</B> situado en el cuadro de di&#225;logo <B>Editar propiedades</B>. 
<P>El segundo m&#233;todo es editar manualmente el archivo INI de GSview. 
<P>Para cada impresora debe a&#241;adir dos secciones a los archivos 
gsview32.ini 
Los siguientes ejemplos muestran c&#243;mo a&#241;adir informaci&#243;n sobre propiedades 
para el controlador cdjcolor. 
A&#241;ada primero una secci&#243;n con los valores actuales. 
Esta secci&#243;n, despu&#233;s de eliminar el primer car&#225;cter, da las opciones que aparecer&#225;n en 
el cuadro de lista <B>Propiedad</B>. 
El primer car&#225;cter es <B>s</B> para cadenas y <B>d</B> para n&#250;meros. 
<PRE>
 [cdjcolor]
 dBitsPerPixel=24
 dDepletion=1
 dShingling=2
 dBlackCorrect=4
</PRE>
<P>A continuaci&#243;n a&#241;ada una secci&#243;n que contenga los valores que se deben mostrar 
en el cuadro de lista <B>Valor</B>. 
<PRE>
 [cdjcolor values]
 dBitsPerPixel=1,3,8,16,24
 dDepletion=1,2,3
 dShingling=0,1,2
 dBlackCorrect=0,1,2,3,4,5,6,7,8,9
</PRE>
<P>GSview a&#241;adir&#225; el valor <B>[No definido]</B> a la lista. 
<P>Cuando GSview imprime un archivo enviar&#225; a Ghostscript el contenido de 
la secci&#243;n [cdjcolor] de 
gsview32.ini 
en la forma siguiente: 
<PRE>
 -dBitsPerPixel=24 -dDepletion=1 -dShingling=2 -dBlackCorrect=4
</PRE>
<P>Si el valor de una propiedad es <B>[No definido]</B> dicha propiedad no ser&#225; 
enviada a Ghostscript. 
<P>
<P>
<HR>
<H1><A NAME="Conversiones">Conversiones</A></H1>
Existen varias formas de convertir archivos PostScript y PDF. 
<P><B>Archivo </B>| <A HREF="#Convertir">Convertir</A> utiliza Ghostscript para convertir PostScript o 
PDF a bitmaps, PostScript o PDF. 
<P><B>Archivo </B>| <A HREF="#Extraer">Extraer</A> permite seleccionar un rango de p&#225;ginas para ser copiadas 
desde un documento PostScript. 
<P><B>Archivo </B>| <A HREF="#PS_a_EPS">PS a EPS</A> permite que las dimensiones de la caja sean actualizadas 
y que la cabecera sea cambiada de PS a EPS. 
Lea la documentaci&#243;n Read the documentation minuciosamente antes de utilizar esta 
posibilidad. 
<P><B>Editar</B> | <A HREF="#Vista_preliminar_en_EPS">A&#241;adir vista preliminar a EPS</A> a&#241;ade una vista preliminar en formato bitmap 
a un archivo EPS. 
<P><B>Editar</B> | <A HREF="#Vista_preliminar_en_EPS">Extraer EPS</A> extrae el PostScript o la vista preliminar 
desde un archivo EPS de DOS. 
<P><B>Editar</B> | <A HREF="#Convertir_a_formato_vectorial">Convertir a formato vectorial</A> utiliza PStoEdit para convertir un archivo 
PostScript o PDF a un formato vectorial que se puede editar. 
<P><B>Editar</B> | <A HREF="#Extraer">Extraer texto</A> utiliza PStoText para extraer texto desde un documento 
PostScript o PDF. 
<P><B>Editar</B> | <A HREF="#Portapapeles">Copiar</A> copia la imagen bitmap mostrada al portapapeles. 
<P><B>Editar</B> | <A HREF="#Portapapeles">Pegar en</A> copia el bitmap independiente del recurso (DIB) del portapapeles a un archivo. 
<P><B>Editar</B> | <A HREF="#Portapapeles">Convertir a Bitmap</A> convierte el bitmap DIB del portapapeles a un bitmap dependiente del recurso 
dej&#225;ndolo en el portapapeles. 
<P>
<A HREF="#Conversión_de_archivos_y_trucos">Conversión de archivos y trucos</A><BR>
<A HREF="#Convertir">Convertir</A><BR>
<A HREF="#Extraer">Extraer</A><BR>
<A HREF="#PS_a_EPS">PS a EPS</A><BR>
<A HREF="#Vista_preliminar_en_EPS">Vista preliminar en EPS</A><BR>
<A HREF="#Vista_preliminar,_pegar_desde_un_archivo">Vista preliminar, pegar desde un archivo</A><BR>
<A HREF="#Convertir_a_formato_vectorial">Convertir a formato vectorial</A><BR>
<A HREF="#Extraer_texto_y_buscar">Extraer texto y buscar</A><BR>
<A HREF="#Portapapeles">Portapapeles</A><BR>
<P>
<HR>
<H2><A NAME="Conversi&#243;n_de_archivos_y_trucos">Conversi&#243;n de archivos y trucos</A></H2>
Algunas conversiones de archivos que pueden ser llevadas a cabo con 
GSview y Ghostscript son: 
<P>Convertir PostScript a PDF. 
<B>Archivo </B>| <A HREF="#Convertir">Convertir</A> seleccione pdfwrite, a 300ppp. 
Con Ghostscript 5.50 las fuentes con codificaciones no est&#225;ndar 
ser&#225;n incluidas como bitmaps.  Si elige una resoluci&#243;n de 72ppp las fuentes tendr&#225;n un 
aspecto tosco.  Ghostscript 6.0 incluir&#225; las fuentes. 
<P>Convertir PDF a PostScript. 
<B>Archivo </B>| <A HREF="#Convertir">Convertir</A> seleccione pswrite, a 300ppp. 
<P>Convertir PostScript de Nivel 2 a PostScript de Nivel 1. 
<B>Archivo </B>| <A HREF="#Convertir">Convertir</A>, seleccione psmono, a 300ppp. 
En lugar de 300ppp deber&#237;a utilizar la resoluci&#243;n de su impresora. 
<P>Convertir a un bitmap. 
<B>Archivo </B>| <A HREF="#Convertir">Convertir</A>, seleccione bmp16m, a 72ppp. 
<P>Convertir a un formato vectorial que se puede editar (PStoEdit). 
<B>Editar </B>| <A HREF="#Convertir_a_formato_vectorial">Convertir a formato vectorial</A> o convertir a PDF 
usando el m&#233;todo anterior. 
<P>Extraer texto (PStoText). 
<B>Editar </B>| <A HREF="#Extraer">Extraer texto</A> 
<P>A&#241;adir una vista preliminar a un archivo EPS. 
<B>Editar </B>| <A HREF="#Vista_preliminar_en_EPS">A&#241;adir vista preliminar a EPS</A>.   Vea <A HREF="#Vista_preliminar_en_EPS">A&#241;adir vista preliminar a EPS</A> para 
m&#225;s detalles. 
<P>Quitar una vista preliminar de un archivo EPS. 
<B>Editar </B>| <A HREF="#Vista_preliminar_en_EPS">Extraer EPS</A> | <B>PostScript</B> 
<P>Mostrar con contornos suaves. 
<B>Formatos </B>| <A HREF="#Parámetros_de_pantalla">Par&#225;metros de pantalla</A>.  Asigne el valor 4 a <A HREF="#Parámetros_de_pantalla">Definici&#243;n de textos</A> y a 
<A HREF="#Parámetros_de_pantalla">Definici&#243;n de gr&#225;ficos</A>.  Necesitar&#225; para ello una tarjeta gr&#225;fica de al menos 8 bits por pixel. 
<P>Guardar el bitmap mostrado. 
<B>Editar</B> | <A HREF="#Portapapeles">Copiar</A> para copiar al portapapeles. 
Para guardar en un archivo BMP, utilice <B>Editar</B> | <A HREF="#Portapapeles">Copiar</A> y despu&#233;s <A HREF="#Portapapeles">Pegar en</A> 
<P>Crear un bitmap con contornos suaves (anti-aliasing). 
1. Muestre con contornos suaves y guarde el bitmap mostrado. 
O 
2. <A HREF="#Convertir">Convertir</A> utilizando un recurso de bitmap y realice las asignaciones 
de propiedades siguientes. 
<PRE>
   -dTextAlphaBits=4 -dGraphicsAlphaBits=4
</PRE>
<P>
<P>
<HR>
<H2><A NAME="Convertir">Convertir</A></H2>
<B>Archivo </B>| <B>Convertir</B> utiliza Ghostscript para convertir PostScript o PDF 
a bitmaps, PostScript o PDF. 
<P>Necesitar&#225; seleccionar un recurso de salida para Ghostscript y la resoluci&#243;n. 
La lista de recursos y resoluciones disponibles por defecto se encuentra almacenada 
en la secci&#243;n [Convert] de gsview32.ini y est&#225; tomada de la distribuci&#243;n 
est&#225;ndar de Ghostscript 6.0. 
Puede usar otros recursos o resoluciones. 
<P>Pueden ser a&#241;adidas algunas opciones de Ghostscript utilizando ya sea 
el campo <B>Opciones </B>o el bot&#243;n <A HREF="#Propiedades">Propiedades</A>. 
<P>Todas las p&#225;ginas, individualmente o cualquier combinaci&#243;n de ellas, pueden ser convertidas. 
Los botones <B>Todas</B>, <B>Impares</B> y <B>Pares</B> proporcionan formas r&#225;pidas de seleccionar p&#225;ginas. 
Si se marca un &#250;nico bloque de p&#225;ginas contiguas, los botones <B>Impares</B> y <B>Pares</B> 
seleccionaran las p&#225;ginas impares y pares dentro de este rango. 
La casilla de verificaci&#243;n <B>Inverso</B> provoca que que las p&#225;ginas sean convertidas 
en orden descendiente. 
<P>Si <B>Papel prefijado</B> est&#225; seleccionado (lo que ocurre por defecto), GSview utilizar&#225; el tama&#241;o 
de p&#225;gina indicado en el men&#250; Formatos e ignorar&#225; cualquier intento de cambio del tama&#241;o de 
p&#225;gina por parte de los documentos PostScript  o PDF. 
Esto es &#250;til para archivos PDF que contienen una mezcla de p&#225;ginas con 
orientaci&#243;n vertical y apaisada. 
Si <B>Papel prefijado</B> no est&#225; seleccionado GSview asignar&#225; el tama&#241;o por defecto de la p&#225;gina 
desde el men&#250; Formatos, pero permite cambios en el tama&#241;o de la p&#225;gina. 
<P>Vea tambi&#233;n <A HREF="#Conversiones">Conversiones</A>. 
<P>
<P>
<HR>
<H2><A NAME="Extraer">Extraer</A></H2>
<B>Extraer</B> permite copiar a un nuevo archivo un 
cierto rango de p&#225;ginas del archivo actual . Por ejemplo, 
pueden extraerse diez p&#225;ginas cualesquiera del archivo 
actual y guardarlas en otro archivo para enviarlas posteriormente 
a una impresora. 
Si selecciona el <B>Orden inverso</B>, las p&#225;ginas extra&#237;das 
estar&#225;n en orden descendente con relaci&#243;n a su numeraci&#243;n. 
<P>Vea tambi&#233;n <A HREF="#Conversiones">Conversiones</A>. 
<P>
<P>
<HR>
<H2><A NAME="PS_a_EPS">PS a EPS</A></H2>
En general no es posible convertir un archivo PostScript a uno <A HREF="#Convención_para_la_Estructuración_de_Documentos">EPS</A> 
Sin embargo, buena parte de archivos PostScript de una sola 
p&#225;gina pueden convertirse a <A HREF="#Convención_para_la_Estructuración_de_Documentos">EPS</A> cambiando la primera l&#237;nea 
del archivo a 
<PRE>
 %!PS-Adobe-3.0 EPSF-3.0
</PRE>
<P>y a&#241;adiendo o arreglando entonces  el comentario <B>%%BoundingBox</B>. 
<P>Los archivos EPS son frecuentemente utilizados para su 
inclusi&#243;n en otros archivos y por esta raz&#243;n requieren 
el comentario: 
<PRE>
  %%BoundingBox: llx lly urx ury
</PRE>
<P>donde llx, lly, urx y ury son enteros que proporcionan las coordenadas 
x e y de la esquina inferior izquierda (ll) y de la esquina superior 
derecha (ur) de un BoundingBox que encierra todas las marcas hechas 
en la p&#225;gina. 
<P><B>Cuando se usa incorrectamente, el comando PS a EPS puede producir 
archivos con comentarios DSC incorrectos. Tal archivo producir&#225; 
problemas cuando se pretenda incorporar en otro archivo.</B> 
<P>Para convertir un archivo PostScript a <A HREF="#Convención_para_la_Estructuración_de_Documentos">EPS</A> el archivo original 
<B>debe</B> ser un documento de <B>una sola p&#225;gina</B>. Si el documento 
contiene comentarios <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A> y tiene varias p&#225;ginas, extraiga previamente 
la p&#225;gina deseada mediante <A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Extraer">Extraer</A>. 
Si el documento no contiene comentarios <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A>, necesita editar 
el archivo y, manualmente, extraer la p&#225;gina deseada. 
<P>Los archivos <A HREF="#Convención_para_la_Estructuración_de_Documentos">EPS</A> <B>no deben</B> usar ninguno de los siguientes 
operadores: 
<PRE>
 banddevice   clear         cleardictstack  copypage
 erasepage    exitserver    framedevice     grestoreall
 initclip     initgraphics  initmatrix      quit
 renderbands  setglobal     setpagedevice   setpageparams
 setshared    startjob      letter          note
 legal        a3            a4              a5
</PRE>
<P>Los siguientes operadores deben usarse con cuidado: 
<PRE>
 nulldevice   setgstate     sethalftone    setmatrix
 setscreen    settransfer   setcolortransfer
</PRE>
<P>Es responsabilidad suya asegurarse de que se respeten las 
condiciones anteriores. 
<P>Para verificar si un archivo contiene alguno de los operadores 
anteriores seleccione <A HREF="#Opciones">Opciones</A> | <A HREF="#Avisos_EPS">Avisos EPS</A> y entonces <A HREF="#Abrir_un_documento">Abrir</A> 
el archivo deseado. Despu&#233;s de que la p&#225;gina aparezca pulse 
para <A HREF="#Abrir_un_documento">Cerrar</A> el archivo y entonces vea los mensajes de 
Ghostscript con <A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Mostrar_mensajes">Mostrar mensajes</A>. 
Si alguno de los operadores anteriores ha sido usado podr&#225; 
encontrar l&#237;neas como 
<PRE>
 Warning: EPS files must not use ...
</PRE>
<P>Si aparecen estos avisos  <B>no</B> use <B>PS a EPS</B>. 
No olvide desactivar <A HREF="#Avisos_EPS">Avisos EPS</A> cuando acabe. 
<P>El documento debe haber aparecido completamente en la pantalla 
antes de usar <B>PS a EPS</B>. 
<P>Para archivos sin comentarios <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A>, <B>PS a EPS</B> permite especificar 
un BoundingBox, entonces guardar un archivo <A HREF="#Convención_para_la_Estructuración_de_Documentos">EPS</A> consistente 
en un envoltorio <A HREF="#Convención_para_la_Estructuración_de_Documentos">EPS</A> del archivo original. 
<P>Para archivos con comentarios <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A>, <B>PS a EPS</B> cambiar&#225; la primera 
l&#237;nea del archivo para que aparezca 
<PRE>
 %!PS-Adobe-3.0 EPSF-3.0
</PRE>
<P>y entonces permite cambiar o a&#241;adir el comentario <B>%%BoundingBox</B> 
<P>Para archivos <A HREF="#Convención_para_la_Estructuración_de_Documentos">EPS</A>, <B>PS a EPS</B> permite cambiar el comentario 
<B>%%BoundingBox</B>. 
<P><B>PS a EPS</B> no recorta el documento a su <B>%%BoundingBox</B>. 
Para hacerlo se requerir&#237;a cambiar el c&#243;digo PostScript. 
<B>PS a EPS</B> solo cambia los comentarios <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A>. 
<P>Si est&#225; activado el <B>C&#225;lculo autom&#225;tico del BoundingBox</B>, 
GSview calcula el BoundingBox de los pixels no blancos. 
Si no lo est&#225;, puede seleccionar el BoundingBox manualmente 
con el rat&#243;n haciendo click respectivamente a la izquierda, 
abajo, a la derecha y arriba. 
<P><B>PS a EPS</B> no a&#241;ade vista preliminar al archivo. 
Si desea a&#241;adirla debe hacerlo con <B>Editar </B>| <A HREF="#Vista_preliminar_en_EPS">A&#241;adir vista preliminar a EPS</A> 
despu&#233;s de haber creado un <A HREF="#Convención_para_la_Estructuración_de_Documentos">EPS</A> con el <B>%%BoundingBox</B> correcto. 
<P>Ver tambi&#233;n <A HREF="#Vista_preliminar_en_EPS">A&#241;adir vista preliminar a EPS</A>, <A HREF="#Extraer">Extraer</A>, <A HREF="#Avisos_EPS">Avisos EPS</A> y 
<A HREF="#Conversiones">Conversiones</A>. 
<P>
<P>
<HR>
<H2><A NAME="Vista_preliminar_en_EPS">Vista preliminar en EPS</A></H2>
<B>A&#241;adir vista preliminar a EPS</B> toma un  bitmap del monitor  y 
lo usa para a&#241;adir una vista preliminar a un archivo EPS. 
<B>A&#241;adir vista preliminar a EPS</B> puede crear un archivo DOS EPS 
con vista preliminar en formato Windows Metafile o TIFF, o un 
archivo EPSI con vista preliminar en formato Interchange. 
Para usar  el comando <B>A&#241;adir vista preliminar a EPS</B> hay que 
seguir los siguientes pasos. 
<P>1. Desactivar <B>Opciones </B>| <A HREF="#Ignorar_los_comentarios_DSC">Ignorar los comentarios DSC</A> 
<P>2. Asegurarse de que el documento tiene un BoundingBox correcto. 
<A HREF="#Opciones">Opciones</A> | <A HREF="#Mostrar_BoundingBox">Mostrar BoundingBox</A> es &#250;til para comprobar 
el BoundingBox. 
Puede a&#241;adirse o cambiarse el BoundingBox  usando <A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#PS_a_EPS">PS a EPS</A>. 
<P>3. Seleccionar <A HREF="#Orientación_de_página">Orientaci&#243;n</A> | <A HREF="#Orientación_de_página">Normal</A>. 
<P>4. Seleccionar <A HREF="#Tamaño_de_página">Formatos</A> | <A HREF="#Parámetros_de_pantalla">Par&#225;metros de pantalla</A> y utilizar 
una resoluci&#243;n adecuada para la vista preliminar. 
Si la resoluci&#243;n es muy alta, el archivo EPS construido ser&#225; 
excesivamente grande. 
<P>5. <A HREF="#Abrir_un_documento">Abrir</A> un archivo EPS que no contenga vista preliminar. 
<P>6.  Seleccionar <B>Editar </B>| <B>A&#241;adir vista preliminar a EPS</B>, 
a continuaci&#243;n el formato de la vista y a continuaci&#243;n el 
nombre del nuevo archivo EPS.  GSview escribir&#225; un nuevo archivo 
que contiene el archivo EPS original y una vista preliminar 
obtenida de la imagen que aparece en el monitor. 
Los formatos disponibles para esta vista preliminar son: 
<B>Interchange</B>,  <B>TIFF 4</B>, <B>TIFF 6 sin comprimir</B>, 
<B>TIFF 6 comprimido</B> y <B>Windows Metafile</B>. 
Si se a&#241;ade una vista Interchange, el archivo debe contener 
una l&#237;nea <B>%%EndComments</B>, pues en caso contrario GSview puede 
incorporar la vista preliminar en un sitio inadecuado. 
Una vista preliminar Interchange es siempre monocrom&#225;tica. 
Una vista preliminar TIFF 4 es una imagen <B>Baseline Bilevel</B> 
(1 bit/pixel) sin compresi&#243;n, como se describe en el memorandum 
TIFF 6.0 pero eludiendo etiquetas, que no est&#225;n descritas en las 
especificaciones TIFF 4. 
WordPerfect 5.1 requiere una vista preliminar  TIFF 4. 
Una vista preliminar TIFF 6 es una imagen <B>Baseline Bilevel</B>, 
o una Baseline Palette-colour Image (4 o 8 bits/pixel) 
o una Baseline RGB Full Colour Image (24 bits/pixel) 
de acuerdo con las especificaciones TIFF 6.0. 
Las vistas preliminares TIFF 6 pueden estar comprimidas o no. 
Una vista preliminar Windows Metafile contiene un bitmap sin 
comprimir. 
<P>7. 
Restablecer <A HREF="#Orientación_de_página">Orientaci&#243;n</A> | <A HREF="#Orientación_de_página">Normal</A>, y 
<A HREF="#Tamaño_de_página">Formatos</A> | <A HREF="#Parámetros_de_pantalla">Par&#225;metros de pantalla</A> a sus valores iniciales. 
<P>Para extraer la parte PostScript o la vista preliminar de un 
archivo DOS EPS, use <A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Abrir_un_documento">Seleccionar archivo</A> seguido 
de  <B>Editar </B>| <B>Extraer del archivo EPS</B> seleccionando entonces 
<B>La parte PostScript</B> o <B>La vista preliminar</B>. 
<P>Ver tambi&#233;n <A HREF="#PS_a_EPS">PS a EPS</A>. 
<P>
<P>
<HR>
<H2><A NAME="Vista_preliminar,_pegar_desde_un_archivo">Vista preliminar, pegar desde un archivo</A></H2>
El comando <B>Editar </B>| <B>A&#241;adir vista preliminar</B> 
| <B>Pegar desde un archivo</B> permite a&#241;adir al archivo EPS 
un archivo  TIFF o WMF existente, para crear un archivo DOS EPS. 
Esto es &#250;til para aplicaciones que pueden exportar al formato 
EPS y al WMF, pero no pueden crear archivos DOS EPS con vista preliminar 
WMF. 
El archivo EPS <B>debe</B> contener un BoundingBox que corresponda 
con la vista preliminar TIFF o WMF. 
No es necesario mostrar en pantalla el archivo EPS, 
<B>Pegar desde un archivo</B>  puede ser usado sin m&#225;s que abrir 
el archivo EPS con <A HREF="#Abrir_un_documento">Seleccionar archivo</A>. 
<P>Puede tambi&#233;n a&#241;adir una vista preliminar sin parecido con 
el archivo PostScript, aunque eso no es lo m&#225;s conveniente. 
<P>
<P>
<HR>
<H2><A NAME="Convertir_a_formato_vectorial">Convertir a formato vectorial</A></H2>
Puede convertir un archivo PostScript o PDF a un formato 
vectorial editable usando el programa <B>pstoedit</B> de Wolfgang Glunz. 
<B>pstoedit</B> est&#225; licenciado de acuerdo con la GNU Public Licence. 
Los ejecutables est&#225;n incluidos en GSview con la autorizaci&#243;n de 
Wolfgang Glunz. 
El ejecutable <B>pstoedit.exe</B>, en modo l&#237;nea de comandos, y el 
manual <B>pstoedit.htm</B> est&#225;n incluidos en el directorio pstoedit. 
La p&#225;gina principal de pstoedit se encuentra en 
<PRE>
 http://www.geocities.com/SiliconValley/Network/1958/pstoedit/
</PRE>
<P>Para actualizaciones de pstoedit, adem&#225;s de dicha p&#225;gina, puede usar 
<PRE>
 http://www.cs.wisc.edu/~ghost/gsview/pstoedit.htm
</PRE>
<P>Para usar <B>pstoedit</B> desde dentro de GSview, use 
<B>Editar | Convertir a formato vectorial</B>. Se mostrar&#225; entonces 
sucesivamente tres cuadros de di&#225;logo. 
<P>El primero de ellos es para la configuraci&#243;n de pstoedit. 
<P>Seleccionar un <B>Formato</B> de salida deseado. 
<P>En caso de que el archivo PostScript contenga texto y el 
formato de salida no lo soporte (por ejemplo,  gnuplot) 
debe seleccionarse <B>Dibujar el texto usando pol&#237;gonos</B>. 
Esto puede producir archivos con un tama&#241;o grande. 
<P>Cuando se selecciona  <B>Llevar a c&#243;digo ISO-Latin1</B>, pstoedit 
hace corresponder los c&#243;digos de car&#225;cter a los usados en la 
p&#225;gina de c&#243;digos ISO-Latin1. Esta es la p&#225;gina de c&#243;digos usada 
por HTML y MS-Windows. Esta es la configuraci&#243;n por defecto. 
Si desactiva este &#237;tem, la p&#225;gina de c&#243;digos del archivo PostScript 
de entrada ser&#225; pasada, sin cambios, al archivo de salida. 
<P>Si el formato de salida no soporta curvas, en el modo que PostScript 
utiliza, todas las curvas ser&#225;n aproximadas por l&#237;neas rectas. 
La opci&#243;n <B>Contraste</B> se usa para controlar esta aproximaci&#243;n. 
Este par&#225;metro es convertido directamente a un comando setflat de 
PostScript. Con valores peque&#241;os se obtienen mejores aproximaciones, 
pero se necesitan m&#225;s segmentos de l&#237;nea. 
<P>A veces las fuentes incorporadas en un programa PostScript no 
tienen un nombre. Eso es lo que ocurre, por ejemplo, con los 
archivos PostScript que dvips genera. En tal caso, pstoedit 
utiliza una fuente de reemplazamiento. Por defecto tal fuente 
es Courier, aunque pueden especificarse otras mediante la 
opci&#243;n <B>Fuente</B>. Algunos nombres alternativos, adem&#225;s de Courier, 
son  Helvetica y Times-Roman. 
<P>Algunos formatos de salida soportan opciones adicionales. Para 
m&#225;s detalles consulte el manual de pstoedit. Por ejemplo, el 
formato de salida java utiliza <B>Opciones del controlador</B> para 
especificar el nombre de las clases java. 
<P>El segundo cuadro de di&#225;logo (omitido si no hay numeraci&#243;n de 
las p&#225;ginas) especifica 
la p&#225;gina a convertir o, en caso de estar 
soportado por el formato de salida, un rango de p&#225;ginas. 
<P>El tercer cuadro de di&#225;logo permite especificar 
el nombre del archivo de salida. 
<P>No todos los formatos <B>pstoedit</B> soportan gr&#225;ficos bitmap. 
Si necesita una salida bitmap consulte 
<A HREF="#Conversión_de_archivos_y_trucos">Conversi&#243;n de archivos y trucos</A>. 
<P>Para m&#225;s detalles debe leer el manual de pstoedit. 
<P>Ver tambi&#233;n <A HREF="#Conversiones">Conversiones</A>. 
<P>
<P>
<HR>
<H2><A NAME="Extraer_texto_y_buscar">Extraer texto y buscar</A></H2>
En general, extraer texto de un archivo PostScript no es una 
operaci&#243;n trivial. Puede haber palabras partidas. Puede haber 
problemas por la codificaci&#243;n. Pueden haberse usado ligaduras 
(por ejemplo reemplazar 'fi' con un &#250;nico car&#225;cter). Puede que 
no exista relaci&#243;n entre la posici&#243;n de una palabra en el archivo 
PostScript y su posici&#243;n en la p&#225;gina. El nivel de &#233;xito alcanzado 
al obtener texto de un archivo PostScript depende fuertemente 
del archivo en cuesti&#243;n. 
<P>GSview tiene dos m&#233;todos para extraer texto de un archivo PostScript. 
<P>El m&#233;todo r&#225;pido extrae todo el texto de las cadenas PostScript. 
<P>El segundo m&#233;todo, de mayor precisi&#243;n, usa pstotext y Ghostscript 
para extraer texto de los archivos PostScript. 
<P>El m&#233;todo que se va a utilizar para extracci&#243;n y b&#250;squeda se 
selecciona mediante  <A HREF="#Opciones">Opciones</A> | <B>Extraer texto con PStoText</B>. 
Consulte el t&#243;pico apropiado m&#225;s abajo. 
<P>Ver tambi&#233;n <A HREF="#Conversiones">Conversiones</A>. 
<P>
<A HREF="#Extraer_texto_y_buscar_rápidamente">Extraer texto y buscar rápidamente</A><BR>
<A HREF="#Extraer_texto_y_buscar_con_PStoText">Extraer texto y buscar con PStoText</A><BR>
<P>
<HR>
<H3><A NAME="Extraer_texto_y_buscar_r&#225;pidamente">Extraer texto y buscar r&#225;pidamente</A></H3>
Es com&#250;n en los documentos PostScript que contengan el texto 
en el mismo orden en que aparece en la p&#225;gina, rodeado de 
par&#233;ntesis y con cadenas PostScript en las inmediaciones. 
L&#237;neas completas pueden aparecer en una cadena, o una palabra 
por cadena. Para este tipo de documentos la extracci&#243;n del 
texto puede resultar razonablemente exitosa. 
<P><B>Editar </B>| <A HREF="#Extraer">Extraer texto</A> extraer&#225; el texto contenido en 
cadenas de las p&#225;ginas especificadas y lo guardar&#225; en un archivo 
de texto. 
Los saltos de l&#237;nea en este archivo de texto se corresponden 
con l&#237;neas en el documento. Los espacios en el archivo de texto 
se corresponden con espacios entre cadenas o a para separar cadenas. 
Un m&#233;todo m&#225;s efectivo para extraer texto es usar 
ps2ascii.ps distribuido con Ghostscript, o usar el programa 
<B>PStoText</B> listado en la p&#225;gina <A HREF="#World_Wide_Web">WWW</A> de Ghostscript. 
<B>PStoText</B> puede usarse desde GSview mediante 
<B>Opciones </B>| <B>Extraer texto con PStoText</B>. 
<P><B>Editar </B>| <A HREF="#Extraer_texto_y_buscar">Buscar</A> buscar&#225; un texto mostrando la primera 
p&#225;gina que lo contenga.  <A HREF="#Extraer_texto_y_buscar">Buscar</A> pregunta, sucesivamente, 
por el texto a buscar y el rango de p&#225;ginas en el que debe 
realizarse la b&#250;squeda. 
Los comentarios precedentes sobre la extracci&#243;n de texto 
en archivos PostScript deben tenerse en cuenta.  <A HREF="#Extraer_texto_y_buscar">Buscar</A> 
lo primero que hace es extraer el texto del documento y luego 
busca la cadena de texto pedida, ignorando todos los espacios, 
tanto en el documento, como en el texto a buscar. May&#250;sculas y 
min&#250;sculas se consideran equivalentes. As&#237;, en la b&#250;squeda del 
texto <B>san</B> servir&#225; tanto <B>San</B> como <B>artesana</B>. 
No se da informaci&#243;n sobre la posici&#243;n de la palabra en la p&#225;gina, 
ya que esta informaci&#243;n posible sin un int&#233;rprete PostScript completo. 
<A HREF="#Extraer_texto_y_buscar">Buscar</A> no funciona en archivos que no sean DSC ni en archivos DSC 
con las p&#225;ginas ordenadas de forma especial. 
<P><B>Editar </B>| <A HREF="#Extraer_texto_y_buscar">Buscar siguiente</A> continuar&#225; la b&#250;squeda a partir de 
la p&#225;gina siguiente. 
<P>
<P>
<HR>
<H3><A NAME="Extraer_texto_y_buscar_con_PStoText">Extraer texto y buscar con PStoText</A></H3>
Este m&#233;todo usa pstotext y Ghostscript para extraer texto de 
un archivo PostScript. Antes de cualquier extracci&#243;n o b&#250;squeda 
de texto, Ghostscript y pstotext procesan el documento PostScript 
completo para producir un archivo de texto realizado con precisi&#243;n. 
Esta primera etapa puede requerir bastante tiempo, pero una vez 
finalizada la b&#250;squeda o extracci&#243;n de texto es muy r&#225;pida. 
Con este procedimiento la b&#250;squeda, junto a la p&#225;gina se localiza 
la posici&#243;n del texto en ella. 
<P><B>pstotext</B> usa el conjunto de caracteres ISO-Latin1.  Consulte la 
documentaci&#243;n de pstotext para m&#225;s detalles. 
<PRE>
  http://www.research.digital.com/SRC/virtualpaper/pstotext.html
</PRE>
<P><A HREF="#Orientación_de_página">Orientaci&#243;n</A> permite fijar la direcci&#243;n adecuada para el texto. 
<P><B>Editar </B>| <A HREF="#Extraer_texto_y_buscar">Extraer el texto</A> permite extraer el texto contenido 
en las p&#225;ginas seleccionadas del archivo PostScript y guardarlo 
en un archivo de texto. 
<P>Las palabras pueden copiarse al portapapeles usando <B> Editar</B> | <A HREF="#Portapapeles">Copiar</A>. 
<P><B>Editar </B>| <A HREF="#Extraer_texto_y_buscar">Buscar</A> buscar&#225; una cadena de caracteres y mostrar&#225; 
la primera p&#225;gina que contenga esa cadena.  <A HREF="#Extraer_texto_y_buscar">Buscar</A> pregunta 
por un texto a buscar y un rango de p&#225;ginas en el que realizar la 
b&#250;squeda. 
El texto a buscar se separa primero en palabras. Para cada palabra 
buscada se hace una b&#250;squeda a fin de encontrar su presencia en alguna 
de las palabras del documento. 
Buscar la palabra <B>copia</B> encontrar&#225; <B>copia</B> <B>copias</B> y <B>fotocopia</B> 
En las b&#250;squedas pueden usarse los comodines <B>*</B> (cero o m&#225;s caracteres) 
y <B>?</B> (cualquier car&#225;cter), pero no tiene sentido usarlos al principio o 
al final de una palabra. 
Los comodines no se extienden m&#225;s all&#225; de las palabras buscadas. 
Pueden especificarse varias palabras, por ejemplo <B>GSview es un</B>. 
Si el texto buscado es encontrado, se muestra la p&#225;gina que lo contiene 
resaltando la primera palabra buscada. 
<A HREF="#Extraer_texto_y_buscar">Buscar</A> no funciona con documentos que no sean DSC ni con documentos DSC 
con las p&#225;ginas ordenadas en una forma no usual. 
<P><B>Editar</B>| <A HREF="#Extraer_texto_y_buscar">Buscar siguiente</A> continuar&#225; la b&#250;squeda. 
<P>Para la mayor parte de los archivos PostScript debe usar 
<A HREF="#Opciones">Opciones</A> | <B>Extraer texto con PStoText</B> |<B> Normal</B>. 
<P><A HREF="#Opciones">Opciones</A> | <B>Extraer texto con PStoText</B> |<B> P&#225;gina de c&#243;digos Dvips Cork</B> 
solo es relevante para archivos PostScript producidos con 
dvips a partir de documentos TeX o LaTeX. Cuando se usa esta opci&#243;n 
<B>pstotext</B> utiliza la p&#225;gina de c&#243;digos de Cork (T1 encoding) en lugar de la 
p&#225;gina de c&#243;digos originaria de TeX. Desafortunadamente los archivos 
producidos con dvips no distinguen cual fue la p&#225;gina de c&#243;digos 
usada. 
<P>
<P>
<HR>
<H2><A NAME="Portapapeles">Portapapeles</A></H2>
La ventana GSview puede ser copiada al portapapeles como un fichero bitmap 
seleccionando <B>Copiar</B> del men&#250; <B>Editar</B>. 
El fichero bitmap ser&#225; un fichero Bitmap, Device Independent, (Formato DIB/BMP). 
<P>Una forma alternativa para conseguir una salida bitmap desde Ghostscript es 
usar uno de los controladores BMP. Ver <A HREF="#Imprimiendo">Imprimir</A>. 
<P><B>Pegar en</B> copia un  Bipmat, Device Independent, desde el portapapeles 
(si est&#225; disponible) a un fichero BMP. 
<P><B>Convertir a Bitmap</B> convierte entre Bitmap <B>Device Independent</B> y 
un Bitmap <B>Device Dependent</B>. 
Si el portapapeles contiene un  Bitmap, Device Independent, (formato BMP), 
este es convertido a un Bitmap, Device Dependent, y a&#241;adido al portapapeles. 
Si el portapapeles no contiene una paleta de colores, se crea una 
desde el  Bitmap, Device Independent, y se a&#241;ade al portapapeles. 
Esta opci&#243;n est&#225; presente porque algunas aplicaciones (especialmente 
Paintbrush de Windows) no reconocen un  Bitmap, Device Independent, en el portapapeles. 
Si se usa <A HREF="#Extraer_texto_y_buscar">Extraer el texto</A> o <A HREF="#Extraer_texto_y_buscar">Buscar</A> en un documento con la opci&#243;n 
<B>Extraer texto con PStoText</B> activada, 
GSview crea un &#237;ndice de las palabras en el documento.  Si alguna palabra se 
marca con el rat&#243;n, <B>Copiar</B> copiara estas palabras en el portapapeles en vez 
de copiar un fichero bitmap. No puede marcarse ning&#250;n texto hasta que o <A HREF="#Extraer_texto_y_buscar">Extraer el texto</A> 
o <A HREF="#Extraer_texto_y_buscar">Buscar</A> han sido usadas con <B>Extraer texto con PStoText</B> activado en <A HREF="#Opciones">Opciones</A>. 
<P>
<P>
<HR>
<H1><A NAME="Medir">Medir</A></H1>
Pueden medirse longitudes  usando el cursor de ubicaci&#243;n  que aparece en 
la barra de estado, o con  la ventana de di&#225;logo que se activa en <B>Editar </B>| <B>Medir</B>. 
<P>Esta ventana de di&#225;logo muestra el lugar del comienzo, lugar del final, 
diferencia, longitud y &#225;ngulo entre estas dos ubicaciones. 
El lugar del comienzo se marca al hacer click en el bot&#243;n izquierdo del rat&#243;n. 
El lugar del comienzo por defecto es la esquina izquierda de la p&#225;gina. 
Las unidades pueden darse en pt, mm, in, o de forma personalizada. 
<P>Las unidades personalizadas  permiten visualizar las coordenadas tal y como  aparecen 
en un fichero PostScript. 
Las unidades personalizadas son normalmente especificadas empezando con una matriz 
identidad y  realizando despu&#233;s una serie de transformaciones. 
Si un fichero PostScript utiliza la orientaci&#243;n apaisada mediante 
<PRE>
 90 rotate
 0 -595 translate
</PRE>
<P>las coordenadas de usuario ser&#225;n visualizadas cuando 
se introduzcan los siguiente valores en  la ventana de di&#225;logo 
C&#225;lculo de la Transformaci&#243;n: 
<PRE>
 Personalizado
 Matriz inicial
 90 giro
 0 -595 translaci&#243;n
 Matriz inversa
 Aceptar
</PRE>
<P>La Matriz de Transformaci&#243;n Actual (Current Transformation Matrix, CTM) se muestra en 
la parte superior de la ventana de di&#225;logo.  Si a usted le gustan las matem&#225;ticas 
puede introducir directamente los valores de CTM. 
Es m&#225;s f&#225;cil introducir los valores  en los campos de edici&#243;n que aparecen al 
seleccionar<B> Personalizado</B>, 
lo que no tendr&#225; efecto hasta que uno de los botones de transformaci&#243;n 
(Traslaci&#243;n, Giro, Escala) haya sido pulsado. 
<P>Ver tambi&#233;n <A HREF="#Unidades">Unidades</A>. 
<P>
<P>
<HR>
<H1><A NAME="Opciones">Opciones</A></H1>
El men&#250; <B>Opciones</B> ofrece las siguientes posibilidades: 
<P>
<A HREF="#Configuración_sencilla">Configuración sencilla</A><BR>
<A HREF="#Configuración_avanzada">Configuración avanzada</A><BR>
<A HREF="#Sonidos">Sonidos</A><BR>
<A HREF="#Unidades">Unidades</A><BR>
<A HREF="#Idioma">Idioma</A><BR>
<A HREF="#Extraer_con_PStoText">Extraer con PStoText</A><BR>
<A HREF="#Mensajes_DSC">Mensajes DSC</A><BR>
<A HREF="#Guardar_opciones">Guardar opciones</A><BR>
<A HREF="#Proteger_los_ficheros">Proteger los ficheros</A><BR>
<A HREF="#Guardar_el_último_directorio">Guardar el último directorio</A><BR>
<A HREF="#Mostrar_barra_de_botones">Mostrar barra de botones</A><BR>
<A HREF="#Ajustar_a_la_ventana_a_la_página">Ajustar a la ventana a la página</A><BR>
<A HREF="#Apertura_rápida">Apertura rápida</A><BR>
<A HREF="#Actualización_automática">Actualización automática</A><BR>
<A HREF="#Recortar_EPS">Recortar EPS</A><BR>
<A HREF="#Avisos_EPS">Avisos EPS</A><BR>
<A HREF="#Ignorar_los_comentarios_DSC">Ignorar los comentarios DSC</A><BR>
<A HREF="#Mostrar_BoundingBox">Mostrar BoundingBox</A><BR>
<P>
<HR>
<H2><A NAME="Configuraci&#243;n_sencilla">Configuraci&#243;n sencilla</A></H2>
La Configuraci&#243;n sencilla le permite seleccionar la versi&#243;n de 
Ghostscript a utilizar.  Se supone que la versi&#243;n instalada es 
Aladdin Ghostscript 5.50 o posterior. 
Si no se tiene instalado Ghostscript, vea c&#243;mo <A HREF="#Conseguir_Ghostscript">Conseguir Ghostscript</A>. 
Para un mayor control sobre la configuraci&#243;n de GSview, v&#233;ase <A HREF="#Configuración_avanzada">Configuraci&#243;n avanzada</A>. 
<P>La Configuraci&#243;n sencilla fijar&#225; la ruta correcta para Ghostscript 
y copiar&#225; algunas impresoras por defecto en el fichero INI. 
No se modifica el registro o el men&#250; de Inicio. 
<P>
<P>
<HR>
<H2><A NAME="Configuraci&#243;n_avanzada">Configuraci&#243;n avanzada</A></H2>
<B>Ghostscript DLL</B> instruye a  GSview sobre d&#243;nde encontrar Ghostscript. 
Para Win32 la ruta por defecto es 
<PRE>
 c:\gs\gsN.NN\bin\gsdll32.dll
</PRE>
<P>Introduzca la ruta correcta para Ghostscript en el 
campo <B>Camino de b&#250;squeda de Ghostscript</B>. 
Esta ruta debe incluir los directorios donde se encuentran las librer&#237;as Ghostscript 
(gs_*.ps y Fontmap) y las fuentes Ghostscript  (*.pfb). Por ejemplo: 
<PRE>
  c:\gs\gsN.NN\lib;c:\gs\fonts
</PRE>
<P>NO PONER <B>-I</B> antes de la ruta. 
<P>El campo de <B>Opciones Ghostscript</B> puede estar vac&#237;o. 
Si se desea desactivar la opci&#243;n <B>Platform Fonts</B> en el sistema operativo 
MS-Windows, se debe incluir <B>-dNOPLATFONTS</B> en el campo <B>Opciones Ghostscript</B>. 
Si se desea buscar fuentes no incluidas en  Fontmap, 
a&#241;adir -sFONTPATH a este campo.  Por ejemplo 
<PRE>
  -dNOPLATFONTS -sFONTPATH="c:\psfonts"
</PRE>
<P>Si el campo  <B>Ghostscript DLL</B> no contiene un valor correcto, GSview no 
ser&#225; capaz de cargar Ghostscript. 
Si el campo <B>Camino de b&#250;squeda de Ghostscript</B> no contiene un valor correcto, 
Ghostscript no se iniciar&#225; y se descargar&#225; de memoria. 
<P>Seleccionando <B>Copiar los valores predeterminados para la impresora</B> se actualizar&#225; 
gsview32.ini desde el fichero printer.ini. 
<P>Seleccionando <B>Asociar los archivos  .ps a GSview</B> se actualizar&#225; el registro 
para asociar los ficheros PostScript a GSview. 
<P>Seleccionando <B>Asociar los archivos .pdf a GSview</B> se actualizar&#225; el registro 
para asociar los ficheros Portable Document Format a GSview. 
<P>Seleccionando <B>Crear las entradas en el men&#250; Inicio</B> se a&#241;adir&#225; GSview al men&#250; Inicio. 
<P>No es posible utilizar la opci&#243;n deshacer para las acciones de las cuatro opciones previas. 
Las acciones de Asociar y Men&#250; inicio son habitualmente llevadas a cabo 
(con la posibilidad de deshacer) por el programa de instalaci&#243;n de GSview. 
<P>Vea el tema <A HREF="#Instalación">Instalaci&#243;n</A>. 
<P>
<P>
<HR>
<H2><A NAME="Sonidos">Sonidos</A></H2>
La opci&#243;n <B>Sonidos</B> asigna sonidos a distintos sucesos. 
Para cada suceso el sonido puede fijarse como <B>Ninguno</B>, <B>Bip</B> o 
fichero <B>.wav</B>. 
<P>Se debe tener cargado un controlador de sonido antes de utilizar los ficheros .wav. 
Los ficheros .wav de sonido no est&#225;n disponibles para el sistema  MS-Windows 3.0. 
<P>Los sucesos son: 
<P><B>P&#225;gina de salida</B>: se ha ejecutado el operador de PostScript para mostrar la p&#225;gina. 
<P><B>No hay p&#225;gina</B>: se ha seleccionado una p&#225;gina no v&#225;lida. 
Por ejemplo, al pulsar <A HREF="#Seleccionar_página">P&#225;gina anterior</A> estando en la primera p&#225;gina de un documento 
con comentarios <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A>. 
<P><B>No hay numeraci&#243;n</B>: un comando ha necesitado una p&#225;gina numerada y el documento no la ten&#237;a. 
Por ejemplo, al pulsar <A HREF="#Seleccionar_página">Ir a la p&#225;gina</A> cuando se est&#225; viendo un documento 
sin comentarios <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A>. 
<P><B>No hay ning&#250;n archivo</B>:  un comando ha necesitado que un documento estuviera abierto pero &#233;ste 
no es el caso. Por ejemplo, al pulsar <A HREF="#Seleccionar_página">Ir a la p&#225;gina</A> cuando no hay ning&#250;n documento abierto. 
<P><B>Error</B>: muchos tipos de errores. 
<P><B>Iniciar GSview</B>: GSview iniciado. 
<P><B>Salir de GSview</B>: GSview finalizado. 
<P><B>Ocupado</B>: ocupado en este momento, y no se puede realizar la tarea solicitada. 
<P>Los valores por defecto para <B>No hay p&#225;gina</B>, <B>Error</B> y <B>Ocupado</B> son 
<B>Bip</B> y todos los otros sucesos tienen como valor por defecto <B>Ninguno</B>. 
<P>
<P>
<HR>
<H2><A NAME="Unidades">Unidades</A></H2>
La opci&#243;n <B>Unidades</B> fija las unidades utilizadas para ver la posici&#243;n del cursor 
en la barra de estado. Las unidades disponibles son puntos PostScript (<B>pt</B> = 1/72"), 
mil&#237;metros (<B>mm</B>) y pulgadas (<B>in</B>). El valor por defecto es <B>pt</B>. 
<P>La resoluci&#243;n de las unidades puede ser incrementada seleccionado 
<B>Unidades </B>| <B>Resoluci&#243;n fina</B>. 
<P>Vea tambi&#233;n <A HREF="#Medir">Medir</A>. 
<P>
<P>
<HR>
<H2><A NAME="Idioma">Idioma</A></H2>
GSview est&#225; disponible en Ingl&#233;s, Franc&#233;s, Alem&#225;n, Italiano y Espa&#241;ol. 
Para cambiar el idioma utilice <A HREF="#Opciones">Opciones</A> | <B>Idioma</B>. 
<P>
<P>
<HR>
<H2><A NAME="Extraer_con_PStoText">Extraer con PStoText</A></H2>
GSview tiene dos m&#233;todos para buscar y extraer texto. 
<P>El m&#233;todo <A HREF="#Extraer_texto_y_buscar_rápidamente">Extraer texto y buscar r&#225;pidamente</A> efect&#250;a simplemente una extracci&#243;n de 
cadenas PostScript. 
Esta opci&#243;n se selecciona en el men&#250;  <B>Extraer con PStoText</B> | <B>Desactivado</B>. 
<P>El m&#233;todo <A HREF="#Extraer_texto_y_buscar_con_PStoText">Extraer texto y buscar con PStoText</A> utiliza una herramienta externa y 
Ghostscript para extraer palabras y sus coordenadas. 
Este m&#233;todo es mas eficiente, pero puede haber una pausa larga mientras 
la herramienta externa y Ghostscript realizan el proceso inicial. 
Despu&#233;s de esto, la extracci&#243;n de texto y la b&#250;squeda deber&#237;an ser r&#225;pidas. 
Hay dos modos de funcionamiento. <B>Normal </B>debe ser usado con la mayor&#237;a de 
los ficheros PostScript.  <B>P&#225;gina de c&#243;digos Dvips Cork</B> debe ser usado cuando se 
est&#225; utilizando un fichero PostScript  producido por dvips 
que utiliza p&#225;gina de c&#243;digos Cork. 
<P>El valor por defecto es<B> Normal</B>. 
<P>
<P>
<HR>
<H2><A NAME="Mensajes_DSC">Mensajes DSC</A></H2>
Algunos documentos contienen errores en los Convenios de Estructura de Documentos. 
El nivel de advertencia proporcionado por GSview se fija utilizando 
<A HREF="#Opciones">Opciones</A> | <B>Mensajes DSC</B>. 
Si se ha fijado <B>Desactivar</B>, GSview asumir&#225; siempre que los comentarios DSC son correctos. 
<B>Mostrar errores</B> notificar&#225; los errores presentes en los comentarios DSC. 
<B>Mostrar precauciones</B> informar&#225; sobre las advertencias y errores en comentarios DSC. 
<B>Mostrar todos</B> informar&#225; sobre las irregularidades, advertencias y errores en los comentarios 
DSC.  El valor por defecto es  <B>Mostrar precauciones</B>. 
<P>Si se opta por ser informado sobre errores y advertencias, la ventana 
de di&#225;logo permitir&#225; efectuar las siguientes elecciones: 
<P><B>Aceptar</B> le dice a GSview que de su interpretaci&#243;n sobre el significado de 
la advertencia o el error (en lugar del comentario  DSC preciso), 
<B>Cancelar</B> le dice a GSview que trate el comentario DSC como correcto, 
<B>Ignorar DSC</B> le dice a GSview que ignore todos los comentarios DSC. 
<P>Si <B>Mensajes DSC</B> est&#225; en la opci&#243;n <B>Desactivar</B>, GSview tomar&#225; como valor <B>Cancelar</B>. 
Documentos con comentarios DSC incorrectos causar&#225;n probablemente problemas. 
<P>
<P>
<HR>
<H2><A NAME="Guardar_opciones">Guardar opciones</A></H2>
La opci&#243;n  <B>Guardar opciones ahora</B> guarda la posici&#243;n y tama&#241;o de la ventana  GSview, 
la &#250;ltima impresora utilizada, el &#250;ltimo directorio, todos los items en el men&#250; <A HREF="#Opciones">Opciones</A> 
y todos los items en el men&#250;  <A HREF="#Tamaño_de_página">Formatos</A> para la inicializaci&#243;n del fichero. 
gsview32.ini en el directorio del sistema de Windows (o para  Windows 
95 o NT 4  en el directorio de perfil de usuario si estos est&#225;n siendo utilizados). 
GSview lea este fichero en la fase de inicio. 
<P>Cuando la opci&#243;n <B>Guardar opciones al salir</B> ha sido seleccionada, GSview 
guardar&#225; autom&#225;ticamente la configuraci&#243;n actual al terminar el programa. 
<P>
<P>
<HR>
<H2><A NAME="Proteger_los_ficheros">Proteger los ficheros</A></H2>
Cuando la opci&#243;n  <B>Proteger los ficheros</B>  est&#225; seleccionada, GSview pasar&#225; a Ghostscript 
la bandera <B>-dSAFER</B>, que inhabilita las operadores para borrar y renombrar ficheros, y la 
capacidad de abrir ficheros en modo distinto al de s&#243;lo lectura. 
Esta es la opci&#243;n por defecto. 
<P>Cuando la opci&#243;n <B>Proteger los ficheros</B> no est&#225; seleccionada  Ghostscript 
puede cambiar los ficheros. 
<P>
<P>
<HR>
<H2><A NAME="Guardar_el_&#250;ltimo_directorio">Guardar el &#250;ltimo directorio</A></H2>
Cuando la opci&#243;n  <B>Guardar el &#250;ltimo directorio</B> ha sido seleccionada, GSview 
guardar&#225; el directorio activo al finalizar el programa.  Cuando GSview 
se inicie otra vez, este ser&#225; el directorio activo. Esta es la opci&#243;n por defecto. 
<P>Cuando la opci&#243;n <B>Guardar el &#250;ltimo directorio</B>  no est&#225; seleccionada, el directorio 
activo al iniciar GSview ser&#225; el directorio activo del programa que lo invoca. 
<P>
<P>
<HR>
<H2><A NAME="Mostrar_barra_de_botones">Mostrar barra de botones</A></H2>
Cuando la opci&#243;n <B>Mostrar barra de botones</B> est&#225; <B>activada</B>, 
GSview mostrar&#225; una barra de botones dispuestos en columna 
en el lado izquierdo de la ventana. La opci&#243;n est&#225; activada por defecto. 
La barra de botones contiene los siguientes elementos dispuestos en orden descendente: 
<P>
<IMG SRC="gvwopen.gif">
<A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Abrir_un_documento">Abrir</A> 
<P>
<IMG SRC="gvwprint.gif">
<A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Imprimiendo">Imprimir</A> 
<P>
<IMG SRC="gvwinfo.gif">
<A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Información_del_documento">Informaci&#243;n</A> 
<P>
<IMG SRC="gvwhelp.gif">
<B>Ayuda</B> | <B>&#205;ndice</B> 
<P>
<IMG SRC="gvwgoto.gif">
<B>Ver</B> | <A HREF="#Seleccionar_página">Ir a la p&#225;gina</A> 
<P>
<IMG SRC="gvwnext.gif">
<B>Ver</B> | <A HREF="#Seleccionar_página">P&#225;gina siguiente</A> 
<P>
<IMG SRC="gvwprev.gif">
<B>Ver</B> | <A HREF="#Seleccionar_página">P&#225;gina anterior</A> 
<P>
<IMG SRC="gvwnexts.gif">
<B>Avanzar 5 p&#225;ginas</B> 
<P>
<IMG SRC="gvwprevs.gif">
<B>Retroceder 5 p&#225;ginas</B> 
<P>
<IMG SRC="gvwmagp.gif">
<B>Aumentar la resoluci&#243;n un 20%</B> 
<P>
<IMG SRC="gvwmagm.gif">
<B>Disminuir la resoluci&#243;n un 20%</B> 
<P>
<IMG SRC="gvwfind.gif">
<B>Editar</B>| <A HREF="#Extraer_texto_y_buscar">Buscar</A> 
<P>
<IMG SRC="gvwfindn.gif">
<B>Editar</B>| <A HREF="#Extraer_texto_y_buscar">Buscar siguiente</A> 
<P>Para usar los botones de Aumentar/Disminuir la resoluci&#243;n, la opci&#243;n de <A HREF="#Actualización_automática">Actualizaci&#243;n autom&#225;tica</A> 
debe estar activada. La opci&#243;n <B>Formatos </B>| <A HREF="#Parámetros_de_pantalla">Par&#225;metros de pantalla</A> 
puede utilizarse en vez de estos botones. 
Cuando la opci&#243;n <B>Mostrar barra de botones</B> no est&#225; <B>activada</B>, GSview 
no mostrar&#225; la barra de botones. 
<P>
<P>
<HR>
<H2><A NAME="Ajustar_a_la_ventana_a_la_p&#225;gina">Ajustar a la ventana a la p&#225;gina</A></H2>
Cuando la opci&#243;n<B> Ajustar a la ventana</B> est&#225; <B>activada</B>, los cambios realizados en el 
tama&#241;o o la orientaci&#243;n de la p&#225;gina producir&#225;n la modificaci&#243;n del 
tama&#241;o de la ventana, para que &#233;sta se ajuste a la p&#225;gina. 
Si se cambia el tama&#241;o de la ventana, GSview 
har&#225; que esta no sea m&#225;s grande que la p&#225;gina que est&#233; siendo visionada. 
<P>El cambio de las dimensiones de la ventana s&#243;lo ocurrir&#225; al redimensionar la misma o al cambiar 
el tama&#241;o de la p&#225;gina. Estos cambios no ocurren inmediatamente despu&#233;s 
de cambiar la opci&#243;n. 
El ajuste de la ventana a la p&#225;gina es ignorado cuando la 
ventana est&#225; maximizada. 
<P>Si la opci&#243;n<B> Ajustar a la ventana</B> no est&#225; <B>activada</B>, GSview 
no cambiar&#225; las dimensiones de  la ventana y las regiones de fuera de 
la p&#225;gina aparecer&#225;n coloreadas en gris. 
Esto resulta &#250;til si no desea que la ventana se desplace cuando 
visionemos p&#225;ginas de menor resoluci&#243;n. La opci&#243;n no est&#225; activada 
por defecto. 
<P>Vea tambi&#233;n <B>Ver</B> | <A HREF="#Seleccionar_página">Ajustar a la ventana</A>. 
<P>
<P>
<HR>
<H2><A NAME="Apertura_r&#225;pida">Apertura r&#225;pida</A></H2>
Cuando la opci&#243;n <B>Apertura r&#225;pida</B> est&#225; <B>activada</B>, GSview no reinicializar&#225; el programa 
Ghostscript si se cambia la orientaci&#243;n, la resoluci&#243;n o 
el tama&#241;o de la p&#225;gina. 
<P>GSview intentar&#225; mantener a Ghostscript en una situaci&#243;n estable, pero 
algunos documentos pueden hacer que su comportamiento no sea estable e 
incluso pueden hacer que Ghostscript produzca errores. 
Cuando esto ocurre, la ejecuci&#243;n del programa Ghostscript se ver&#225; interrumpida. 
Para ver la ventana con los mensajes de error de Ghostscript 
deber&#225; seleccionar la opci&#243;n <B>Archivo </B>| <A HREF="#Mostrar_mensajes">Mostrar mensajes</A> desde el men&#250;. 
Para volver a abrir el documento deber&#225; seleccionar <B>Ver</B> | <A HREF="#Seleccionar_página">Actualizar</A>. 
<P>Si la opci&#243;n <B>Apertura r&#225;pida</B> no est&#225; <B>activada</B>, GSview 
lanzar&#225; el programa Ghostscript antes de cambiar a un 
nuevo documento o cuando se cambie el tama&#241;o, la 
orientaci&#243;n o la resoluci&#243;n de la p&#225;gina. 
<P>
<P>
<HR>
<H2><A NAME="Actualizaci&#243;n_autom&#225;tica">Actualizaci&#243;n autom&#225;tica</A></H2>
Cuando la opci&#243;n <B>Actualizaci&#243;n autom&#225;tica</B> est&#225; <B>activada</B>, GSview 
actualiza los documentos <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A> cuando se cambian los par&#225;metros de  <A HREF="#Orientación_de_página">Orientaci&#243;n</A>, <A HREF="#Parámetros_de_pantalla">Resoluci&#243;n</A>, 
<A HREF="#Parámetros_de_pantalla">Intensidad</A> o <A HREF="#Tamaño_de_página">Formatos</A>. La opci&#243;n est&#225; activada por defecto. 
<P>Para documentos que no son de tipo <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A>, si la opci&#243;n 
<B>Actualizaci&#243;n autom&#225;tica</B> est&#225; <B>activada</B>, 
GSview <B>reiniciar&#225; en la primera p&#225;gina</B> . 
<P>Si la opci&#243;n <B>Actualizaci&#243;n autom&#225;tica</B> no est&#225; <B>activada</B>, 
para actualizar un documento despu&#233;s de hacer cambios en 
la <A HREF="#Orientación_de_página">Orientaci&#243;n</A>, <A HREF="#Parámetros_de_pantalla">Resoluci&#243;n</A>, <A HREF="#Parámetros_de_pantalla">Intensidad</A> o <A HREF="#Tamaño_de_página">Formatos</A>, 
ser&#225; necesario utilizar la orden <B>Ver</B> | <A HREF="#Seleccionar_página">Actualizar</A> del men&#250;. 
<P>
<P>
<HR>
<H2><A NAME="Recortar_EPS">Recortar EPS</A></H2>
Si la opci&#243;n <B>Recortar EPS</B> est&#225; <B>activada</B>, GSview recortar&#225; 
el gr&#225;fico a mostrar al tama&#241;o del <A HREF="#PS_a_EPS">BoundingBox</A> 
de los ficheros EPS en lugar de utilizar las dimensiones 
de las p&#225;ginas especificados en en las opciones <A HREF="#Tamaño_de_página">Formatos</A> 
del men&#250;. Est&#225; opci&#243;n resulta &#250;til cuando se a&#241;ade un 
gr&#225;fico <B>bitmap</B> a un fichero EPS. 
Al abrir un fichero PDF, la opci&#243;n <B>Recortar EPS</B> 
hace que GSview recorte el gr&#225;fico a mostrar al tama&#241;o del recuadro PDF 
(<B>PDF crop box</B>). 
<P>Si la opci&#243;n <B>Recortar EPS</B> no est&#225; <B>activada</B>, GSview 
utilizar&#225; para los ficheros EPS las dimensiones de la p&#225;gina especificadas 
en la opci&#243;n activa del men&#250; <A HREF="#Tamaño_de_página">Formatos</A>. 
<B>Recortar EPS</B> no est&#225; activada por defecto. 
<P><B>Recortar EPS</B> no altera el documento original, 
s&#243;lo afecta al visionado de los documentos con GSview. 
No afecta a la impresi&#243;n de los mismos. 
<P>Vea tambi&#233;n <B>Editar</B>| <A HREF="#Vista_preliminar_en_EPS">A&#241;adir vista preliminar a EPS</A> 
<P>
<P>
<HR>
<H2><A NAME="Avisos_EPS">Avisos EPS</A></H2>
Cuando la opci&#243;n <B>Avisos EPS</B> est&#225; <B>activada</B>, GSview 
escribe un pr&#243;logo para Ghostscript 
al abrir cada archivo.  Este pr&#243;logo producir&#225; mensajes 
en la ventana <B>Archivo </B>| <A HREF="#Mostrar_mensajes">Mostrar mensajes</A> si se 
utilizan algunas funciones PostScript que no deber&#237;an ser 
utilizadas en un fichero <A HREF="#Convención_para_la_Estructuración_de_Documentos">EPS</A>. 
Por ejemplo, un aviso EPS ser&#237;a: 
<PRE>
 Warning: EPS files must not use /initgraphics
</PRE>
<P>Los<B>Avisos EPS</B> no son infalibles. 
Puede suceder que se utilicen funciones restringidas 
sin que se produzca ning&#250;n aviso por parte de 
<B>Avisos EPS</B>. NO utilice la funci&#243;n <A HREF="#PS_a_EPS">PS a EPS</A> si se 
ha producido un aviso. 
<P>La opci&#243;n <B>Avisos EPS</B> est&#225; <B>desactivada</B> por defecto. 
<P>Vea tambi&#233;n <A HREF="#PS_a_EPS">PS a EPS</A>. 
<P>
<P>
<HR>
<H2><A NAME="Ignorar_los_comentarios_DSC">Ignorar los comentarios DSC</A></H2>
Algunos documentos utilizan las DSC de Adobe de forma incorrecta. 
Al abrir estos documentos GSview se queda horriblemente confundido 
e incapaz de mostrar el documento. Si la opci&#243;n <B>Ignorar los comentarios DSC</B> 
est&#225; <B>activada</B>,  GSview  tratar&#225; el documento como si no 
contuviese comentarios DSC y s&#243;lo muestra las p&#225;ginas en el orden original. 
<P>La opci&#243;n <B>Ignorar los comentarios DSC</B> est&#225; <B>desactivada</B> por defecto. 
<P>
<P>
<HR>
<H2><A NAME="Mostrar_BoundingBox">Mostrar BoundingBox</A></H2>
Si esta opci&#243;n est&#225; activada, GSview dibujar&#225; un rect&#225;ngulo 
con lados discontinuos alrededor de la imagen 
mostrando la posici&#243;n del BoundingBox. Este rect&#225;ngulo s&#243;lo aparecer&#225; 
en la pantalla, no ser&#225; enviado a la impresora si se imprime 
el documento. 
El BoundingBox s&#243;lo ser&#225; mostrado en los documentos <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A> 
(los documentos que no son <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A> no tienen BoundingBox). 
<P>La opci&#243;n <B>Mostrar BoundingBox</B> est&#225; <B>desactivada</B> por defecto. 
<P>
<P>
<HR>
<H1><A NAME="Orientaci&#243;n_de_p&#225;gina">Orientaci&#243;n de p&#225;gina</A></H1>
La orientaci&#243;n de la p&#225;gina usada al mostrar el 
documento en la pantalla se controla desde la opci&#243;n 
<B>Orientaci&#243;n</B> del men&#250;. Las distintas posibilidades son: 
<B>Normal</B>, <B>Apaisada a izquierda</B>, <B>Inversa</B> y <B>Apaisada a derecha</B> 
(Invierte apaisado). 
<B>Apaisada a izquierda</B> significa que el documento aparecer&#225; girado 
90 grados en el sentido contrario al movimiento de la agujas del reloj. 
Estas orientaciones s&#243;lo afectan a la imagen del documento en 
pantalla y no son enviadas a la salida de impresora. 
<P>Si la opci&#243;n <B>Autom&#225;tica</B> del men&#250; <B>Orientaci&#243;n</B> est&#225; activada 
y el documento contiene comentarios <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A> para la orientaci&#243;n 
de la p&#225;gina (%%Orientation o 
%%PageOrientation), la orientaci&#243;n se seleccionar&#225; autom&#225;ticamente. 
<P>Cuando la opci&#243;n <B>Invierte apaisado</B> est&#225; <B>activada</B>, GSview 
invierte el significado de <B>Apaisada a izquierda</B> y 
<B>Apaisada a derecha</B>. La mayor parte de los documentos 
apaisados que he encontrado  deben de ser vistos con un giro de 
90 grados en el sentido contrario al de las agujas del 
reloj. Sin embargo, no existe un est&#225;ndar para los 
documentos apaisados y alguno de ellos debe ser girado en el otro 
sentido. Con el bot&#243;n <B>Invierte apaisado</B> 
podemos hacer que  GSview  gire autom&#225;ticamente el documento 
en el sentido adecuado en respuesta al comentario <B>%%Orientation</B> 
incluido en el archivo PostScript. 
<P>Vea tambi&#233;n <A HREF="#Tamaño_de_página">Tama&#241;o de p&#225;gina</A> y <A HREF="#Parámetros_de_pantalla">Par&#225;metros de pantalla</A>. 
<P>
<P>
<HR>
<H1><A NAME="Par&#225;metros_de_pantalla">Par&#225;metros de pantalla</A></H1>
Algunos par&#225;metros de la pantalla s&#243;lo pueden modificarse 
desde el men&#250;: <A HREF="#Tamaño_de_página">Formatos</A> | <B>Par&#225;metros de pantalla</B>. 
<P>La <B>Resoluci&#243;n</B> define la resoluci&#243;n de pantalla en 
puntos por pulgada. El valor establecido por defecto en 
un monitor VGA es de 96 puntos por pulgada. 
La resoluci&#243;n tambi&#233;n puede modificarse con los botones 
correspondientes de la barra de botones. 
<P>Para documentos DSC, al presionar el bot&#243;n derecho del 
rat&#243;n se realizar&#225; un zoom en pantalla a la resoluci&#243;n 
de la impresora. Al volver a presionar el bot&#243;n derecho 
el zoom retornar&#225; a la resoluci&#243;n utilizada en la pantalla. 
<P>La <B>resoluci&#243;n del zoom</B> establece la resoluci&#243;n para el 
zoom en puntos por pulgada. 
<P>El valor de <B>Intensidad</B> establece la intensidad del 
gr&#225;fico en bits por pixels de pantalla. Por defecto 
GSview selecciona la intensidad m&#225;s alta soportada por 
el monitor. En general, no resulta conveniente 
asignar un valor mayor que el seleccionado porque esto 
s&#243;lo provocar&#225; un mayor consumo de memoria para el 
gr&#225;fico de la p&#225;gina sin mejorar su presentaci&#243;n en 
pantalla. 
<P>El valor de <B>Definici&#243;n de textos</B> establece el anti-aliasing 
para las fuentes y determina el nivel de suavidad de la apariencia de 
los textos.  El valor por defecto 
(use anti-aliasing) es 4 bits. 
Para desactivar el anti-aliasing de las fuentes, utilice 
1 bit. 
<P><B>IMPORTANTE</B>: Al usar <B>Definici&#243;n de textos</B>, GSview 
inhabilita la opci&#243;n <B>Platform Fonts</B> haciendo el equivalente de a&#241;adir 
la opci&#243;n 
<PRE>
  -dNOPLATFONTS
</PRE>
<P>a la l&#237;nea de configuraci&#243;n de Ghostscript en el men&#250; 
<B>Opciones </B>| <A HREF="#Configuración_avanzada">Configuraci&#243;n avanzada</A>. 
<P>El valor de <B>Definici&#243;n de gr&#225;ficos</B> establece el 
anti-aliasing para los gr&#225;ficos y tambi&#233;n para el texto 
que es demasiado grande para utilizar las fuente 
cargadas en memoria. 
<P>El uso de anti-aliasing ralentiza los gr&#225;ficos de las p&#225;ginas. 
La definici&#243;n de textos y gr&#225;ficos s&#243;lo debe utilizarse cuando 
la intensidad en pantalla ha sido definida en 8bits/pixel o m&#225;s. 
<P>
<A HREF="#Zoom">Zoom</A><BR>
<P>
<HR>
<H2><A NAME="Zoom">Zoom</A></H2>
Para aumentar el tama&#241;o de una zona de la pantalla, 
bastar&#225; desplazar la cruz que act&#250;a como puntero del 
rat&#243;n sobre la zona que se desea aumentar y presionar el 
bot&#243;n derecho del rat&#243;n. La ventana cambiar&#225; de la 
resoluci&#243;n normal a la resoluci&#243;n del zoom y en la l&#237;nea 
de estado aparecer&#225; la palabra <B>Aumentado</B> junto al n&#250;mero de 
la p&#225;gina que aparece en pantalla. 
La zona aumentada estar&#225; en el centro de la ventana. 
Para cancelar el <B>Zoom</B> presione el bot&#243;n derecho del rat&#243;n 
una vez m&#225;s, o seleccione cualquier comando que vuelva a dibujar 
la p&#225;gina (e.g. <A HREF="#Seleccionar_página">Actualizar</A>, <A HREF="#Seleccionar_página">P&#225;gina siguiente</A>). 
Por defecto, la resoluci&#243;n del zoom es 300 puntos por 
pulgada, aunque puede cambiarse en el cuadro de di&#225;logo <A HREF="#Tamaño_de_página">Formatos</A> |  <A HREF="#Parámetros_de_pantalla">Par&#225;metros de pantalla</A>. 
<P>El <B>Zoom</B> s&#243;lo funciona en documentos <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A>. 
<P>Para aumentar o reducir el tama&#241;o de la p&#225;gina entera 
se puede modificar el valor de <A HREF="#Parámetros_de_pantalla">Resoluci&#243;n</A> en el cuadro 
de di&#225;logo <A HREF="#Tamaño_de_página">Formatos</A> | <A HREF="#Parámetros_de_pantalla">Par&#225;metros de pantalla</A>, 
o se pueden utilizar los botones <B>Aumentar/Disminuir</B> de 
la barra de botones. 
<P>
<P>
<HR>
<H1><A NAME="Tama&#241;o_de_p&#225;gina">Tama&#241;o de p&#225;gina</A></H1>
El men&#250; <B>Formatos</B> tambi&#233;n permite seleccionar el tama&#241;o de 
p&#225;gina. 
Los tama&#241;os disponibles son: 
<PRE>
 11x17          11   x 17   in
 A3              297 x 420  mm
 A4              210 x 297  mm
 A5              148 x 210  mm
 B4              257 x 364  mm
 B5              182 x 257  mm
 Ledger         17   x 11   in
 Letter          8.5 x 11   in
 Legal           8.5 x 14   in
 Note            8.5 x 11   in
</PRE>
<P>Tambi&#233;n se puede definir cualquier tama&#241;o personalizado por el 
usuario desde la opci&#243;n <B>Personalizado</B>, 
en este caso las dimensiones deben especificarse en puntos PostScript 
(unidades de 1/72 de pulgada). Una p&#225;gina de 480x360 puntos 
con una resoluci&#243;n de 96 ppp dar&#225; una imagen de 640x480 pixels. 
<P>Si el documento contiene comentarios <A HREF="#Convención_para_la_Estructuración_de_Documentos">DSC</A> como los 
siguientes: 
<PRE>
 %%DocumentPaperSizes: a4
 %%DocumentMedia: a4 595 842 80 white ( )
</PRE>
<P>entonces el tama&#241;o de la p&#225;gina se selecciona autom&#225;ticamente. 
Si el tama&#241;o especificado en los comentarios 
no es ninguno de los tipos relacionados m&#225;s arriba, 
la opci&#243;n <B>Personalizado</B> ser&#225; seleccionada. 
<P>Si la opci&#243;n <B>Intercambiar dimensiones</B> esta activada, 
se intercambian las dimensiones de la anchura y 
la altura de la p&#225;gina. La imagen dibujada no 
ser&#225; girada. Este cambio afecta tanto a la imagen en 
pantalla como a la p&#225;gina impresa. 
Al seleccionar <B>A4</B> con la opci&#243;n <B>Intercambiar dimensiones</B> 
el resultado es equivalente a la selecci&#243;n <B>Personalizado</B> 
con las dimensiones 842 x 595 pt. 
Es m&#225;s habitual utilizar las opciones del men&#250; <A HREF="#Orientación_de_página">Orientaci&#243;n</A> 
que la opci&#243;n <B>Intercambiar dimensiones</B>. 
<P>
<P>
<HR>
<H1><A NAME="Teclas_calientes">Teclas calientes</A></H1>
A continuaci&#243;n figuran las teclas calientes activas en GSview. 
<P><B>A</B>, <B>a</B>  Abre y muestra un archivo.  (<A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Abrir_un_documento">Abrir</A>) 
<P><B>C</B>, <B>c</B>  Cierra un archivo.  (<A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Abrir_un_documento">Cerrar</A>) 
<P><B>+</B>  Muestra la p&#225;gina siguiente.  (<B>Ver</B> | <A HREF="#Seleccionar_página">P&#225;gina siguiente</A>) 
<P>Barra espaciadora     Muestra la cabecera de la p&#225;gina siguiente.  (<B>Ver</B> | <B>Cabecera de p&#225;gina siguiente</B>) 
<P><B>-</B>  Muestra las p&#225;gina anterior.  (<B>Ver</B> | <A HREF="#Seleccionar_página">P&#225;gina anterior</A>) 
<P>Retroceso  Muestra la cabecera de la p&#225;gina anterior.  (<B>Ver</B> | <B>Cabecera de la p&#225;gina anterior</B>) 
<P><B>P</B>, <B>p</B>  Va a la p&#225;gina que se especifica.  (<B>Ver</B> | <A HREF="#Seleccionar_página">Ir a la p&#225;gina</A>) 
<P><B>N</B>, <B>n</B>  Muestra informaci&#243;n acerca del archivo.  (<A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Información_del_documento">Informaci&#243;n</A>) 
<P><B>F5</B>  Actualiza la p&#225;gina.  (<B>Ver</B> | <A HREF="#Seleccionar_página">Actualizar</A>) 
<P><B>G</B>, <B>g</B>  Guarda un archivo especificando un nombre. (<A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Abrir_un_documento">Guardar como</A>) 
<P><B>I</B>, <B>i</B>  Imprime todas la p&#225;ginas o algunas de ellas en una impresora.  (<A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Imprimiendo">Imprimir</A>) 
<P><B>E</B>, <B>e</B>  Extrae algunas p&#225;ginas a un archivo.  (<A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Extraer">Extraer</A>) 
<P><B>M</B>, <B>m</B>  Muestra los mensajes de Ghostscript.  (<A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Mostrar_mensajes">Mostrar mensajes</A>) 
<P><B>&lt;</B> Disminuye la resoluci&#243;n en la proporci&#243;n 1/1.2 
<P><B>&gt;</B> Aumenta la resoluci&#243;n en un factor de 1.2 
<P><B>F1</B>  Ayuda.  (<B>Ayuda</B> | <B>Contenido e &#237;ndice</B>) 
<P><B>Ctrl+C</B>, <B>Ctrl+Insert</B> Copia el bitmap mostrado al portapapeles.  (<B>Editar</B> | <A HREF="#Portapapeles">Copiar</A>) 
<P><B>Ctrl+F</B>, Busca un texto. (<B>Editar</B> | <A HREF="#Extraer_texto_y_buscar">Buscar</A>) 
<P><B>F3</B>, Busca el mismo texto de nuevo. (<B>Editar</B> | <A HREF="#Extraer_texto_y_buscar">Buscar siguiente</A>) 
<P><B>F4</B>  La imagen ocupa toda la pantalla, elimin&#225;ndose la barra de botones y men&#250;s.  (<B>Ver</B> | <A HREF="#Seleccionar_página">Pantalla completa</A>) 
<P><B>F6</B>  Cambia la resoluci&#243;n para ajustar toda la p&#225;gina a la ventana.  (<B>Ver</B> | <A HREF="#Seleccionar_página">Ajustar a la ventana</A>) 
<P><B>Flechas</B>  Desplaza la vista de 1/16 d la pantalla. 
<P><B>Ctrl + Flechas</B>  Desplaza la vista de las dimensiones de la ventana. 
<P><B>Re P&#225;g</B>  Desplaza la vista hacia arriba de la altura de la ventana. 
<P><B>Av P&#225;g</B>  Desplaza la vista hacia abajo de la altura de la ventana. 
<P><B>Inicio</B>  Desplaza la vista a la parte superior de la p&#225;gina. 
<P><B>Fin</B>  Desplaza la vista a la parte inferior de la p&#225;gina. 
<P>
<P>
<HR>
<H1><A NAME="Opciones_de_la_l&#237;nea_de_comandos">Opciones de la l&#237;nea de comandos</A></H1>
Utilizaci&#243;n: 
<PRE>
 gsview32 [/D] [/Tn] NombreDeArchivo
 gsview32 [/D] [/Tn] /F NombreDeArchivo
 gsview32 [/D] [/Tn] /P NombreDeArchivo
 gsview32 [/D] [/Tn] /S[puerto] NombreDeArchivo
 gsview32 [/D] [/Tn] /S["cola"] NombreDeArchivo
</PRE>
<P>Para iniciar GSview y mostrar el archivo NombreDeArchivo.ps utilice: 
<PRE>
 gsview32 NombreDeArchivo.ps
</PRE>
<P>Iniciar GSview e imprimir el archivo NombreDeArchivo.ps utilizando Ghostscript. 
Esto es similar a <A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Imprimiendo">Imprimir</A>, excepto que no se le pedir&#225; 
que seleccione una impresora (se utilizar&#225; la &#250;ltima 
impresora usada por GSview) y GSview 
se terminar&#225; despu&#233;s de finalizar la impresi&#243;n. 
<PRE>
 gsview32 /P NombreDeArchivo.ps
</PRE>
<P>Para iniciar GSview e imprimir el archivo NombreDeArchivo.ps a un archivo usando 
Ghostscript (<A HREF="#Abrir_un_documento">Archivo</A> | <A HREF="#Imprimiendo">Imprimir</A>) con <B>Imprimir a un archivo</B> seleccionado utilice: 
<PRE>
 gsview32 /F NombreDeArchivo.ps
</PRE>
<P>Para iniciar GSview e imprimir el archivo NombreDeArchivo.ps directamente a 
una impresora (<A HREF="#Abrir_un_documento">Archivo</A> | <B>Imprimir archivo</B>) utilice: 
<PRE>
 gsview32 /S NombreDeArchivo.ps
</PRE>
<P>Para iniciar GSview e imprimir el archivo NombreDeArchivo.ps directamente al 
puerto LPT3: utilice: 
<PRE>
 gsview32 /SLPT3: NombreDeArchivo.ps
</PRE>
<P>Para iniciar GSview e imprimir el archivo NombreDeArchivo.ps directamente a 
la cola de impresi&#243;n "HP DeskJet Port&#225;til" utilice: 
<PRE>
 gsview32 /S"HP DeskJet Port&#225;til" NombreDeArchivo.ps
</PRE>
<P>Para iniciar GSview en modo de depuraci&#243;n (debug) utilice: 
<PRE>
 gsview32 /D
</PRE>
<P>En el modo de depuraci&#243;n GSview <B>no</B> eliminar&#225; los archivos temporales por &#233;l creados. 
Esto permite inspeccionar dichos archivos despu&#233;s de que GSview haya terminado. 
En el modo de depuraci&#243;n la salida de <B>Archivo </B>| <A HREF="#Mostrar_mensajes">Mostrar mensajes</A> 
es m&#225;s prolija. 
<P>GSview se ejecuta por defecto: 
en modo multi-threaded bajo Windows 95 y Windows NT, y en modo single-threaded bajo 
Windows 3.1 / Win32s. 
Para cambiar esta forma de hacer utilice <B>/T</B> para cambiar de un modo a otro, utilice <B>/T0</B> 
para seleccionar el modo single-thread y <B>/T1</B> para seleccionar el modo multi-thread. 
<P>En lugar de ejecutar una segunda copia de GSview, puede ordenar a 
GSview que abra un archivo en una copia ya abierta, o si GSview 
todav&#237;a no se est&#225; ejecutando, en una nueva ventana utilizando: 
<PRE>
 gsview32 /E NombreDeArchivo
</PRE>
<P>Para salir de una copia que se est&#225; ejecutando: 
<PRE>
 gsview32 /X
</PRE>
<P>GSview ignora las may&#250;sculas en las opciones de la l&#237;nea de comandos: 
/p es lo mismo que /P. 
<P>
<A HREF="#Intercambio_dinámico_de_datos">Intercambio dinámico de datos</A><BR>
<P>
<HR>
<H2><A NAME="Intercambio_din&#225;mico_de_datos">Intercambio din&#225;mico de datos</A></H2>
GSview incluye un servidor de DDE, servicio="GSview" y tema="GSview". 
Los comandos de XTYP_EXECUTE reconocidos son: 
<PRE>
 [FileOpen("NombreDeArchivo")]
 [FileExit()]
 [NextPage()]
 [PrevPage()]
 [GoBack()]
 [GotoPage(5)]
 [ShowWindow(nCmdShow)]
 [Minimise()]
 [Maximise()]
 [Command("l&#237;nea de comando")]
</PRE>
<P>El comando [Command()] s&#243;lo comprende "NombreDeArchivo" o "/P NombreDeArchivo". 
<P>No env&#237;e varios comandos juntos.  GSview no se quejar&#225;, 
pero puesto que la ejecuci&#243;n dentro de GSview se realiza en modo multithreaded as&#237;ncrono 
el primer comando no se habr&#225; completado antes de recibir el segundo comando. 
Si necesita enviar varios comandos env&#237;elos separados por pausas. 
<P>Existen dos opciones de la l&#237;nea de comandos que hacen que GSview env&#237;e 
un comando DDE a otra copia de GSview. 
La opci&#243;n /E utiliza [Command("l&#237;nea de comando")]. 
La opci&#243;n /X utiliza [FileExit()]. 
<P>
<P>
<HR>
<H1><A NAME="World_Wide_Web">World Wide Web</A></H1>
La p&#225;gina principal World Wide Web de Ghostscript, Ghostview y GSview 
est&#225; en: 
<PRE>
 http://www.cs.wisc.edu/~ghost/
</PRE>
<P>Puede registrarse en l&#237;nea en la direcci&#243;n 
<PRE>
 http://www.ghostgum.com.au/
</PRE>
<P>GSview puede ser utilizado como un visor de archivos PostScript para varios navegadores de 
OS/2 y de MS-Windows. Consulte la p&#225;gina principal de GSview para los detalles. 
<P>Thomas Merz ha escrito un manual de Ghostscript que puede obtener en 
formato <A HREF="#Portable_Document_Format">PDF</A> desde el servidor WWW anterior. Este manual es un resumen 
del libro <B>PostScript and Acrobat/PDF</B>, de Thomas Merz, disponible en 
ingl&#233;s y alem&#225;n. 
<P>
<P>
<HR>
<H1><A NAME="Derechos_de_autor">Derechos de autor</A></H1>
El men&#250; <B>Ayuda</B> | <B>Acerca de</B> muestra el mensaje de los derechos de autor de GSview 
y el n&#250;mero de versi&#243;n. 
<P><PRE>
 GSVIEW.EXE - Un interfaz gr&#225;fico para Ghostscript.
 Copyright (C) 1993-2000, Ghostgum Software Pty Ltd.  Reservados todos los derechos
</PRE>
<P>Este archivo es parte de GSview. 
<P>Este programa se distribuye sin NING&#218;N TIPO DE GARANT&#205;A.  Ni los autores ni los distribuidores 
aceptan responsabilidad alguna por las consecuencias que se deriven de su uso, 
o por su adecuaci&#243;n a cualquier prop&#243;sito o uso particular, a menos que as&#237; lo hagan constar por 
escrito.  Rem&#237;tase a la Free Public Licence de GSview 
("Licencia") para conocer todos los detalles. 
<P>Cada copia de GSview debe incluir una copia de la Licencia, normalmente incluida en 
un archivo de texto ASCII llamado LICENCE.  La Licencia garantiza su derecho 
a copiar, modificar y redistribuir GSview, pero s&#243;lo bajo ciertas condiciones 
en ella descritas.  Entre otras cosas, la Licencia exige que la informaci&#243;n sobre derechos de 
autor y esta observaci&#243;n se mantengan en todas las copias. 
<P><PRE>
    Autor: Russell Lang, Ghostgum Software Pty Ltd
  Internet: gsview@ghostgum.com.au
</PRE>
<P>Por favor lea el tema <A HREF="#Problemas_usuales">Problemas usuales</A>, el archivo Readme.htm de GSview y examine 
la p&#225;gina <A HREF="#World_Wide_Web">WWW</A> antes de enviar cualquier correo al autor. 
<P>GSview utiliza pstotext en una DLL externa. pstotext fue escrito por 
Andrew Birrell and Paul McJones, 
<PRE>
  Copyright (C) 1995-1996, Digital Equipment Corporation.
</PRE>
<P>Vea la licencia en  pstotext.txt o pstotext.zip para m&#225;s detalles. 
Si no est&#225; conforme con la licencia de pstotext  elimine pstotext.zip, 
pstotxt2.dll y pstotxt3.dll. 
<P>
<P>
<HR>
<H1><A NAME="Problemas_usuales">Problemas usuales</A></H1>
<B>Problema:</B> No se puede cargar la librer&#237;a Ghostscript DLL ... 
<P>GSview necesita la librer&#237;a Ghostscript DLL 
(gsdll2.dll para OS/2, gsdll32.dll para Win32). 
Este mensaje de error aparece usualmente cuando no se ha instalado 
Ghostscript o cuando GSview no encuentra Ghostscript. 
<P>Desde el men&#250; de GSview, seleccione <A HREF="#Opciones">Opciones</A> | <A HREF="#Configuración_avanzada">Configuraci&#243;n avanzada</A> 
e introduzca el camino correcto para la librer&#237;a <A HREF="#Configuración_avanzada">Ghostscript DLL</A>. Por ejemplo: 
<PRE>
 c:\gs\gsN.NN\bin\gsdll32.dll
</PRE>
<P>Este mensaje tambi&#233;n aparece si Ghostscript no puede localizar sus 
archivos de inicializaci&#243;n (por ejemplo, gs_init.ps). Introduzca 
correctamente el <B>Camino de b&#250;squeda de Ghostscript</B>. 
<P>Si est&#225; utilizando Win32s, aseg&#250;rese de que ninguna otra copia de GSview 
est&#233; usando ya la librer&#237;a Ghostscript. SOLO una copia de la librer&#237;a 
Ghostscript DLL puede ser utilizada por Win32s. 
<P>Si no puede configurar GSview para que ejecute correctamente la librer&#237;a 
Ghostscript DLL, aseg&#250;rese de que puede configurar y ejecutar Ghostscript 
de forma independiente. 
<P><B>Problema:</B> Aparece el mensaje de Ghostscript 
<B>Can't find initialization file gs_init.ps</B>. 
<P>Revise el <B>Camino de b&#250;squeda de Ghostscript</B> e introduzca el directorio 
donde se encuentre el archivo gs_init.ps. 
<P><B>Problema:</B> Aparece el mensaje de Ghostscript 
<B>gs: Interpreter revision (XXX) does not match gs_init.ps revision (YYY)</B>. 
<P>Revise el <B>Camino de b&#250;squeda de Ghostscript</B> e introduzca el directorio 
donde se encuentre el archivo gs_init.ps. 
No intente ver un archivo PostScript en el directorio de una versi&#243;n antigua 
de Ghostscript (ya que entonces se leer&#225; una versi&#243;n antigua del archivo 
gs_init.ps, independientemente de lo indicado en el 
<B>Camino de b&#250;squeda de Ghostscript</B>). 
<P><B>Problema:</B> Aparece el mensaje de Ghostscript 
<B>Wrong version of DLL found.  Found version XXX  Need version YYY</B>. 
<P>GSview ha encontrado una versi&#243;n inadecuada de la librer&#237;a Ghostscript 
DLL. Instale la versi&#243;n requerida de dicha librer&#237;a y aseg&#250;rese de que 
s&#243;lo existe en su sistema una copia de dicha librer&#237;a. 
<P><B>Problema:</B> GSview informa que un archivo PostScript multi-p&#225;gina 
producido por MS-Windows contiene 0 p&#225;ginas y que s&#243;lo se mostrar&#225; la 
primera p&#225;gina. 
<P>Esto se debe a que los comentarios DSC del documento no son correctos. 
<P>El comentario <B>%%Pages: 0</B> significa que el documento no contiene 
p&#225;ginas. Es decir, el operador de PostScript <B>showpage</B> no se usa en el 
archivo. Si encuentra alg&#250;n archivo PostScript que tiene p&#225;ginas 
m&#250;ltiples y contiene el comentario <B>%%Pages: 0</B>, cambie la primera l&#237;nea 
y sustituya <B>%!PS-Adobe-</B> por <B>%!</B>. GSView ignorar&#225; los comentarios DSC y 
le permitir&#225; ver todas las p&#225;ginas, aunque en el orden original. Ser&#237;a 
conveniente que informase al autor del archivo PostScript de las 
dificultades encontradas con dicho archivo. 
<P>Algunos controladores de impresoras PostScript incluyen c&#243;digo PostScript 
espec&#237;fico de una determinada impresora. En consecuencia, la salida 
PostScript obtenida con estos controladores puede ser inservible en otras 
impresoras y puede que GSview sea incapaz de ver dicho archivo. Si se 
encuentra con este tipo de problemas, intente cambiar a un controlador 
gen&#233;rico de PostScript, como <B>Apple LaserWriter II NT</B> para las 
impresoras PostScript de nivel 2, o <B>Apple LaserWriter Plus</B> para las de 
nivel 1. 
<P>En Windows 95, edite las propiedades de la impresora y seleccione la 
opci&#243;n PostScript PostScript Output Format = 
<B>PostScript (optimize for portability - ADSC)</B>. 
<P><B>Problema:</B> GSview informa "La ordenaci&#243;n de las p&#225;ginas es especial" 
<P>El documento utiliz&#243; el comentario DSC <B>%%PageOrder: Special</B> lo que 
significa que las p&#225;ginas no pueden ser reordenadas correctamente. Esto 
impide que GSview pueda visualizar las p&#225;ginas en un orden distinto del 
original. Si decide continuar y reordenar las p&#225;ginas pueden sucederse 
errores PostScript que dejen inservible el archivo. La &#250;nica forma de 
solucionar este problema es volver a generar el archivo sin la ordenaci&#243;n 
especial de las p&#225;ginas. 
<P>Por defecto, Windows 95 crea archivos PostScript que utilizan una 
ordenaci&#243;n especial de las p&#225;ginas. Para desactivar esta opci&#243;n, edite 
las propiedades de la impresora, seleccione la opci&#243;n PostScript y asigne 
PostScript Output Format = <B>PostScript (optimize for portability - ADSC)</B>. 
<P><B>Problema:</B> Los archivos PostScript creados por MS-Windows comienzan con 
Control-D. 
<P>En Windows 3.1: 
<P>Este error puede aparecer incluso con la opci&#243;n <B>Conform to Document Structuring 
Convention</B> seleccionada, por lo que debe considerarse un fallo del 
controlador de impresora. Este fallo est&#225; documentado en el archivo 
PRINTERS.WRI. Edite el archivo win.ini y localice la secci&#243;n relativa a 
la impresora PostScript (puede haber m&#225;s de una). En cada una de las 
secciones a&#241;ada <B>CTRLD=0</B> como se indica a continuaci&#243;n. 
<P><PRE>
 [Apple LaserWriter II NT,FILE]
 CTRLD=0
</PRE>
<P>En Windows 95: 
<P>El controlador de la impresora PostScript dispone de una opci&#243;n 
(Impresoras, Propiedades, Configuraci&#243;n predeterminada del documento..., 
Avanzadas) para suprimir Control+D antes de cada trabajo. 
Afortunadamente, el valor por defecto es NO. 
<P><B>Problema:</B> Los archivos PostScript creados por MS-Word 6.0 originan el 
mensaje "Missing %%Pages comment". 
<P>Felicidades. Acaba de encontrar un error en los comentarios DSC que Word 
genera al incluir un archivo EPS. Word deber&#237;a incluir el archivo EPS 
entre las l&#237;neas 
<PRE>
 %%BeginDocument: NombreArchivo.eps
 %%EndDocument
</PRE>
<P>Como Word no hace esto, GSview no puede conocer el n&#250;mero de p&#225;ginas del 
documento ni su localizaci&#243;n en el archivo PostScript. 
<P>Por favor, informe de este fallo a Microsoft. Existe un problema en el 
filtro EPSIMP.FLT (versi&#243;n 2.01) que Microsoft debe resolver. 
<P>Mientras tanto, existen dos soluciones al problema: 
<P>1. Seleccione <A HREF="#Opciones">Opciones</A> | <A HREF="#Ignorar_los_comentarios_DSC">Ignorar los comentarios DSC</A> 
<P>2. Edite el archivo PostScript y corrija los comentarios DSC. Busque 
todas las l&#237;neas del archivo que contengan 
<PRE>
 %MSEPS Preamble
</PRE>
<P>Para cada una de estas l&#237;neas, localice el siguiente archivo EPS 
incluido, que debe comenzar con la l&#237;nea 
<PRE>
 %!PS-Adobe-3.0 EPSF-3.0
</PRE>
<P>Encima de dicha l&#237;nea incluya la siguiente: 
<PRE>
 %%BeginDocument: AddedByHand
</PRE>
<P>A continuaci&#243;n, busque todas las l&#237;neas conteniendo 
<PRE>
 %MSEPS Trailer
</PRE>
<P>y encima de las mismas a&#241;ada la l&#237;nea 
<PRE>
 %%EndDocument
</PRE>
<P>GSview debe ser capaz de visualizar los archivos as&#237; modificados. 
<P><B>Problema:</B> GSview no reconoce los comentarios DSC en archivos creados 
con el controlador Adobe PostScript 4.10 para Windows. 
<P>No utilice el protocolo de comunicaci&#243;n binario <B>Tagged</B>. C&#225;mbielo 
editando las propiedades de la impresora. 
<P><B>Problema:</B> Al intentar abrir cualquier archivo se produce el error 
<PRE>
 <B>Unrecoverable error: configurationerror in setpagedevice</B>
 Failed to open device or install ViewerPreProcess hook: returns -26
 Page size may have been too large or resolution too high.
 Resetting page size and resolution
</PRE>
<P>Puede suceder que, efectivamente, haya ocurrido al menos uno de los tres 
problemas, en cuyo caso debe reducir el tama&#241;o de p&#225;gina, la resoluci&#243;n 
y/o la intensidad. 
Alternativamente, es posible que se haya seleccionado la opci&#243;n 
<B>-dFIXEDMEDIA</B> en la variable de entorno GS_OPTIONS utilizada por 
Ghostscript. Cuando utilizamos GSview es conveniente no utilizar dicha 
variable de entorno, y configurar Ghostscript utilizando <A HREF="#Opciones">Opciones</A> | 
<A HREF="#Configuración_avanzada">Configuraci&#243;n avanzada</A> | <B>Opciones de Ghostscript</B>. 
<P>
<P>
<HR>
<H1><A NAME="Otros_programas_&#250;tiles">Otros programas &#250;tiles</A></H1>
<B>RedMon</B> es un programa para Windows 95 y NT que permite redirigir un 
puerto de impresora a un programa. 
RedMon puede utilizarse con Ghostscript y una impresora que no sea 
PostScript para simular una impresora PostScript. Esta impresora 
PostScript emulada puede compartirse con otros usuarios de la red, a los 
cuales se les presentar&#225; como una verdadera impresora PostScript. Para 
m&#225;s detalles, con&#233;ctese a: 
<PRE>
 http://www.cs.wisc.edu/~ghost/redmon/
</PRE>
<P>RedMon incluye una utilidad para imprimir un archivo en una cola de 
impresi&#243;n Windows. 
<P><B>PrintFile</B>, de Peter Lerup, es una aplicaci&#243;n Windows para enviar 
archivos a una impresora. Est&#225; disponible en 
<PRE>
  http://hem1.passagen.se/ptlerup/
</PRE>
<P>Revise la p&#225;gina <A HREF="#World_Wide_Web">WWW</A> de Ghostscript para conocer m&#225;s utilidades. 
<P>
<P>
<HR>
<H1><A NAME="Otros_temas_de_ayuda">Otros temas de ayuda</A></H1>
Estos temas est&#225;n disponibles usualmente al presionar la tecla <B>Ayuda</B> en 
los cuadros de di&#225;logo. 
<P>
<A HREF="#Mostrar_mensajes">Mostrar mensajes</A><BR>
<A HREF="#bzip2">bzip2</A><BR>
<A HREF="#zlib">zlib</A><BR>
<A HREF="#Acerca_de_GSview">Acerca de GSview</A><BR>
<P>
<HR>
<H2><A NAME="Mostrar_mensajes">Mostrar mensajes</A></H2>
GSview utiliza Ghostscript para ver o imprimir archivos PostScript. 
La opci&#243;n <B>Archivo </B>| <B>Mostrar mensajes</B> ense&#241;a la consola de salida de 
Ghostscript y es realmente &#250;til cuando se produce un error PostScript. 
Puede moverse libremente con la barra deslizante de la derecha para ver 
el comienzo del mensaje de error. 
<P>El texto de la ventana <B>GSview para Windows - Mensajes de Ghostscript</B> 
puede ser copiado al Portapapeles. Si no se selecciona ning&#250;n texto, al 
pulsar el bot&#243;n <A HREF="#Portapapeles">Copiar</A> se copiar&#225; todo el texto al Portapapeles. Si 
alguna parte del texto es marcado, solamente dicho texto ser&#225; copiado al 
Portapapeles. 
<P>Algunas explicaciones de los mensajes de error que pueden aparecer en 
esta ventana se encuentran en la secci&#243;n <A HREF="#Problemas_usuales">Problemas usuales</A>. 
<P>
<P>
<HR>
<H2><A NAME="bzip2">bzip2</A></H2>
Si intenta abrir un archivo que ha sido comprimido con bzip2, GSview 
intentar&#225; cargar la librer&#237;a DLL bzip2, descomprimir el archivo en un 
archivo temporal y leer dicho archivo temporal. 
<P>Si aparece el error "No se pudo cargar la librer&#237;a DLL bzip2" 
(<B>Failed to load bzip2 DLL...</B>), entonces 
es probable que dicha librer&#237;a no se encuentre en su sistema. Puede 
conseguirla en el mismo sitio en el que consigui&#243; GSview o en 
<PRE>
 ftp://ftp.cs.wisc.edu/ghost/ghostgum/
</PRE>
<P>Guarde la librer&#237;a DLL bzip2 en el mismo directorio en el que se encuentre 
GSview. En Win32, la librer&#237;a se llama libbz2.dll. En estos momentos no 
existe una versi&#243;n de esta librer&#237;a ni para Win16 ni para OS/2. 
<P>bzip2 is Copyright 1996-2000 by Julian Seward 
El c&#243;digo fuente puede obtenerse 
<PRE>
 http://www.muraroa.demon.co.uk/
</PRE>
<P>
<P>
<HR>
<H2><A NAME="zlib">zlib</A></H2>
Si intenta abrir un archivo que ha sido comprimido con gzip, GSview 
intentar&#225; cargar la librer&#237;a DLL zlib, descomprimir el archivo en un 
archivo temporal y leer dicho archivo temporal. 
<P>Si aparece el error "No se pudo cargar la librer&#237;a DLL zlib" 
(<B>Failed to load zlib DLL...</B>), entonces 
es probable que dicha librer&#237;a no se encuentre en su sistema. Puede 
conseguirla en el mismo sitio en el que consigui&#243; GSview o en 
<PRE>
 ftp://ftp.cs.wisc.edu/ghost/ghostgum/
</PRE>
<P>Guarde la librer&#237;a DLL zlib en el mismo directorio en el que se encuentre 
GSview. En Win16 se llama zlib16.dll, en Win32 se llama zlib32.dll y 
zlib2.dll en OS/2. 
<P>zlib is Copyright 1995-1996 by Jean-loup Gailly and Mark Adler. 
El c&#243;digo fuente puede obtenerse en 
<PRE>
 http://www.cdrom.com/pub/infozip/zlib/
</PRE>
<P>
<P>
<HR>
<H2><A NAME="Acerca_de_GSview">Acerca de GSview</A></H2>
GSview utiliza las librer&#237;as DLL de Aladdin Ghostscript para la 
interpretaci&#243;n de los archivos PostScript. 
<P>Con Win32s, las librer&#237;as s&#243;lo pueden ser utilizadas por una &#250;nica 
aplicaci&#243;n simult&#225;neamente. Por el contrario, en Windows 95, Windows NT y 
OS/2, las librer&#237;as pueden utilizarse por varias aplicaciones al mismo 
tiempo (siempre que disponga de suficiente memoria y recursos en su 
ordenador). As&#237;, con Win32s, GSview debe descargar la librer&#237;a de 
Ghostscript mientras es usada por la aplicaci&#243;n gvwgs.exe durante la 
impresi&#243;n. 
<P>gsv16spl.exe es una aplicaci&#243;n de 16-bits para Windows, utilizada por 
GSview para imprimir archivos cuando est&#225; trabajando en modo Win32s. La 
aplicaci&#243;n no puede ejecutarse independientemente de GSview, y no 
funciona en Windows 95 o Windows NT. 
<P>gvwgs32.exe (Windows) y gvpgs.exe (OS/2) son aplicaciones utilizadas 
durante la impresi&#243;n de los archivos PostScript. Pueden utilizarse desde 
el interfaz de comandos pero, como eliminan los archivos que aparecen en 
la l&#237;nea de comandos, es conveniente utilizar en su lugar gswin32.exe 
(Win32), gswin32c.exe (consola Win32) o gsos2.exe (OS/2). 

<P><HR>Created automatically by doc2html
</BODY>
</HTML>
