<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
<TITLE>Skrivarövervakare för omdirigering av port</TITLE>
</HEAD>
<BODY>
<H1>Skrivarövervakare för omdirigering av port</H1>
<HR>
<H1><A NAME="1">&#214;versikt</A></H1>
Skrivar&#246;vervakaren <B>RedMon</B> dirigerar om en speciell skrivarport 
till valfritt program. 
<B>RedMon</B> anv&#228;nds vanligtvis tillsammans med Ghostscript f&#246;r att ge 
Postscript-funktionalitet till en skrivare som annars saknar s&#229;dan. 
<P><B>RedMon</B> kan anv&#228;ndas ihop med alla program som accepterar indata 
direkt fr&#229;n terminal (standard input). 
<P>Genom att anv&#228;nda <B>RedMon</B> kan du skapa omdirigerade skrivarportar. 
Om du ansluter en Windows-skrivardrivrutin till en s&#229;dan port kommer 
all data som skrivs ut p&#229; den skrivaren att vidarebefodras av <B>RedMon</B> 
till standard input hos det programmet. Det &#228;r sedan det programmets 
ansvar att bearbeta dessa data och generera ny utdata. 
<P>En PostScript-skrivare i Windows omdirigerad till en <B>RedMon</B> port kan 
delas ut i ett n&#228;tverk. 
N&#228;r skrivaren &#228;r konfigurerad att anv&#228;nda Ghostscript och en annan 
icke-PostScript skrivare kommer den att f&#246;r andra n&#228;tverksklienter 
att se ut som en helt vanlig Postscript-skrivare. 
<P><B>RedMon</B> st&#246;der Windows 95, NT 4.0 and 3.51. 
<P>Att konfigurera <B>RedMon</B> &#228;r inte n&#229;got som b&#246;r g&#246;ras av oerfarna 
anv&#228;ndare. 
<P>
<A HREF="#27">Installation</A><BR>
<A HREF="#40">Avinstallation</A><BR>
<A HREF="#46">Lägg till port</A><BR>
<A HREF="#66">Inställningar för port</A><BR>
<A HREF="#196">Inställningar för loggfil</A><BR>
<A HREF="#216">Vad är Ghostscript?</A><BR>
<A HREF="#244">Ghostscriptexempel</A><BR>
<A HREF="#438">Vanliga problem</A><BR>
<A HREF="#466">Copyright</A><BR>
<P>
<HR>
<H1><A NAME="27">Installation</A></H1>
K&#246;r <B>setup.exe</B> f&#246;r att installera den omdirigerande skrivar&#246;vervakaren 
<B>RedMon</B>. 
Filerna <B>setup.exe</B>, <B>redmon95.dll</B>, <B>redmonnt.dll</B>, <B>redmon35.dll</B>, 
<B>redmon.hlp</B> och <B>unredmon.exe</B> 
m&#229;ste alla finnas i samma katalog. 
<P>F&#246;r att installera <B>RedMon</B> under Windows NT kr&#228;vs 
Administrat&#246;rsbeh&#246;righet. 
<P>F&#246;lj instruktionerna i <A HREF="#244">Ghostscriptexempel</A> f&#246;r resten av 
konfigureringen. 
<P>
<P>
<HR>
<H1><A NAME="40">Avinstallation</A></H1>
F&#246;r att avinstallera, m&#229;ste du f&#246;rst frikoppla alla skrivardrivrutiner 
fr&#229;n de <B>Omdirigerade</B> portarna och sedan ta bort de <B>Omdirigerade</B> 
portarna. Anv&#228;nd <B>L&#228;gg till/ta bort program</B> p&#229; <B>Kontrollpanelen</B> f&#246;r 
att ta bort <B>RedMon</B>. 
<P>
<P>
<HR>
<H1><A NAME="46">L&#228;gg till port</A></H1>
I dialogrutan <B>L&#228;gg till omdirigerad port</B>, ange namn och beskrivning 
p&#229; en port som skall hanteras av <B>RedMon</B>. 
Per default, kommer den f&#246;rsta porten du definierar kallas <B>RPT1:</B> 
och dess beskrivning kommer att vara <B>Omdirigerad port</B>. 
<P><B>Windows 95:</B> Efter att ha lagt till en port beh&#246;ver du &#228;ndra 
dess inst&#228;llningar med <B>Portinst&#228;llningar</B> och 
<B>Spooler-inst&#228;ll(ningar)</B>. 
Alla skrivardrivrutiner kopplade till denna port <B>m&#229;ste</B> i 
<B>Inst&#228;llningar f&#246;r utskriftsbuffert</B> ha valet 
<B>Inaktivera tv&#229;v&#228;gsst&#246;d f&#246;r den h&#228;r skrivaren</B> gjort. 
<P><B>Windows NT:</B> Efter att ha lagt till en port beh&#246;ver du &#228;ndra 
dess inst&#228;llningar med <B>Configure Port</B>. <B>Enable bidirectional support</B> 
b&#246;r vara avst&#228;ngt. 
<P>Du kan inte anv&#228;nda ett portnamn som redan finns. 
D&#228;rf&#246;r kan du inte skapa en omdirigerad port som kallas LPT1: 
<P>
<P>
<HR>
<H1><A NAME="66">Inst&#228;llningar f&#246;r port</A></H1>
I dialogrutan <B>Inst&#228;llningar f&#246;r omdirigerad port</B> anger du ett 
program som p&#229; standard input skall erh&#229;lla alla data som 
skickas till denna port. 
Programnamnet anges i det f&#246;rsta textf&#228;ltet och argumenten i 
det andra textf&#228;ltet. 
<P><B>Utdata</B> fr&#229;n programmet kan hanteras p&#229; tre olika s&#228;tt. 
<A HREF="#94">Programmet hanterar utdata</A>, <A HREF="#103">Skicka stdout till skrivare</A> eller 
<A HREF="#111">Kopiera tempor&#228;rfil till skrivare</A>. V&#228;ljer du n&#229;gon av de senare tv&#229; 
alternativen beh&#246;ver du ocks&#229; v&#228;lja en <B>Skrivare</B>. 
<P>Om du v&#228;ljer <A HREF="#111">Skriv ut fel</A> skapas en extra sida med felinformation 
och skickas till skrivaren. 
<P>Programmet kan k&#246;ras i tre l&#228;gen <B>Normal</B>, <B>Minimerad</B> eller <B>Dold</B>. 
<P><A HREF="#162">K&#246;r som Anv&#228;ndare</A> &#228;r tillg&#228;ngligt endast under Window NT och &#228;r 
vanligtvis avst&#228;ngt. 
<P>En <A HREF="#196">Loggfil</A> kan f&#229;s att erh&#229;lla de utdata och eventuella felmeddelanden 
programmet skulle ha l&#228;mnat p&#229; terminalen. 
Med en loggfil har du m&#246;jligt att se felmeddelanden som skrevs ut p&#229; 
terminalen av programmet (stdout och stderr). 
<P>Se <A HREF="#244">Ghostscriptexempel</A> och <A HREF="#438">Vanliga problem</A>. 
<P>
<A HREF="#94">Programmet hanterar utdata</A><BR>
<A HREF="#103">Skicka stdout till skrivare</A><BR>
<A HREF="#111">Kopiera temporärfil till skrivare</A><BR>
<A HREF="#137">Miljövariabler</A><BR>
<A HREF="#162">Kör som Användare</A><BR>
<A HREF="#186">Avsluta efter</A><BR>
<P>
<HR>
<H2><A NAME="94">Programmet hanterar utdata</A></H2>
N&#228;r utdata-alternativet &#228;r<B> Programmet hanterar utdata</B>, &#228;r 
programmet till vilket omdirigering skett totalansvarigt f&#246;r all 
utdata. 
Om programmet vill skriva till en annan skrivare m&#229;ste det sk&#246;ta det helt 
sj&#228;lvt. Om programmet inte vill generera n&#229;gon utdata alls g&#229;r det ocks&#229; 
f&#246;r sig. 
S&#229; h&#228;r betedde sig Redmon 1.1. 
<P>
<P>
<HR>
<H2><A NAME="103">Skicka stdout till skrivare</A></H2>
N&#228;r utdata-alternativet &#228;r<B> Skicka stdout till skrivare</B>, b&#246;r 
programmet till vilket omdirigering skett skriva utdata till standard 
output. RedMon kommer att kopiera denna utdata till angiven skrivare. 
Standard output kommer inte att skrivas till loggfilen. 
<P>Detta alternativ b&#246;r inte anv&#228;ndas med Ghostscript 5.50 eller tidigare. 
<P>
<P>
<HR>
<H2><A NAME="111">Kopiera tempor&#228;rfil till skrivare</A></H2>
N&#228;r utdata-alternativet &#228;r<B> Kopiera tempor&#228;rfil till skrivare</B>, b&#246;r 
programmet till vilket omdirigering skett skriva utdata till en tempor&#228;r 
fil. RedMon kommer att skicka inneh&#229;llet i denna fil till angiven skrivare. 
Namnet p&#229; den tempor&#228;ra filen anges av RedMon, och kan erh&#229;llas genom att 
placera <B>%1</B> i programmets argument. Vill du ange <B>%1</B> i programargumenten 
och unvika att RedMon ers&#228;tter det med namnet p&#229; den tempor&#228;ra filen, m&#229;ste 
du anv&#228;nda <B>%%1</B>. 
<P>Till exempel kan programmets argument inneh&#229;lla: 
<PRE>
 -sOutputFile="%1"
</PRE>
<P>Denna metod rekommenderas f&#246;r anv&#228;ndning med Ghostscript. 
Om <B>Skriv ut fel</B> &#228;r valt och det program till vilket omdirigeringen sker 
skulle avslutas i f&#246;rtid, kommer RedMon att skriva ut en felrapport till 
skrivaren. Denna kommer att inneh&#229;lla det som skrivits till <A HREF="#196">Loggfil</A>en. 
Om man kombinerar valen <B>Skriv ut fel</B> och <B>Avlusning</B> kommer man att 
sl&#246;sa bort en stor m&#228;ngd papper. 
<P><B>Skriv ut fel</B> &#228;r till st&#246;rst nytta om det program till vilket 
omdirigering sker genererar felmeddelanden till terminalen som 
f&#229;ngas upp i loggfilen. 
<P><B>Skriv ut fel</B> ignoreras om man har valt <A HREF="#94">Programmet hanterar utdata</A>. 
<P>
<P>
<HR>
<H2><A NAME="137">Milj&#246;variabler</A></H2>
Programmet till vilket omdirigering sker kan erh&#229;lla information om 
p&#229;g&#229;ende utskriftsjobb fr&#229;n milj&#246;variabler. F&#246;ljande milj&#246;variabler 
s&#228;tts av RedMon: 
<P><B>REDMON_PORT</B> &#228;r portnamnet, vanligtvis "RPT1:". 
<P><B>REDMON_JOB</B> &#228;r jobbnumret, ett heltal. 
<P><B>REDMON_PRINTER</B> &#228;r namnet p&#229; skrivaren (t.ex. "HP DeskJet 500"). 
<P><B>REDMON_MACHINE</B> &#228;r namnet p&#229; maskinen som skapade jobbet 
(t.ex. "\\Desktop"). 
<P><B>REDMON_USER</B> &#228;r namnet p&#229; anv&#228;ndaren som &#228;ger jobbet (t.ex. "JCITIZEN). 
<P><B>REDMON_DOCNAME</B> &#228;r namnet p&#229; utskriftsjobbet (t.ex. "Printer Test Page"). 
<P><B>TEMP</B> och <B>TMP</B> &#228;r kataloger f&#246;r tempor&#228;rfiler. 
<P>Notera att under Windows NT k&#246;rs programmet till vilket omdirigering 
skett i SYSTEM-anv&#228;ndarens milj&#246;. F&#246;rutom de ovan angivna milj&#246;variablerna 
finns mycket f&#229; andra att tillg&#229;. Registrynyckeln HKEY_USER och aktuell 
anv&#228;ndarprofil &#228;r de som tillh&#246;r anv&#228;ndaren "Default User". 
<P>
<P>
<HR>
<H2><A NAME="162">K&#246;r som Anv&#228;ndare</A></H2>
"K&#246;r som Anv&#228;ndare" inneb&#228;r att den anv&#228;ndare som skapade utskriftsjobbet 
kommer att st&#229; som &#228;gare till den process som k&#246;r programmet till vilket 
omdirigering skett. 
<P>"K&#246;r som Anv&#228;ndare" &#228;r endast tillg&#228;ngligt f&#246;r NT4. Anv&#228;nd inte denna 
inst&#228;llning om skrivaren &#228;r utdelad i ett n&#228;tverk. 
Fj&#228;rranslutna anv&#228;ndare kan inte k&#246;ra program p&#229; din dator. 
Om en fj&#228;rransluten anv&#228;ndare f&#246;rs&#246;ket skapa ett jobb, kommer programmet 
att misslyckas med ett meddelande likt: 
<PRE>
 Initialization of dynamic link library
 C:\WINNT4\system32\kernel32.dll failed.
 The process is terminating abnormally.
</PRE>
<P>Tj&#228;nsten f&#246;r hantering av  utskriftsk&#246;n kommer att vara l&#229;st tills du st&#228;nger 
av och startar om den. 
<P><B>K&#246;r som Anv&#228;ndare </B>&#228;r t&#228;nkt f&#246;r att starta ett program med grafiskt 
anv&#228;ndargr&#228;nssnitt, t.ex. GSview, lokalt m.h.a. RedRun. 
<P>Programmet kommer visserligen att ha de r&#228;ttigheter och s&#228;kerhetsinst&#228;llningar 
som g&#228;ller den anv&#228;ndare som skapade utskriftsjobbet, men det kommer att 
ha SYSTEM-anv&#228;ndarens omgivning. Anv&#228;ndarprofilen kommer inte att vara 
den r&#228;tta. 
<P>
<P>
<HR>
<H2><A NAME="186">Avsluta efter</A></H2>
Efter att ha skrivit all data till det program till vilket omdirigering 
skett kommer <B>RedMon</B> vanligtvis att v&#228;nta upp till 300 sekunder p&#229; att 
programmet skall bli klart innan eventuell utdata skickas till skrivaren 
och loggfilen st&#228;ngs. 
Om programmet tar mer &#228;n 300 sekunder p&#229; sig att avsluta kan utdata fr&#229;n 
programmet g&#229; f&#246;rlorade eller kapas av. Viss utdata till terminalen kanske 
inte kommer med i loggfilen. 
Om detta intr&#228;ffar kan du beh&#246;va &#246;ka v&#228;rdet p&#229; <B>Avsluta efter</B>. 
<P>
<P>
<HR>
<H1><A NAME="196">Inst&#228;llningar f&#246;r loggfil</A></H1>
Om du ber <B>RedMon</B> anv&#228;nda en loggfil kommer all utdata p&#229; 
terminalen fr&#229;n det program till vilket omdirigering sker, 
att skrivas till denna fil. Detta &#228;r anv&#228;ndbart f&#246;r att f&#229;nga upp 
felmeddelande fr&#229;n programmet till vilket du har omdirigerat 
standard input. 
<P>F&#246;r att anv&#228;nda en loggfil m&#229;ste du kryssa i <B>Anv&#228;nd loggfil</B> 
och sedan ange ett giltigt filnamn f&#246;r loggfilen. 
<P>Om du markerar <B>Avlusning</B> kommer <B>RedMon</B> att skriva extra 
meddelanden med avlusningsinformation till loggfilen. Dessa 
meddelanden &#228;r f&#246;rmodligen endast anv&#228;ndbara f&#246;r skaparen av 
<B>RedMon</B>. Om du vill att loggfilen endast skall inneh&#229;lla 
utdata fr&#229;n programmet som hanterar omdirigeringen, markera 
INTE <B>Avlusning</B>. 
<P>Se <A HREF="#244">Ghostscriptexempel</A>. 
<P>
<P>
<HR>
<H1><A NAME="216">Vad &#228;r Ghostscript?</A></H1>
Ghostscript &#228;r namnet p&#229; en samling programvara som tillhandah&#229;ller: 
<P>- En tolk for spr&#229;ket PostScript (TM) och Adobes 
Portable Document Format (PDF -- ibland f&#246;rv&#228;xlat med Acrobat, 
Adobes program f&#246;r visning och skapande av PDF filer), och 
<P>- En samling C procedurer (Ghostscript-biblioteket) som implementerar 
de grafik och filtreringsm&#246;jligheter 
(datakompression / dekompression / konversion) som f&#246;rekommer som 
grundl&#228;ggande operationer i spr&#229;ket Postscript och i PDF. 
<P>Ghostscript finns i versioner f&#246;r Microsoft Windows, IBM OS/2, 
DEC VMS och m&#229;nga varianter av Unix fr&#229;n 
<PRE>
  http://www.cs.wisc.edu/~ghost/
</PRE>
<P>Ghostscript &#228;r ett upphovsr&#228;ttsligt skyddat verk &#228;gt av 
Aladdin Enterprises. 
<P>GSview &#228;r en f&#246;rhandsgranskare skriven av Ghostgum Software Pty Ltd, 
baserad p&#229; Ghostscript.  GSview hittar du p&#229; 
<PRE>
  http://www.cs.wisc.edu/~ghost/gsview/
</PRE>
<P>Om du vill anv&#228;nda Ghostscript tillsammans med <B>RedMon</B> b&#246;r du 
installera GSView och Ghostscript genom att anv&#228;nda 
installationsprogrammet <B>setup</B>, som ing&#229;r i GSView. 
<P>
<P>
<HR>
<H1><A NAME="244">Ghostscriptexempel</A></H1>
Windows 95 och Windows NT skiljer sig n&#229;got &#229;t vid konfigurationen. 
<P>
<A HREF="#247">Ghostscriptexempel för Windows 95</A><BR>
<A HREF="#338">Ghostscriptexempel för Windows NT 4.0</A><BR>
<A HREF="#412">Ghostscriptexempel med HP LaserJet skrivare</A><BR>
<P>
<HR>
<H2><A NAME="247">Ghostscriptexempel f&#246;r Windows 95</A></H2>
Du kan anv&#228;nda Ghostscript tillsammans med <B>RedMon</B> f&#246;r att 
skapa en PostScript-skrivare. 
<P>F&#246;r att skriva ut till en HP DeskJet 500 skrivare vars k&#246;namn 
&#228;r "HP DeskJet 500" skapar du f&#246;rst en fil med namnet, 
c:\gstools\djet500.rsp, som inneh&#229;ller f&#246;ljande: 
<PRE>
 -Ic:\gstools\gs5.50;c:\gstools\gs5.50\fonts
 -sDEVICE=djet500
 -dNOPAUSE
 -dSAFER
 -sPAPERSIZE=a4
</PRE>
<P>Se Ghostscriptfilerna <B>Use.htm</B> och <B>Install.htm</B> f&#246;r en 
f&#246;rklaring av de anv&#228;nda inst&#228;llningarna. 
<P>Ta fram skrivarinst&#228;llningarna f&#246;r en befintlig skrivare, 
v&#228;lj fliken <B>Information</B>, och tryck sedan p&#229; knappen<B> L&#228;gg till port</B>. 
V&#228;lj <B>Annan</B>, <B>Omdirigerad port</B> och sedan <B>OK</B>. 
<P> 

<IMG SRC="addport1.gif">
<P><B>RedMon</B>s <A HREF="#46">L&#228;gg till port</A> dialog visas nu. Acceptera defaultv&#228;rdena. 
<P>
<IMG SRC="addport2.gif">
<P>Skapa, genom att anv&#228;nda guiden <B>L&#228;gg till skrivare</B>, en ny skrivare 
av Postscript-typ. 
En passande skrivartyp &#228;r <B>Apple LaserWriter II NT</B>. 
<P>Ta fram skrivarinst&#228;llningarna f&#246;r den nya PostScript-skrivaren, 
V&#228;lj fliken <B>Information</B> och &#228;ndra sedan f&#228;ltet 
<B>Skriv till f&#246;ljande port</B> till den <B>RedMon</B> port du skapade, 
f&#246;rmodligen fick den namnet RPT1: 
<P>
<IMG SRC="property.gif">
<P>V&#228;lj knappen <B>Portinst&#228;llningar</B>. 
Dialogrutan <B>RPT1: Inst&#228;llningar</B> visas nu. 
<P>Ange programnamnet 
<PRE>
 c:\gstools\gs5.50\gswin32c.exe
</PRE>
<P>och argumenten 
<PRE>
 @c:\gstools\djet500.rsp -sOutputFile="%1" -
</PRE>
<P>Se noga till att du f&#229;r med blanktecknet och <B>bindestrecket</B> p&#229; 
slutet av raden. 
Gl&#246;mmer du detta kan Ghostscript h&#228;nga skrivark&#246;n. 
S&#228;tt Utdata till <A HREF="#111">Kopiera tempor&#228;rfil till skrivare</A> och v&#228;lj skrivare 
<B>HP DeskJet 500</B>. 
<P>
<IMG SRC="portset1.gif">
<P>Om du vill se vad som skrivs till terminalen (dvs. du vill se 
felmeddelanden), se <B>Loggfilsinst&#228;llningar</B>. 
<P>
<IMG SRC="portset2.gif">
<P>Tryck p&#229; OK-knapparna f&#246;r dialogrutorna <B>Loggfilsinst&#228;llningar</B> och 
<B>RPT1: Inst&#228;llningar</B>. 
<P>Bland skrivarinst&#228;llningarna f&#246;r denna PostScript-skrivare, 
v&#228;lj fliken <B>Information</B>, tryck sedan p&#229; knappen 
<B>Spooler-inst&#228;ll(ningar)</B>. 
&#196;ndra <B>Dataformat f&#246;r &#246;verf&#246;ring till buffert</B> till <B>RAW</B>. 
V&#228;lj <B>Inaktivera tv&#229;v&#228;gsst&#246;d f&#246;r den h&#228;r skrivaren</B>. 
Denna sista &#228;ndring &#228;r mycket viktig. 
<P>
<IMG SRC="spoolset.gif">
<P>Bland skrivarinst&#228;llningarna f&#246;r denna PostScript-skrivare, 
v&#228;lj fliken <B>PostScript</B>.  Se till att <B>PostScript-header</B> 
&#228;r <B>&#214;verf&#246;r headern f&#246;r varje utskriftsjobb</B>. 
V&#228;lj knappen <B>Avancerat</B> f&#246;r att visa 
<B>Avancerade PostScript-alternativ</B>. 
<B>Dataformat</B> skall vara <B>ASCII-data</B>. 
Avaktivera b&#229;de <B>Skicka CTRL+D f&#246;re jobb</B> och 
<B>Skicka CTRL+D efter jobb</B>. 
<P>Genom att skriva ut p&#229; skrivaren <B>Apple LaserWriter II NT</B> kommer 
nu Ghostscript att anv&#228;ndas. 
Om du delar ut denna skrivare till klienter i ett n&#228;tverk kommer 
den att se ut som en Postscript-skrivare f&#246;r dem. 
<P>F&#246;r en lista med tillg&#228;ngliga skrivartyper i Ghostscript g&#229; till 
Ghostscriptkatalogen c:\gstools\gs5.50 och k&#246;r 
<PRE>
 gswin32c -h
</PRE>
<P>Om din skrivare inte finns i listan titta p&#229; sidan 
<PRE>
 http://www.cs.wisc.edu/~ghost/printer.html
</PRE>
<P>och se efter om n&#229;gon av de befintliga skrivartyperna i Ghostscript 
fungerar ihop med din skrivare. 
<P>
<P>
<HR>
<H2><A NAME="338">Ghostscriptexempel f&#246;r Windows NT 4.0</A></H2>
Du kan anv&#228;nda Ghostscript tillsammans med <B>RedMon</B> f&#246;r att 
skapa en PostScript-skrivare. 
<P>F&#246;r att skriva ut till en HP DeskJet 500 skrivare vars k&#246;namn 
&#228;r "HP DeskJet 500" skapar du f&#246;rst en fil med namnet, 
c:\gstools\djet500.rsp, som inneh&#229;ller f&#246;ljande: 
<PRE>
 -Ic:\gstools\gs5.50;c:\gstools\gs5.50\fonts
 -sDEVICE=djet500
 -dNOPAUSE
 -dSAFER
 -sPAPERSIZE=a4
</PRE>
<P>Se Ghostscriptfilerna <B>Use.htm</B> och <B>Install.htm</B> f&#246;r en 
f&#246;rklaring av de anv&#228;nda inst&#228;llningarna. 
<P>Starta guiden <B>L&#228;gg till skrivare</B>. 
P&#229; den andra sidan v&#228;lj <A HREF="#46">L&#228;gg till port</A>. 
<P>
<IMG SRC="ntaddp1.gif">
<P>V&#228;lj <B>Omdirigerad port</B> sedan <B>Ny port</B>. 
RedMons dialogruta <A HREF="#46">L&#228;gg till port</A> visas nu. 
Acceptera defaultv&#228;rdena. 
<P>
<IMG SRC="addport2.gif">
<P>Tryck <B>St&#228;ng</B> sedan <B>Portinst&#228;llningar</B>. 
Dialogrutan <B>RPT1: Inst&#228;llningar</B> visas nu. 
<P>Ange programnamnet 
<PRE>
 c:\gstools\gs5.50\gswin32c.exe
</PRE>
<P>och argumenten 
<PRE>
 @c:\gstools\djet500.rsp -sOutputFile="%1" -
</PRE>
<P>Se noga till att du f&#229;r med blanktecknet och <B>bindestrecket</B> p&#229; 
slutet av raden. 
Gl&#246;mmer du detta kan Ghostscript h&#228;nga skrivark&#246;n. 
S&#228;tt Utdata till <A HREF="#111">Kopiera tempor&#228;rfil till skrivare</A> och v&#228;lj skrivare 
<B>HP DeskJet 500</B>. 
<P>
<IMG SRC="portset1.gif">
<P>Om du vill se vad som skrivs till terminalen (dvs. du vill se 
felmeddelanden), se <B>Loggfilsinst&#228;llningar</B>. 
<P>
<IMG SRC="portset2.gif">
<P>Tryck p&#229; OK-knapparna f&#246;r dialogrutorna <B>Loggfilsinst&#228;llningar</B> och 
<B>RPT1: Inst&#228;llningar</B>. 
<P>V&#228;lj <B>Apple LaserWriter II NT v47.0</B> fr&#229;n sidan f&#246;r tillverkare 
och modell i guiden <B>L&#228;gg till skrivare</B>. 
<P>Genom att skriva ut p&#229; skrivaren <B>Apple LaserWriter II NT</B> kommer 
nu Ghostscript att anv&#228;ndas. 
Om du delar ut denna skrivare till klienter i ett n&#228;tverk kommer 
den att se ut som en Postscript-skrivare f&#246;r dem. 
<P>F&#246;r en lista med tillg&#228;ngliga skrivartyper i Ghostscript g&#229; till 
Ghostscriptkatalogen c:\gstools\gs5.50 och k&#246;r 
<PRE>
 gswin32c -h
</PRE>
<P>Om din skrivare inte finns i listan titta p&#229; sidan 
<PRE>
 http://www.cs.wisc.edu/~ghost/printer.html
</PRE>
<P>och se efter om n&#229;gon av de befintliga skrivartyperna i Ghostscript 
fungerar ihop med din skrivare. 
<P>Om du senare vill &#228;ndra inst&#228;llningarna f&#246;r den omdirigerade porten, 
ta fram skrivarinst&#228;llningarna, v&#228;lj fliken <B>Portar</B>, 
och sedan <B>Portinst&#228;llningar</B>. 
RedMon kr&#228;ver att tv&#229;v&#228;gsst&#246;d &#228;r inaktiverat men det f&#246;refaller 
som om det inte ens kan aktiveras. 
<P>
<IMG SRC="ntprop.gif">
<P>
<P>
<HR>
<H2><A NAME="412">Ghostscriptexempel med HP LaserJet skrivare</A></H2>
F&#246;r skrivaren HP LaserJet 4L, beh&#246;ver du anv&#228;nda Ghostscriptenheten 
ljet4 med uppl&#246;sningen satt till 300dpi. 
c:\gstools\ljet4l.rsp, inneh&#229;lla: 
<PRE>
 -Ic:\gstools\gs5.50;c:\gstools\gs5.50\fonts
 -sDEVICE=ljet4
 -r300
 -dNOPAUSE
 -dSAFER
 -sPAPERSIZE=a4
</PRE>
<P>Ghostscriptkommandot skulle vara 
<PRE>
 c:\gstools\gs5.50\gswin32c.exe
</PRE>
<P>och argumenten 
<PRE>
 @c:\gstools\ljet4l.rsp -sOutputFile="%1" -
</PRE>
<P>Kontrollera noga att du tar med blanktecknet och <B>bindestrecket</B> 
p&#229; slutet av raden. 
Gl&#246;mmer du det kan det f&#229; Ghostscript att h&#228;nga skrivark&#246;n. 
Utdata skall vara 
<PRE>
 Kopiera tempor&#228;rfil till skrivare
</PRE>
<P>och skrivare 
<PRE>
 HP LaserJet 4L
</PRE>
<P>Alla andra inst&#228;llningar skall vara desamma som i f&#246;reg&#229;ende exempel. 
<P>
<P>
<HR>
<H1><A NAME="438">Vanliga problem</A></H1>
Om problem skulle uppst&#229; &#228;r det rekommendabelt att st&#228;lla in 
RedMon porten s&#229; att den anv&#228;nder en loggfil med avlusning p&#229;slaget. 
<P><B>Problem:</B> N&#228;r du f&#246;rs&#246;ker skriva ut visas en informationsruta med 
titeln <B>Mappen Skrivare</B> och texten <B>Ett fel uppstod vid skrivning 
till RPT1: f&#246;r skrivare (Apple LaserWriter II NT): Det g&#229;r inte att 
skriva till angiven enhet.</B> 
<P>RedMon kunde inte starta det program du angivet. 
Se efter i Loggfilen f&#246;r fler detaljer. 
<P><B>Problem:</B> Ghostscript h&#228;nger sig. 
<P>Du kan ha gl&#246;mt att l&#228;gga till ett blanktecken och ett bindestreck 
p&#229; slutet av argumenten till Ghostscript. Detta kr&#228;vs f&#246;r att f&#229; 
Ghostscript att l&#228;sa fr&#229;n terminalen. 
<P><B>Problem:</B> Ghostscript bearbetar vissa utskrifter, men inte andra. 
Om du skriver ut till FILE:, s&#229; kan Ghostscript bearbeta dessa 
utskrifter. 
<P>F&#246;rs&#228;kra dig om att <B>Spooler-inst&#228;ll(ningar)</B> &#228;r satta till 
<B>Inaktivera tv&#229;v&#228;gsst&#246;d f&#246;r den h&#228;r skrivaren</B>. 
Om detta &#228;r problemet kommer det, om man har avlusning p&#229;slaget, att 
i loggfilen st&#229; 
<PRE>
 REDMON ReadPort: Du m&#229;ste inaktivera tv&#229;v&#228;gsst&#246;d f&#246;r den h&#228;r skrivaren.
</PRE>
<P>
<P>
<HR>
<H1><A NAME="466">Copyright</A></H1>
<PRE>
 Copyright (C) 1997-1998, Ghostgum Software Pty Ltd.  All rights reserved.
</PRE>
<P>Denna fil &#228;r en del av RedMon. 
<P>Detta program distribueras UTAN N&#197;GRA SOM HELST GARANTIER. Ingen 
tillverkare eller distribut&#246;r tar n&#229;got som helst ansvar f&#246;r vad 
som kan h&#228;nda vid anv&#228;ndning eller f&#246;r att programmet har n&#229;got 
speciellt syfte eller ens fungerar &#246;verhuvudtaget, om inte han 
eller hon s&#228;ger s&#229; skriftligt. Se RedMon Free Public Licence 
("Licensen") f&#246;r fullst&#228;ndig information. 
<P>Varje kopia av RedMon m&#229;ste inneh&#229;lla en kopia av Licensen, normalt 
i en ren ASCII-textfil vid namn LICENCE.  Licensen ger dig r&#228;ttigheter 
att kopiera, modifiera och vidaredistribuera RedMon, men endast under 
vissa villkor beskrivna i Licensen. Bland annat kr&#228;ver Licensen att 
copyrightinformationen och den h&#228;r texten m&#229;ste bevaras intakt i alla 
kopior. 
<P><PRE>
  F&#246;rfattare: Russell Lang, Ghostgum Software Pty Ltd
    Internet: http://www.cs.wisc.edu/~ghost/rjl.html

<P><HR>Created automatically by doc2html
</BODY>
</HTML>
