<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
<TITLE>Druckeranschluß-Umleitungsmonitor</TITLE>
</HEAD>
<BODY>
<H1>Druckeranschluß-Umleitungsmonitor</H1>
<HR>
<H1><A NAME="1">&#220;berblick</A></H1>
Das Druckeranschlu&#223;-Monitorprogramm <B>RedMon</B> leitet einen 
Druckeranschlu&#223; auf ein Programm um. 
Zumeist wird <B>RedMon</B> in Verbindung mit Ghostscript und 
einem Nicht-PostScript-Drucker zur Emulation eines 
PostScript-Druckers verwendet. 
<P><B>RedMon</B> kann in Verbindung mit jedem Programm eingesetzt werden, 
das Daten &#252;ber die Standardeingabe entgegennimmt. 
<P>Mit Hilfe von <B>RedMon</B> lassen sich umgeleitete Druckeranschl&#252;sse 
erzeugen. Beim Anschlu&#223; eines Windows-Druckers an den umgeleiteten 
Druckeranschlu&#223; werden alle an den umgeleiteten Anschlu&#223; gesendeten 
Daten durch <B>RedMon</B> an die Standardeingabe eines Programms weitergeleitet. 
Dieses Programm ist dann f&#252;r die weitere Verarbeitung der Daten und 
f&#252;r das Erzeugen einer neuen Ausgabe verantwortlich. 
<P>Ein auf einen <B>RedMon</B>-Druckeranschlu&#223; umgeleiteter 
PostScript-Windows-Drucker kann in einem Netzwerk gemeinsam benutzt 
werden. 
Wenn dieser PostScript-Windows-Drucker so konfiguriert ist, da&#223; er 
Ghostscript und einen Nicht-Postscript-Drucker verwendet, erscheint 
er anderen Netzwerk-Clienten als ein PostScript-Drucker. 
<P>RedMon unterst&#252;tzt Windows 95, NT 4.0 und 3.51. 
<P>Anf&#228;nger sollten sich beim Konfigurieren von <B>RedMon</B> besser von 
erfahrenen Nutzern helfen lassen. 
<P>
<A HREF="#30">Installation</A><BR>
<A HREF="#42">Deinstallation</A><BR>
<A HREF="#50">Druckeranschluß hinzufügen</A><BR>
<A HREF="#71">Anschlußeinstellungen</A><BR>
<A HREF="#211">Eigenschaften der Protokolldatei</A><BR>
<A HREF="#231">Was ist Ghostscript?</A><BR>
<A HREF="#261">Ghostscript-Beispiel</A><BR>
<A HREF="#456">Häufig auftretende Probleme</A><BR>
<A HREF="#486">Copyright</A><BR>
<P>
<HR>
<H1><A NAME="30">Installation</A></H1>
Zur Installation des <B>RedMon</B>-Druckeranschlu&#223;-Monitors wird das 
Programm <B>setup.exe</B> aufgerufen. 
Die Dateien <B>setup.exe</B>, <B>redmon95.dll</B>, <B>redmonnt.dll</B>, 
<B>redmon35.dll</B>, <B>redmon.hlp</B> und <B>unredmon.exe</B> m&#252;ssen sich alle 
im gleichen Verzeichnis befinden. 
<P>Um <B>RedMon</B> unter Windows NT zu installieren, sind Administratorrechte 
erforderlich. 
<P>Bez&#252;glich der weiteren Installation folge man dem <A HREF="#261">Ghostscript-Beispiel</A>. 
<P>
<P>
<HR>
<H1><A NAME="42">Deinstallation</A></H1>
Zur Deinstallation sind zun&#228;chst s&#228;mtliche Druckertreiber von den 
<B>umgeleiteten</B> Druckeranschl&#252;ssen zu trennen und anschlie&#223;end die 
<B>umgeleiteten</B> Druckeranschl&#252;sse zu l&#246;schen. 
Zum Entfernen des <B>Druckeranschlu&#223;-Umleitungsmonitors RedMon</B> 
verwende man die Registerkarte <B>Installieren/Deinstallieren</B> des 
Dialogfeldes <B>Eigenschaften von Software</B> aus der <B>Systemsteuerung</B>. 
<P>
<P>
<HR>
<H1><A NAME="50">Druckeranschlu&#223; hinzuf&#252;gen</A></H1>
In dem Dialogfeld <B>Anschlu&#223; hinzuf&#252;gen</B> trage man den Namen und die 
Beschreibung eines Druckeranschlusses ein, an den <B>RedMon</B> Daten 
&#252;bergeben soll. Standardm&#228;&#223;ig wird der erste Druckeranschlu&#223; mit 
<B>RPT1:</B> bezeichnet; die zugeh&#246;rige Beschreibung lautet <B>Umgeleiteter 
Anschlu&#223;</B>. 
<P><B>Windows 95:</B> Nach Hinzuf&#252;gen des Druckeranschlusses mu&#223; dieser &#252;ber 
<A HREF="#71">Anschlu&#223;einstellungen</A> und <B>Spool-Einstellungen</B> konfiguriert werden. 
Die <B>Spool-Einstellungen</B> jedes mit diesem Druckeranschlu&#223; verbundenen 
Druckers m&#252;ssen auf <B>Bidirektionale Unterst&#252;tzung deaktivieren</B> 
eingestellt sein. 
<P><B>Windows NT:</B> Nach dem Hinzuf&#252;gen eines Druckeranschlusses mu&#223; dieser 
&#252;ber <B>Druckeranschlu&#223; konfigurieren</B> konfiguriert werden. Die 
<B>Bidirektionale Unterst&#252;tzung</B> sollte deaktiviert sein. 
<P>Der Name des Druckeranschlusses darf nicht mit dem eines bereits 
vorhandenen Druckerschlusses &#252;bereinstimmen. Insbesondere kann kein 
umgeleiteter Druckeranschlu&#223; namens LPT1 erzeugt werden. 
<P>
<P>
<HR>
<H1><A NAME="71">Anschlu&#223;einstellungen</A></H1>
In dem Dialogfeld <B>Anschlu&#223;einstellungen</B> gebe man ein Programm ein, 
auf das die Daten umgeleitet werden sollen. Dieses Programm mu&#223; alle 
auf diesen Anschlu&#223; ausgegebenen Daten &#252;ber die Standardeingabe 
empfangen. In das erste Feld trage man den Namen des Programms und 
in das zweite die entsprechenden Argumente ein. 
<P>Die <B>Ausgabe</B> von dem Programm kann entweder auf 
<A HREF="#102">Programm bearbeitet Ausgabe</A>, auf <B>Kopiere Standardausgabe auf 
Drucker</B> oder auf <A HREF="#120">Kopiere tempor&#228;re Datei auf Drucker</A> eingestellt 
werden. 
In den beiden letzteren F&#228;llen mu&#223; ein <B>Drucker</B> ausgew&#228;hlt werden. 
<P>Falls Sie <A HREF="#135">Drucke Fehler</A> ausw&#228;hlen, wird eine Seite mit einem 
Fehlerbericht ausgedruckt. 
<P>Das Programm kann <B>Normal</B>, als <B>Symbol</B> oder im <B>Hintergrund</B> 
ausgef&#252;hrt werden. 
<P><B>Ausf&#252;hrung als Nutzer</B> ist nur unter Windows NT verf&#252;gbar 
und gew&#246;hnlich deaktiviert. 
<P>Eine <A HREF="#211">Protokolldatei</A> kann so konfiguriert werden, da&#223; sie 
Standardausgaben und Standardfehlerausgaben entgegennimmt. 
Mit einer Protokolldatei k&#246;nnen Fehlermeldungen betrachtet 
werden, die auf die Standardausgabe oder auf die 
Standardfehlerausgebe geschrieben wurden. 
<P>Siehe das <A HREF="#261">Ghostscript-Beispiel</A> und <A HREF="#456">H&#228;ufig auftretende Probleme</A>. 
<P>
<A HREF="#102">Programm bearbeitet Ausgabe</A><BR>
<A HREF="#110">Kopiere Standardausgabe auf Drucker</A><BR>
<A HREF="#120">Kopiere temporäre Datei auf Drucker</A><BR>
<A HREF="#135">Drucke Fehler</A><BR>
<A HREF="#148">Umgebungsvariable</A><BR>
<A HREF="#175">Ausführung als Benutzer</A><BR>
<A HREF="#199">Schließverzögerung</A><BR>
<P>
<HR>
<H2><A NAME="102">Programm bearbeitet Ausgabe</A></H2>
Wenn die Ausgabe auf <B>Programm bearbeitet Ausgabe</B> eingestellt wurde, 
ist f&#252;r alle Ausgaben allein das Umleitungsprogramm zust&#228;ndig. 
Falls das Umleitungsprogramm auf einen anderen Drucker schreiben 
m&#246;chte, mu&#223; es dies selbst tun. Falls das Umleitungsprogramm 
&#252;berhaupt keine Ausgabe erzeugen m&#246;chte, ist auch dies m&#246;glich. 
Dies war das Verhalten von RedMon 1.1 
<P>
<P>
<HR>
<H2><A NAME="110">Kopiere Standardausgabe auf Drucker</A></H2>
Wenn die Ausgabe auf <B>Kopiere Standardausgabe auf Drucker</B> eingestellt 
wurde, soll das Umleitungsprogramm seine Ausgaben auf die 
Standardausgabe schreiben. Redmon kopiert diese auf den angegebenen 
Drucker. Die Standardausgabe wird nicht in die Protokolldatei 
geschrieben. 
<P>Mit Ghostscript 5.50 oder fr&#252;heren Versionen sollte dieses Verfahren 
nicht angewendet werden. 
<P>
<P>
<HR>
<H2><A NAME="120">Kopiere tempor&#228;re Datei auf Drucker</A></H2>
Wenn die Ausgabe auf <B>Kopiere tempor&#228;re Datei auf Drucker</B> eingestellt 
wurde, soll das Umleitungsprogramm seine Ausgaben in eine tempopr&#228;re 
Datei schreiben. RedMon kopiert diese tempor&#228;re Datei auf den angegebenen 
Drucker. Der Name der tempor&#228;ren Datei wird von RedMon festgelegt und 
kann erhalten werden, indem <B>%1</B> in die Programmargumente aufgenommen wird. 
Soll <B>%1</B> in die Programmargumente aufgenommen werden, ohne da&#223; dies 
durch den Namen der tempor&#228;ren Datei ersetzt wird, mu&#223; statt dessen 
<B>%%1</B> verwendet werden. 
<P>Folgendes k&#246;nnte zum Beispiel Bestandteil der Programmargumente sein: 
<PRE>
 -sOutputFile="%1"
</PRE>
<P>Bei der Verwendung von Ghostscript wird dieses Verfahren empfohlen. 
<P>
<P>
<HR>
<H2><A NAME="135">Drucke Fehler</A></H2>
Falls <B>Drucke Fehler</B> ausgew&#228;hlt ist und das Umleitungsprogramm 
vorzeitig abbricht, druckt RedMon eine Seite mit einem Fehlerbericht aus. 
Diese enth&#228;lt den Inhalt der <A HREF="#211">Protokolldatei</A>. Bei der Kombination von 
<B>Drucke Fehler</B> und <B>Debug</B> wird Papier verschwendet. 
<P>Besonders n&#252;tzlich ist <B>Drucke Fehler</B>, wenn ein Umleitungsprogramm 
eine Fehlermeldung auf die Standardausgabe schreibt, die von der 
Protokolldatei abgefangen wird. 
<P>Wenn <A HREF="#102">Programm bearbeitet Ausgabe</A> ausgew&#228;hlt ist, wird 
<B>Drucke Fehler</B> ignoriert. 
<P>
<P>
<HR>
<H2><A NAME="148">Umgebungsvariable</A></H2>
Das Umleitungsprogramm kann einige Druckauftragparameter aus Umgebungsvariablen 
entnehmen. RedMon setzt folgende Umgebungsvariable: 
<P><B>REDMON_PORT</B> ist der Name des Druckeranschlusses, typischerweise "RPT1:". 
<P><B>REDMON_JOB</B> ist die Auftragsnummer, eine ganz Zahl. 
<P><B>REDMON_PRINTER</B> ist der Name des Druckers (z.B. "HP DeskJet 500"). 
<P><B>REDMON_MACHINE</B> ist der Name der Maschine, die den Auftrag erteilt hat 
<PRE>
 (z.B. "\\Desktop").
</PRE>
<P><B>REDMON_USER</B> ist der Name des Benutzers, der Eigent&#252;mer des Auftrags ist 
<PRE>
 (z.B. "JCITIZEN").
</PRE>
<P><B>REDMON_DOCNAME</B> ist der Name des Druckauftrags 
<PRE>
 (z.B. "Druckertestseite").
</PRE>
<P><B>TEMP</B> und <B>TMP</B> sind Verzeichnisse f&#252;r tempor&#228;re Dateien. 
<P>Man beachte, da&#223; das Umleitungsprogramm unter Windows NT in der 
Umgebung des SYSTEM-Kontos ausgef&#252;hrt wird. Abgesehen von den obigen 
Umgebungsvariablen werden nur sehr wenige Einstellungen vorgenommen. 
Der Registrierungsschl&#252;ssel HKEY_USER und das Benutzerprofil sind 
"Standardnutzer". 
<P>
<P>
<HR>
<H2><A NAME="175">Ausf&#252;hrung als Benutzer</A></H2>
"Ausf&#252;hrung als Benutzer" bewirkt, da&#223; das Programm als von dem 
lokalen Anwender ausgef&#252;hrt wird, der den Druckauftrag &#252;bergeben hat. 
<P>"Ausf&#252;hrung als Benutzer" ist nur unter NT4 verf&#252;gbar. Bei einem 
im Netzwerkgemeinsam  verwendeten Drucker ist die Option nicht 
zu aktivieren. 
Remote-Benutzer k&#246;nnen keine Programme auf dem lokalen Computer 
ausf&#252;hren. 
Falls ein Remote-Benutzer einen Auftrag zu &#252;bergeben versucht, 
bricht die EXE mit einer Meldung wie 
<PRE>
 DLL-Initialisierungsroutine
 C:\WINNT4\system32\kernel32.dll
 ist fehlgeschlagen. Proze&#223; wird nicht normal beendet.
</PRE>
<P>ab. Der Spooler-Dienst wird dann gesperrt, bis ihn der Benutzer 
anh&#228;lt und neustartet. 
<P><B>Ausf&#252;hrung als Benutzer</B> ist zum Starten eines lokalen Programms mit 
einer graphischen Benutzeroberfl&#228;che wie GSView &#252;ber RedRun gedacht. 
<P>W&#228;hrend das Programm die Sicherheitsattribute des Benutzers hat, 
der den Druckauftrag &#252;bergeben hat, hat es die Umgebung des SYSTEM-Kontos. 
Die Benutzerprofil-Information ist sind nicht korrekt. 
<P>
<P>
<HR>
<H2><A NAME="199">Schlie&#223;verz&#246;gerung</A></H2>
Nachdem <B>Redmon</B> alle Daten auf das Umleitungsprogramm geschrieben hat, 
wartet es vor dem Schreiben irgendwelcher Ausgaben auf den Drucker und 
dem Schlie&#223;en der Protokolldatei normalerweise maximal 300 Sekunden auf das 
Schlie&#223;en des Umleitungsprogramms. Falls das Programm f&#252;r das Schlie&#223;en 
mehr als 300 Sekunden ben&#246;tigt, kann die Ausgabe des Programms 
verlorengehen oder gek&#252;rzt werden. 
Es ist m&#246;glich, da&#223; ein Teil der Standardausgabe nicht in die 
Protokolldatei geschrieben wird. 
In diesem Fall kann es erforderlich sein, die <B>Schlie&#223;verz&#246;gerung</B> 
zu erh&#246;hen. 
<P>
<P>
<HR>
<H1><A NAME="211">Eigenschaften der Protokolldatei</A></H1>
Wenn Sie <B>RedMon</B> anweisen, eine Protokolldatei zu verwenden, werden 
alle Standardausgaben des Umleitungsprogramms in diese Datei geschrieben. 
Auf diese Weise k&#246;nnen Fehlermitteilungen des Programms aufgezeichnet 
werden, auf das die Standardeingabe umgeleitet wurde. 
<P>Um eine Protokolldatei zu verwenden, mu&#223; <B>Verwende Protokolldatei</B> 
aktiviert und ein g&#252;ltiger Dateiname f&#252;r die Protokolldatei angegeben 
worden sein. 
<P>Wenn <B>Debug</B> aktiviert ist, schreibt RedMon zus&#228;tzliche 
Fehlermeldungen in die Protokolldatei. Diese Meldungen sind vorrangig 
f&#252;r den Autor von RedMon bestimmt. 
Soll die Protokolldatei lediglich 
die Standardausgaben des Programms enthalten, auf das die Daten 
umgeleitet wurden, ist <B>Debug</B> zu deaktivieren. 
<P>Siehe das <A HREF="#261">Ghostscript-Beispiel</A>. 
<P>
<P>
<HR>
<H1><A NAME="231">Was ist Ghostscript?</A></H1>
Ghostscript ist die Bezeichung eines Programmpakets das 
<P>- Einen Interpreter f&#252;r die Sprache PostScript (TM) und das Adobe 
Portable Document Format (PDF - wird gelegentlich mit dem 
PDF-Betrachtungs/Editorprogramm von Adobe verwechselt) und 
<P>- Eine Anzahl von C-Prozeduren (die Ghostscript-Bibliothek), die 
die Graphik- und Filterf&#228;higkeiten (Datenkomprimierung/ 
Datendekomprimierung/Datenumwandlung) realisieren, die in der 
Sprache PostScript und in PDF als primitive Operationen erscheinen, 
umfa&#223;t. 
<P>Ghostscript ist erh&#228;ltlich von 
<PRE>
  http://www.cs.wisc.edu/~ghost/
</PRE>
<P>f&#252;r Microsoft Windows, IBM OS/2, DEC VMS und viele Unix-Versionen. 
<P>Ghostscript ist urheberrechtlich gesch&#252;tztes Eigentum von 
Aladdin Enterprises. 
<P>GSview ist ein von Ghostgum Software Pty Ltd geschriebenes 
Betrachtungsprogramm, das auf Ghostscript aufbaut. 
GSview ist erh&#228;ltlich von 
<PRE>
  http://www.cs.wisc.edu/~ghost/gsview/
</PRE>
<P>Um <B>RedMon</B> in Verbindung mit Ghostscript einzusetzen, sollten 
GSview und Ghostscript unter Verwendung des in GSview enthaltenen 
<B>Setup</B>-Installationsprogramms installiert werden. 
<P>
<P>
<HR>
<H1><A NAME="261">Ghostscript-Beispiel</A></H1>
Bei der Konfiguration gibt es zwischen Windows 95 und Windows NT 
geringf&#252;gige Unterschiede. 
<P>
<A HREF="#265">Ghostscript-Beispiel für Windows 95</A><BR>
<A HREF="#355">Ghostscript-Beispiel für Windows NT 4.0</A><BR>
<A HREF="#432">Ghostscript-Beispiel mit einem HP LaserJet-Drucker</A><BR>
<P>
<HR>
<H2><A NAME="265">Ghostscript-Beispiel f&#252;r Windows 95</A></H2>
<B>RedMon</B> kann in Verbindung mit Ghostscript zum Erzeugen eines 
PostScript-Druckers verwendet werden. 
<P>Um auf einen Drucker HP DeskJet 500 mit dem Druckerwarteschlangennamen 
"HP DeskJet 500" zu drucken, ist zun&#228;chst eine Datei 
namens c:\gstools\djet500.rsp mit dem folgenden Inhalt zu erzeugen: 
<PRE>
 -Ic:\gstools\gs5.50;c:\gstools\gs5.50\fonts
 -sDEVICE=djet500
 -dNOPAUSE
 -dSAFER
 -sPAPERSIZE=a4
</PRE>
<P>Diese Optionen sind in den in Ghostscript enthaltenen Dateien 
<B>Use.htm</B> und <B>Install.htm</B> erl&#228;utert. 
<P>Man betrachte die Eigenschaften eines existierenden Druckers, 
w&#228;hle die Registerkarte <B>Details</B> und klicke dann auf die Schaltfl&#228;che 
<B>Anschlu&#223; hinzuf&#252;gen</B>. 
Man w&#228;hle <B>Andere</B>, <B>Umgeleiteter Anschlu&#223;</B> und danach <B>OK</B>. 
<P>
<IMG SRC="addport1.gif">
<P>Nun erscheint der RedMon-Dialog <B>Umgeleiteten Anschlu&#223; hinzuf&#252;gen</B>. 
Man best&#228;tige die Standardwerte. 
<P>
<IMG SRC="addport2.gif">
<P>Unter Verwendung des <B>Druckerinstallations</B>-Assistenten erzeuge man 
ein neues Druckerobjekt f&#252;r einen PostScript-Drucker. 
Geeignet ist der <B>Apple LaserWriter II NT</B>. 
<P>Unter den Druckereigenschaften dieses neuen PostScript-Druckers 
w&#228;hle man die Schaltfl&#228;che <B>Details</B> und unter <B>Anschlu&#223; f&#252;r 
die Druckerausgabe</B> den eben erzeugten Druckeranschlu&#223; RedMon, meist RPT1: 
<P>
<IMG SRC="property.gif">
<P>Man w&#228;hle die Schaltfl&#228;che <A HREF="#71">Anschlu&#223;einstellungen</A>. 
Nun erscheint der Dialog <B>RPT1: Eigenschaften</B>. 
<P>Hier trage man den Programmnamen 
<PRE>
 c:\gstools\gs5.50\gswin32c.exe
</PRE>
<P>sowie die Argumente 
<PRE>
 @c:\gstools\djet500.rsp -sOutputFile="%1" -
</PRE>
<P>ein. Insbesondere beachte man das Leerzeichen und den <B>Strich</B> am 
Zeilenende. Werden diese vergessen, ist es m&#246;glich, da&#223; Ghostscript 
die Druckerwarteschlange blockiert. 
Man stelle die Ausgabe auf <A HREF="#120">Kopiere tempor&#228;re Datei auf Drucker</A> und 
den Drucker auf <B>HP DeskJet 500</B> ein. 
<P>
<IMG SRC="portset1.gif">
<P>Zur sp&#228;teren Betrachtung der auf die Standardausgabe ausgegebenen 
Fehlermeldungen dient die <A HREF="#211">Protokolldatei</A>. 
<P>
<IMG SRC="portset2.gif">
<P>Nun quittiere man die Dialogfelder <A HREF="#211">Eigenschaften der Protokolldatei</A> 
sowie <B>RPT1: Eigenschaften</B> mit OK. 
<P>Unter den Druckereigenschaften des PostScript-Druckers w&#228;hle man 
die Registerkarte <B>Details</B> und anschlie&#223;end die Schaltfl&#228;che 
<B>Spool-Einstellungen</B>. Man &#228;ndere das <B>Spool-Datenformat</B> in <B>RAW</B>. 
Man w&#228;hle weiter <B>Bidirektionale Unterst&#252;tzung deaktivieren.</B> 
Letztere &#196;nderung ist besonders wichtig. 
<P>
<IMG SRC="spoolset.gif">
<P>Unter den Druckereigenschaften des Postscript-Druckers w&#228;hle man 
die Registerkarte <B>PostScript</B>. Man &#252;berzeuge sich davon, da&#223; 
<B>PostScript-Vorspann</B> auf <B>Vorspann f&#252;r jeden Druckauftrag laden</B> 
eingestellt ist. Man klicke auf die Schaltfl&#228;che <B>Erweitert</B>, um 
<B>Erweiterte PostScript-Optionen</B> anzuzeigen. Das <B>Datenformat</B> 
sollte auf <B>ASCII-Daten</B> eingestellt sein. Man deaktiviere sowohl 
<B>Strg+D vor Auftrag senden</B> als auch <B>Strg+D nach Auftrag senden</B>. 
<P>Beim Drucken auf den <B>Apple LaserWriter II NT</B> erfolgt der Druck 
nun unter Verwendung von Ghostscript. 
Wird der Drucker in einem Netzwerk gemeinsam genutzt, erscheint er 
den anderen Netzwerk-Clienten als ein PostScript-Drucker. 
<P>Um eine Liste der verf&#252;gbaren Ghostscript-Drucker zu erhalten, 
wechsle man in das Ghostscript-Verzeichnis c:\gstools\gs5.50 und rufe 
<PRE>
 gswin32c -h
</PRE>
<P>auf. Ist der vorhandene Drucker nicht aufgef&#252;hrt, suche man unter 
<PRE>
 http://www.cs.wisc.edu/~ghost/printer.html,
</PRE>
<P>ob einer der Standard-Ghostscript-Drucker f&#252;r den vorhandenen 
Drucker verwendet werden kann. 
<P>
<P>
<HR>
<H2><A NAME="355">Ghostscript-Beispiel f&#252;r Windows NT 4.0</A></H2>
<B>RedMon</B> kann in Verbindung mit Ghostscript zum Erzeugen eines 
PostScript-Druckers verwendet werden. 
<P>Um auf einen Drucker HP DeskJet 500 mit dem 
Druckerwarteschlangennamen "HP DeskJet 500" zu drucken, ist zun&#228;chst 
eine Datei namens c:\gstools\djet500.rsp mit dem folgenden Inhalt zu 
erzeugen: 
<PRE>
 -Ic:\gstools\gs5.50;c:\gstools\gs5.50\fonts
 -sDEVICE=djet500
 -dNOPAUSE
 -dSAFER
 -sPAPERSIZE=a4
</PRE>
<P>Diese Optionen sind in den in Ghostscript enthaltenen Dateien 
<B>Use.htm</B> und <B>Install.htm</B> erl&#228;utert. 
<P>Man starte den <B>Druckerinstallations</B>-Assistenten. Auf der zweiten 
Seite w&#228;hle man <B>Druckeranschl&#252;sse</B>. 
<P>
<IMG SRC="ntaddp1.gif">
<P>Man w&#228;hle <B>Umgeleiteter Anschlu&#223;</B> und anschlie&#223;end <B>Neuer Anschlu&#223;</B>. 
Nun erscheint der RedMon-Dialog <B>Umgeleiteten Anschlu&#223; hinzuf&#252;gen</B>. 
Man best&#228;tige die Standardwerte. 
<P>
<IMG SRC="addport2.gif">
<P>Man klicke auf <B>OK</B> und anschlie&#223;end auf <B>Anschlu&#223; konfigurieren</B>. 
Nun erscheint das Dialogfeld <B>RPT1: Eigenschaften</B>. 
<P>Hier trage man den Programmnamen 
<PRE>
 c:\gstools\gs5.50\gswin32c.exe
</PRE>
<P>sowie die Argumente 
<PRE>
 @c:\gstools\djet500.rsp -sOutputFile="%1" -
</PRE>
<P>ein. Insbesondere beachte man das Leerzeichen und den <B>Strich</B> am 
Zeilenende. Werden diese vergessen, ist es m&#246;glich, da&#223; Ghostscript 
die Druckerwarteschlange blockiert. 
Man stelle die Ausgabe auf <A HREF="#120">Kopiere tempor&#228;re Datei auf Drucker</A> und 
den Drucker auf <B>HP DeskJet 500</B> ein. 
<P>
<IMG SRC="portset1.gif">
<P>Zur sp&#228;teren Betrachtung der auf die Standardausgabe ausgegebenen 
Fehlermeldungen dient die <A HREF="#211">Protokolldatei</A>. 
<P>
<IMG SRC="portset2.gif">
<P>Nun quittiere man die Dialogfelder <A HREF="#211">Eigenschaften der Protokolldatei</A> 
sowie <B>RPT1: Eigenschaften</B> mit OK. 
<P>Auf der Seite Hersteller und Modell des 
Druckerinstallations-Assistenten w&#228;hle man den <B>Apple LaserWriter 
II NT v47.0</B>. 
<P>Beim Drucken auf den <B>Apple LaserWriter II NT</B> erfolgt der Druck 
nun unter Verwendung von Ghostscript. 
Wird der Drucker in einem Netzwerk gemeinsam genutzt, erscheint 
er den anderen Netzwerk-Clienten als ein PostScript-Drucker. 
<P>Um eine Liste der verf&#252;gbaren PostScript-Drucker zu erhalten, 
wechsle man in das Ghostscript-Verzeichnis c:\gstools\gs5.50 und 
rufe dann 
<PRE>
 gswin32c -h
</PRE>
<P>auf. Ist der vorhandene Drucker nicht aufgef&#252;hrt, suche man unter 
<PRE>
 http://www.cs.wisc.edu/~ghost/printer.html,
</PRE>
<P>ob einer der Standard-Ghostscript-Drucker f&#252;r den vorhandenen 
Drucker verwendet werden kann. 
<P>Soll der umgeleitete Druckeranschlu&#223; sp&#228;ter konfiguriert werden, 
&#246;ffne man die Druckereigenschaften, w&#228;hle die Registerkarte 
<B>Anschl&#252;sse</B> und danach <B>Konfigurieren</B>. 
Die Bidirektionale Unterst&#252;tzung mu&#223; f&#252;r RedMon deaktiviert sein; 
offensichtlich kann diese aber ohnehin nicht aktiviert werden. 
<P>
<IMG SRC="ntprop.gif">
<P>
<P>
<HR>
<H2><A NAME="432">Ghostscript-Beispiel mit einem HP LaserJet-Drucker</A></H2>
F&#252;r den Drucker HP LaserJet 4L ist das Ghostscript-Ger&#228;t 
ljet4 mit einer Aufl&#246;sung von 300dpi auszuw&#228;hlen. 
Die Antwortdatei c:\gstools\ljet4l.rsp f&#252;r Ghostscript lautet: 
<PRE>
 -Ic:\gstools\gs5.50;c:\gstools\gs5.50\fonts
 -sDEVICE=ljet4
 -r300
 -dNOPAUSE
 -dSAFER
 -sPAPERSIZE=a4
</PRE>
<P>Der Ghostscript-Aufruf lautet dann 
<PRE>
 c:\gstools\gs5.50\gswin32c.exe
</PRE>
<P>und die Argumente 
<PRE>
 @c:\gstools\ljet4l.rsp -sOutputFile="%1" -
</PRE>
<P>Insbesondere beachte man das Leerzeichen und den <B>Strich</B> am 
Zeilenende. Werden diese vergessen, ist es m&#246;glich, da&#223; Ghostscript 
die Druckerwarteschlange blockiert. 
Man stelle die Ausgabe auf <A HREF="#120">Kopiere tempor&#228;re Datei auf Drucker</A> und 
den Drucker auf <B>HP LaserJet 4L</B> ein. 
<P>Die &#252;brigen Einstellungen sollten mit denen des vorigen Beispiels 
&#252;bereinstimmen. 
<P>
<P>
<HR>
<H1><A NAME="456">H&#228;ufig auftretende Probleme</A></H1>
Sollten Probleme auftreten, empfiehlt es sich, 
den RedMon-Druckeranschlu&#223; so zu konfigurieren, da&#223; er eine 
Protokolldatei mit eingeschaltetem <B>Debug</B> schreibt. 
<P>Problem: Beim Versuch zu drucken erscheint ein Nachrichtenfeld mit 
dem Titel 'Druckerordner' und dem Inhalt <B>Fehler beim Schreiben 
auf RPT1 f&#252;r den Drucker (Apple LaserWriter II NT). Das System 
kann nicht auf das angegebene Ger&#228;t schreiben.</B> 
<P>RedMon kann das angegebene Programm nicht starten. 
Einzelheiten entnehme man der Protokolldatei. 
<P><B>Problem:</B> Ghostscript blockiert das System 
<P>M&#246;glicherweise fehlt das Leerzeichen und der <B>Strich</B> am Ende der 
Ghostscript-Argumente. Ghostscript ben&#246;tigt diese, um von der 
Standardeingabe lesen zu k&#246;nnen. 
<P><B>Problem:</B> Ghostscript kann bestimmte Druckauftr&#228;ge ausf&#252;hren, 
andere jedoch nicht. Beim Drucken in eine DATEI kann Ghostscript 
diese Druckauftr&#228;ge ausf&#252;hren. 
<P>Man &#252;berzeuge sich davon, da&#223; in den <B>Spool-Einstellungen</B> 
<B>Bidirektionale Unterst&#252;tzung deaktivieren</B> eingestellt ist. 
Falls dies die Ursache ist, enth&#228;lt die Protokolldatei bei 
eingeschaltetem <B>Debug</B> die Nachricht 
<PRE>
 REDMON Leseanschlu&#223;: Die bidirektionale Druckerunterst&#252;tzung mu&#223;
 f&#252;r diesen Drucker deaktiviert werden.
</PRE>
<P>
<P>
<HR>
<H1><A NAME="486">Copyright</A></H1>
<PRE>
 Copyright (C) 1997-1998, Ghostgum Software Pty Ltd.  Alle Rechte vorbehalten.
 Copyright (C) f&#252;r die deutsche &#220;bersetzung 1998, Michael Basler.
</PRE>
<P>Diese Datei ist Bestandteil von RedMon. 
<P>Das Programm wird OHNE HAFTUNG IRGENDWELCHER ART weitergegeben. 
Falls nicht anders festgelegt, &#252;bernehmen weder der Autor noch der 
Verteiler irgendeine Verantwortung f&#252;r die Folgen seiner Anwendung 
oder daf&#252;r, da&#223; es einen bestimmten Zweck erf&#252;llt oder f&#252;r seine 
Funktion &#252;berhaupt. Bez&#252;glich weiterer Einzelheiten wird auf die 
RedMon Free Public Licence (die "Lizenz") verwiesen. 
<P>Jede Kopie von RedMon mu&#223; eine Kopie der Lizenz, normalerweise 
in Gestalt einer reinen ASCII-Datei mit dem Namen LICENCE enthalten. 
Die Lizenz erteilt das Recht, RedMon zu kopieren, zu modifizieren und 
weiterzuverteilen, wobei aber bestimmte in der Lizenz genannte 
Bedingungen einzuhalten sind. Unter anderem legt die Lizenz fest, 
da&#223; der Urheberrechtsschutz-Vermerk und diese Anmerkung in allen 
Kopien enthalten sein m&#252;ssen. 
<P><PRE>
    Autor: Russell Lang, Ghostgum Software Pty Ltd
  Internet: http://www.cs.wisc.edu/~ghost/rjl.html
</PRE>
<P>
<P><HR>Created automatically by doc2html
</BODY>
</HTML>
