<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
<TITLE>Moniteur de redirection de port</TITLE>
</HEAD>
<BODY>
<H1>Moniteur de redirection de port</H1>
<HR>
<H1><A NAME="1">Vue d'ensemble</A></H1>
Le moniteur de port <B>RedMon</B> redirige un port d'imprimante particulier 
vers un programme. 
<B>RedMon</B> est g&#233;n&#233;ralement employ&#233; avec Ghostscript et une imprimante non-PostScript 
pour &#233;muler une imprimante PostScript. 
<P><B>RedMon</B> peut &#234;tre utilis&#233; avec n'importe quel programme acceptant des 
donn&#233;es sur l'entr&#233;e standard. 
<P><B>RedMon</B> vous permet de cr&#233;er des ports d'imprimante redirig&#233;s.  Si vous reliez une 
imprimante de Windows au port redirig&#233;, toutes les donn&#233;es 
envoy&#233;es au port redirig&#233; seront exp&#233;di&#233;es par <B>RedMon</B> &#224; l'entr&#233;e standard 
d'un programme.  Ce programme se charge alors du traitement des donn&#233;es et de la 
cr&#233;ation d'une nouvelle impression. 
<P>Une imprimante Windows PostScript redirig&#233;e vers un port RedMon peut &#234;tre partag&#233;e 
en r&#233;seau. 
Si cette imprimante est configur&#233;e pour utiliser Ghostscript et une imprimante non-PostScript, 
elle appara&#238;tra sous la forme d'une imprimante PostScript pour les autres utilisateurs du r&#233;seau. 
<P>RedMon fonctionne sous Windows 95, NT 4.0 et 3.51. 
<P>La configuration de <B>RedMon</B> s'adresse &#224; des utilisateurs exp&#233;riment&#233;s. 
<P>
<A HREF="#25">Installation</A><BR>
<A HREF="#36">Désinstallation</A><BR>
<A HREF="#42">Ajouter un port</A><BR>
<A HREF="#61">Paramètres du port</A><BR>
<A HREF="#191">Propriétés du fichier trace</A><BR>
<A HREF="#209">Qu'est-ce que Ghostscript?</A><BR>
<A HREF="#235">Exemple Ghostscript</A><BR>
<A HREF="#425">Problèmes communs</A><BR>
<A HREF="#452">Copyright</A><BR>
<A HREF="#473">Nouvelles fonctionnalités</A><BR>
<P>
<HR>
<H1><A NAME="25">Installation</A></H1>
Ex&#233;cutez <B>setup.exe</B> pour installer le moniteur de redirection de port <B>RedMon</B>. 
Les fichiers <B>setup.exe</B>, <B>redmon95.dll</B>, <B>redmonnt.dll</B>, <B>redmon35.dll</B>, 
<B>redmon.hlp</B> et <B>unredmon.exe</B> 
doivent tous &#234;tre situ&#233;s dans le m&#234;me r&#233;pertoire. 
<P>Pour installer <B>RedMon</B> sous Windows NT, vous devrez avoir les privil&#232;ges 
Administrateur. 
<P>Suivez l'<A HREF="#235">Exemple Ghostscript</A> pour le reste de la configuration. 
<P>
<P>
<HR>
<H1><A NAME="36">D&#233;sinstallation</A></H1>
Pour d&#233;sinstaller RedMon, vous devez tout d'abord d&#233;connecter toutes les imprimantes reli&#233;es aux 
ports <B>redirig&#233;s</B> et ensuite supprimer les ports <B>redirig&#233;s</B>. 
Utilisez l'ic&#244;ne <B>Ajout/Suppression de programmes</B> se trouvant dans le <B>Panneau de configuration</B> pour supprimer 
<B>RedMon - Redirection Port Monitor</B>. 
<P>
<P>
<HR>
<H1><A NAME="42">Ajouter un port</A></H1>
Dans la bo&#238;te de dialogue <B>Ajout d'un port redirig&#233;</B>, entrez le nom 
et la description d'un port que <B>RedMon</B> va utiliser. 
Par d&#233;faut, le premier port que vous d&#233;finissez s'appellera <B>RPT1:</B> 
et sa description sera <B>Port redirig&#233;</B>. 
<P><B>Windows 95 :</B> Apr&#232;s avoir ajout&#233; un port, vous devez le configurer 
&#224; l'aide de <A HREF="#61">Param&#232;tres du port</A> et <B>Param&#232;tres du spouleur</B>. 
Pour toute imprimante reli&#233;e &#224; ce port, la case d'option 
<B>D&#233;sactiver le support bidirectionnel pour cette imprimante</B> de la bo&#238;te de dialogue 
<B>Param&#232;tres du spouleur</B> <B>doit</B> &#234;tre activ&#233;e. 
<P><B>Windows NT :</B> Apr&#232;s avoir ajout&#233; un port, vous devez le configurer 
&#224; l'aide de <B>Configuration du port</B>. La case &#224; cocher <B>Activer le support bidirectionnel support</B> 
doit &#234;tre d&#233;sactiv&#233;e. 
<P>Vous ne pouvez pas utiliser le m&#234;me nom de port qu'un port existant. 
En particulier, vous ne pouvez pas cr&#233;er de port redirig&#233; nomm&#233; LPT1: 
<P>
<P>
<HR>
<H1><A NAME="61">Param&#232;tres du port</A></H1>
Dans la bo&#238;te de dialogue <B>Param&#232;tres du port</B>, indiquez le nom d'un programme de redirection 
destin&#233; &#224; recevoir sur l'entr&#233;e standard toutes les donn&#233;es envoy&#233;es &#224; ce port. 
Le nom du programme est entr&#233; dans le premier champ d'&#233;dition 
et les arguments dans le second champ d'&#233;dition. 
<P>Pour l'<B>Impression</B> depuis le programme, vous pouvez choisir entre 
<A HREF="#88">Le programme se charge de l'impression</A>, <A HREF="#96">Copier la sortie standard vers l'imprimante</A> 
et <A HREF="#104">Copier le fichier temporaire vers l'imprimante</A>. 
Dans les deux derniers cas, vous devez sp&#233;cifier une <B>Imprimante</B>. 
<P>Si vous s&#233;lectionnez <A HREF="#119">Imprimer les erreurs</A>, un compte-rendu d'erreurs 
sera imprim&#233;. 
<P>Le programme peut &#234;tre ex&#233;cut&#233; <B>Normal</B>, <B>R&#233;duit</B> ou <B>Cach&#233;</B>. 
<P><A HREF="#161">Ex&#233;cuter en tant qu'utilisateur</A> n'est disponible que sous Windows NT et 
est en g&#233;n&#233;ral d&#233;sactiv&#233;. 
<P>Un <A HREF="#191">Fichier trace</A> peut &#234;tre configur&#233; de telle sorte qu'il re&#231;oive les canaux 
de sortie et d'erreur standards. 
Gr&#226;ce &#224; un fichier trace, vous pouvez voir les messages d'erreur qui ont &#233;t&#233; &#233;crits 
sur les canaux de sortie et d'erreur standards. 
<P>Voir l'<A HREF="#235">Exemple Ghostscript</A> et les <B>Probl&#232;mes courants</B>. 
<P>
<A HREF="#88">Le programme se charge de l'impression</A><BR>
<A HREF="#96">Copier la sortie standard vers l'imprimante</A><BR>
<A HREF="#104">Copier le fichier temporaire vers l'imprimante</A><BR>
<A HREF="#119">Imprimer les erreurs</A><BR>
<A HREF="#134">Variables d'environnement</A><BR>
<A HREF="#161">Exécuter en tant qu'utilisateur</A><BR>
<A HREF="#183">Délai de fermeture</A><BR>
<P>
<HR>
<H2><A NAME="88">Le programme se charge de l'impression</A></H2>
Lorsque vous choisissez pour l'impression<B> Le programme se charge de l'impression</B>, 
le programme de redirection se charge enti&#232;rement de toute impression. 
Si le programme de redirection veut &#233;crire sur une autre imprimante, 
c'est &#224; lui de s'en charger.  Le programme de redirection peut &#233;galement choisir de ne 
g&#233;n&#233;rer aucune impression du tout. 
C'est la fa&#231;on dont RedMon 1.1 se comportait. 
<P>
<P>
<HR>
<H2><A NAME="96">Copier la sortie standard vers l'imprimante</A></H2>
Lorsque vous choisissez pour l'impression<B> Copier la sortie standard vers l'imprimante</B>, 
la sortie du programme de redirection doit &#234;tre le canal de sortie standard. 
RedMon copiera celle-ci vers l'imprimante sp&#233;cifi&#233;e. 
Le contenu du canal de sortie standard ne sera pas &#233;crit dans le fichier trace. 
<P>Pour utiliser cette m&#233;thode, vous devez disposer d'une version de Ghostscript ult&#233;rieure &#224; la 5.50. 
<P>
<P>
<HR>
<H2><A NAME="104">Copier le fichier temporaire vers l'imprimante</A></H2>
Lorsque vous choisissez pour l'impression<B> Copier le fichier temporaire vers l'imprimante</B>, 
la sortie du programme de redirection doit &#234;tre un fichier temporaire. 
RedMon copiera celui-ci vers l'imprimante sp&#233;cifi&#233;e. 
Le nom du fichier temporaire est sp&#233;cifi&#233; par RedMon, et 
peut &#234;tre obtenu en ins&#233;rant <B>%1</B> dans la liste des arguements du programme. 
Si vous souhaitez placer <B>%1</B> dans la liste des arguments du programme et ne voulez pas 
que celui-ci soit substitu&#233; par le nom du fichier temporaire, vous 
devez le remplacer par <B>%%1</B>. 
<P>Par exemple, la liste des arguments du programme peut comporter : 
<PRE>
 -sOutputFile="%1"
</PRE>
<P>Cette m&#233;thode est recommand&#233;e pour l'utilisation avec Ghostscript. 
<P>
<P>
<HR>
<H2><A NAME="119">Imprimer les erreurs</A></H2>
Si <B>Imprimer les erreurs</B> est s&#233;lectionn&#233; et si le programme de  
redirection s'arr&#234;te pr&#233;matur&#233;ment, RedMon imprimera un compte-rendu  
d'erreurs. 
Celui-ci contiendra le contenu du <A HREF="#191">Fichier trace</A>. 
Si vous s&#233;lectionnez <B>Imprimer les erreurs</B> et <B>D&#233;bogage</B>, une  
quantit&#233; plus importante de papier sera gaspill&#233;e. 
<P><B>Imprimer les erreurs</B> est surtout utile lorsqu'un programme de  
redirection &#233;crit un message d'erreur sur le canal de sortie standard,  
captur&#233; par le fichier trace. 
<P><B>Imprimer les erreurs</B> est ignor&#233; si <B>Le programme se charge de 
l'impression</B> est s&#233;lectionn&#233;. 
<P>
<P>
<HR>
<H2><A NAME="134">Variables d'environnement</A></H2>
Le programme de redirection peut obtenir des variables d'environnement 
certains param&#232;tres pour les travaux d'impression.  Les variables 
d'environnement d&#233;finies par RedMon sont : 
<P><B>REDMON_PORT</B> est le nom du port, typiquement "RPT1:". 
<P><B>REDMON_JOB</B> est le num&#233;ro du travail, un entier. 
<P><B>REDMON_PRINTER</B> est le nom de l'imprimante (par ex. "HP DeskJet 500"). 
<P><B>REDMON_MACHINE</B> est le nom de la machine qui a cr&#233;&#233; le travail 
(par ex. "\\Bureau"). 
<P><B>REDMON_USER</B> est le nom de l'utilisateur &#224; qui appartient le travail 
(par ex. "JDUPONT"). 
<P><B>REDMON_DOCNAME</B> est le nom du travail d'impression 
(par ex. "Page de Test d'Impression"). 
<P><B>TEMP</B> et <B>TMP</B> sont les r&#233;pertoires pour les fichiers temporaires. 
<P>Notez que sous Windows NT, le programme de redirection s'ex&#233;cute 
dans l'environnement du compte SYSTEM.  A part les variables d'environnement 
mentionn&#233;es ci-dessus, tr&#232;s peu sont d&#233;finies.  La cl&#233; de registre 
HKEY_USER et le profil d'utilisateur sont ceux de l'"Utilisateur par d&#233;faut". 
<P>
<P>
<HR>
<H2><A NAME="161">Ex&#233;cuter en tant qu'utilisateur</A></H2>
Avec "Ex&#233;cuter en tant qu'utilisateur", le programme s'ex&#233;cute en tant que l'utilisateur 
qui a soumis le travail d'impression. 
<P>"Ex&#233;cuter en tant qu'utilisateur" n'est disponible que sous NT4.  Ne l'utilisez pas 
si l'imprimante est partag&#233;e en r&#233;seau. 
Les utilisateurs distants ne peuvent pas ex&#233;cuter de programmes sur votre ordinateur. 
Si un utilisateur distant essaie de soumettre un travail d'impression, l'EXE va s'interrompre 
sur un message du type : 
<PRE>
 L'initialisation de la dynamic link library
 C:\WINNT4\system32\kernel32.dll a &#233;chou&#233;.
 Le process s'est termin&#233; de fa&#231;on anormale.
</PRE>
<P>Le service spouler va &#234;tre bloqu&#233; jusqu'&#224; ce que vous l'arr&#234;tiez 
et le relanciez. 
<B>Ex&#233;cuter en tant qu'utilisateur </B>est destin&#233; &#224; &#234;tre utilis&#233; pour lancer un programme GUI 
tel que GSview localement via RedRun. 
<P>Alors que le programme va avoir les attributs de s&#233;curit&#233; de 
l'utilisateur qui a soumis le travail d'impression, il va avoir l'environnement 
du compte SYSTEM.  Les informations du profil d'utilisateur 
seront incorrectes. 
<P>
<P>
<HR>
<H2><A NAME="183">D&#233;lai de fermeture</A></H2>
Apr&#232;s avoir envoy&#233; toutes les donn&#233;es au programme de redirection, <B>RedMon</B> attendra 
normalement la fermeture du programme de redirection pendant au plus 300 secondes 
avant de fermer le fichier trace. Si le programme a besoin de plus de 300 secondes 
pour se fermer, il pourra arriver qu'une partie de la sortie standard n'ait pas encore 
&#233;t&#233; &#233;crite dans le fichier trace. Si cela se produit, vous pouvez 
augmenter le <B>D&#233;lai de fermeture</B>. 
<P>
<P>
<HR>
<H1><A NAME="191">Propri&#233;t&#233;s du fichier trace</A></H1>
Si vous demandez &#224; <B>RedMon</B> d'utiliser un fichier trace, toute la sortie standard du 
programme de redirection sera &#233;crit dans ce fichier. 
Ceci est utile pour capturer des messages d'erreur venant du programme 
vers lequel vous avez redirig&#233; l'entr&#233;e standard. 
<P>Pour utiliser un fichier trace, vous devez activer la case &#224; cocher <B>Utiliser un fichier trace</B> et 
indiquer un nom de fichier valide pour le fichier trace. 
<P>Si vous activez la case &#224; cocher <B>D&#233;bogage</B>, RedMon &#233;crira des messages de d&#233;bogage suppl&#233;mentaires 
dans le fichier trace.  Ces messages ne sont probablement utiles qu'&#224; 
l'auteur de RedMon. 
Si vous voulez que le fichier trace ne contienne que la sortie standard 
du programme de redirection, d&#233;sactiver la case &#224; cocher <B>D&#233;bogage</B>. 
<P>Voir l'<A HREF="#235">Exemple Ghostscript</A>. 
<P>
<P>
<HR>
<H1><A NAME="209">Qu'est-ce que Ghostscript?</A></H1>
Ghostscript est le nom d'un ensemble de logiciels qui fournit : 
<P>- Un interpr&#233;teur pour le langage PostScript (TM) et le format de document portatif 
d'Adobe (Portable Document Format, PDF -- parfois confondu avec Acrobat, 
le produit d'Adobe permettant l'&#233;dition et la consultation de documents PDF), et 
<P>- un ensemble de proc&#233;dures en C (la biblioth&#232;que Ghostscript) qui impl&#233;mente 
les capacit&#233;s de graphisme et de filtrage (compression / d&#233;compression / conversion de donn&#233;es) 
qui constituent les op&#233;rations de base dans le langage PostScript 
et dans le PDF. 
<P>Ghostscript est disponible pour Microsoft Windows, IBM OS/2, 
DEC VMS et pour de nombreuses versions d'Unix &#224; l'adresse 
<PRE>
  http://www.cs.wisc.edu/~ghost/
</PRE>
<P>Ghostscript appartient &#224; Aladdin Enterprises (tous droits r&#233;serv&#233;s). 
<P>GSview est un visualisateur &#233;crit par Ghostgum Software Pty Ltd, bas&#233; sur 
Ghostscript.  GSview est disponible &#224; l'adresse 
<PRE>
  http://www.cs.wisc.edu/~ghost/gsview/
</PRE>
<P>Si vous souhaitez utiliser Ghostscript avec <B>RedMon</B>, vous devriez utiliser 
le programme d'<B>installation</B> fourni avec GSview pour installer GSview et Ghostscript. 
<P>
<P>
<HR>
<H1><A NAME="235">Exemple Ghostscript</A></H1>
Windows 95 et Windows NT ont des configurations l&#233;g&#232;rement diff&#233;rentes. 
<P>
<A HREF="#238">Exemple Ghostscript pour Windows 95</A><BR>
<A HREF="#327">Exemple Ghostscript pour Windows NT 4.0</A><BR>
<A HREF="#400">Exemple Ghostscript avec une imprimante HP LaserJet</A><BR>
<P>
<HR>
<H2><A NAME="238">Exemple Ghostscript pour Windows 95</A></H2>
Vous pouvez utiliser Ghostscript avec <B>RedMon</B> pour cr&#233;er une imprimante PostScript. 
<P>Pour imprimer sur une imprimante HP DeskJet 500 dont le nom de file d'attente est 
"HP DeskJet 500", cr&#233;ez tout d'abord un fichier nomm&#233; 
c:\gstools\djet500.rsp contenant les lignes suivantes : 
<PRE>
 -Ic:\gstools\gs5.50;c:\gstools\gs5.50\fonts
 -sDEVICE=djet500
 -dNOPAUSE
 -dSAFER
 -sPAPERSIZE=a4
</PRE>
<P>Voir les fichiers <B>Use.htm</B> et <B>Install.htm</B> fournis avec Ghostscript pour 
une explication de ces options. 
<P>Visualisez les propri&#233;t&#233;s d'une imprimante existante, 
s&#233;lectionnez l'onglet <B>D&#233;tails</B> puis cliquez sur le bouton <B>Ajouter un port...</B>. 
Dans la bo&#238;te de dialogue <B>Ajout d'un port </B>qui appara&#238;t alors, activez la case d'option <B>Autre</B>, s&#233;lectionnez <B>Port redirig&#233;</B> puis <B>OK</B>. 
<P>
<IMG SRC="addport1.gif">
<P>La bo&#238;te de dialogue <B>Ajout d'un port redirig&#233;</B> de RedMon appara&#238;t.  Acceptez ce qui est propos&#233; par d&#233;faut. 
<P>
<IMG SRC="addport2.gif">
<P>En utilisant l'assistant <B>Ajout d'imprimante</B>, cr&#233;ez une nouvelle ic&#244;ne pour une imprimante 
PostScript. 
Un mod&#232;le appropri&#233; est l'imprimante <B>Apple LaserWriter II NT</B>. 
<P>Visualisez les propri&#233;t&#233;s de cette nouvelle imprimante PostScript, 
s&#233;lectionnez l'onglet <B>D&#233;tails</B> puis s&#233;lectionnez 
dans la liste <B>Imprimer vers</B> le port 
RedMon que vous avez cr&#233;&#233;, 
probablement RPT1: 
<P>
<IMG SRC="property.gif">
<P>Cliquez sur le bouton <A HREF="#61">Param&#232;tres du port</A>. 
La bo&#238;te de dialogue <B>Propri&#233;t&#233;s de RPT1:</B> appara&#238;t. 
<P>Entrez comme nom du programme 
<PRE>
 c:\gstools\gs5.50\gswin32c.exe
</PRE>
<P>et comme arguments 
<PRE>
 @c:\gstools\djet500.rsp -sOutputFile="%1" -
</PRE>
<P>N'omettez pas l'espace et le <B>tiret</B> &#224; la fin de la ligne. 
Si vous oubliez de faire ceci, il pourra arriver que Ghostscript bloque la file 
d'attente de l'imprimante. 
R&#233;glez l'impression sur <A HREF="#104">Copier le fichier temporaire vers l'imprimante</A> et choisissez 
l'imprimante <B>HP DeskJet 500</B>. 
<P>
<IMG SRC="portset1.gif">
<P>Si vous voulez savoir ce qui est &#233;crit sur la sortie standard (i.e. si vous souhaitez 
voir d'&#233;ventuels messages d'erreur), cliquez sur le bouton <A HREF="#191">Fichier trace</A>. 
<P>
<IMG SRC="portset2.gif">
<P>Cliquez sur le bouton OK dans les bo&#238;tes de dialogue <B>Propri&#233;t&#233;s du fichier trace RPT1:</B> et 
<B>Propri&#233;t&#233;s de RPT1:</B>. 
<P>A partir des propri&#233;t&#233;s de cette imprimante PostScript, 
s&#233;lectionnez l'onglet <B>D&#233;tails</B> puis cliquez sur le bouton <B>Param&#232;tres du spouleur</B>. 
Choisissez <B>RAW</B> comme <B>Format de donn&#233;es</B>. 
Activez la case d'option <B>D&#233;sactiver le support bidirectionnel pour cette imprimante</B>. 
Ce dernier changement est le plus important. 
<P>
<IMG SRC="spoolset.gif">
<P>A partir des propri&#233;t&#233;s de cette imprimante PostScript, 
s&#233;lectionnez l'onglet <B>PostScript</B>. Dans la zone <B>En-t&#234;te PostScript</B>, assurez-vous que la case d'option 
<B>T&#233;l&#233;charger l'en-t&#234;te &#224; chaque impression</B> est bien activ&#233;e. 
Cliquez sur le bouton <B>Avanc&#233;es</B> pour afficher les 
<B>Options PostScript avanc&#233;es</B>. 
Dans la zone <B>Format des donn&#233;es</B>, assurez-vous que la case d'option <B>Donn&#233;es ASCII</B> est bien activ&#233;e. 
D&#233;sactivez les cases &#224; cocher <B>Envoyer CTRL+D avant le travail</B> et <B>Envoyer CTRL+D apr&#232;s le travail</B>. 
<P>Les travaux d'impressions destin&#233;s &#224; cette imprimante <B>Apple LaserWriter II NT</B> seront maintenant effectu&#233;es 
en utilisant Ghostscript. 
Si vous partagez cette imprimante en r&#233;seau, elle appara&#238;tra sous la forme d'une 
imprimante PostScript pour les autres utilisateurs du r&#233;seau. 
<P>Pour obtenir une liste des mod&#232;les d'imprimantes Ghostscript disponibles, placez-vous 
dans le r&#233;pertoire de Ghostscript (c:\gstools\gs5.50) et ex&#233;cutez 
<PRE>
 gswin32c -h
</PRE>
<P>Si votre imprimante ne figure pas dans la liste, consultez la page 
<PRE>
 http://www.cs.wisc.edu/~ghost/printer.html
</PRE>
<P>pour voir si l'un des mod&#232;les d'imprimantes Ghostscript existants 
fonctionnera avec votre imprimante. 
<P>
<P>
<HR>
<H2><A NAME="327">Exemple Ghostscript pour Windows NT 4.0</A></H2>
Vous pouvez utiliser Ghostscript avec <B>RedMon</B> pour cr&#233;er une imprimante PostScript. 
<P>Pour imprimer sur une imprimante HP DeskJet 500 dont le nom de file d'attente est 
"HP DeskJet 500", cr&#233;ez tout d'abord un fichier nomm&#233; 
c:\gstools\djet500.rsp contenant les lignes suivantes : 
<PRE>
 -Ic:\gstools\gs5.50;c:\gstools\gs5.50\fonts
 -sDEVICE=djet500
 -dNOPAUSE
 -dSAFER
 -sPAPERSIZE=a4
</PRE>
<P>Voir les fichiers <B>Use.htm</B> et <B>Install.htm</B> fournis avec Ghostscript pour 
une explication de ces options. 
<P>Lancez l'assistant <B>Ajout d'imprimante</B>. 
Sur la deuxi&#232;me page, s&#233;lectionnez <A HREF="#42">Ajouter un port</A>. 
<P>
<IMG SRC="ntaddp1.gif">
<P>S&#233;lectionnez <B>Port redirig&#233;</B> puis cliquez sur le bouton <B>Nouveau port</B>. 
La bo&#238;te de dialogue <B>Ajout d'un port redirig&#233;</B> de RedMon appara&#238;t. 
Acceptez ce qui est propos&#233; par d&#233;faut. 
<P>
<IMG SRC="addport2.gif">
<P>Cliquez sur <B>Fermer</B> puis sur <A HREF="#61">Configurer le port</A>. 
La bo&#238;te de dialogue <B>Propri&#233;t&#233;s de RPT1:</B> appara&#238;t. 
<P>Entrez comme nom du programme 
<PRE>
 c:\gstools\gs5.50\gswin32c.exe
</PRE>
<P>et comme arguments 
<PRE>
 @c:\gstools\djet500.rsp -sOutputFile="%1" -
</PRE>
<P>N'omettez pas l'espace et le <B>tiret</B> &#224; la fin de la ligne. 
Si vous oubliez de faire ceci, il pourra arriver que Ghostscript bloque la file 
d'attente de l'imprimante. 
R&#233;glez l'impression sur <A HREF="#104">Copier le fichier temporaire vers l'imprimante</A> et choisissez 
l'imprimante <B>HP DeskJet 500</B>. 
<P>
<IMG SRC="portset1.gif">
<P>Si vous voulez savoir ce qui est &#233;crit sur la sortie standard (i.e. si vous souhaitez 
voir d'&#233;ventuels messages d'erreur), cliquez sur le bouton <A HREF="#191">Fichier trace</A>. 
<P>
<IMG SRC="portset2.gif">
<P>Cliquez sur le bouton OK dans les bo&#238;tes de dialogue <B>Propri&#233;t&#233;s du fichier trace RPT1:</B> et 
<B>Propri&#233;t&#233;s de RPT1:</B>. 
<P>Dans la bo&#238;te de dialogue de l'assistant <B>Ajout d'imprimante</B> r&#233;pertoriant les constructeurs 
et les types d'imprimantes, s&#233;lectionnez l'imprimante <B>Apple LaserWriter II NT v47.0</B>. 
<P>Les travaux d'impressions destin&#233;s &#224; cette imprimante <B>Apple LaserWriter II NT</B> seront maintenant effectu&#233;es 
en utilisant Ghostscript. 
Si vous partagez cette imprimante en r&#233;seau, elle appara&#238;tra sous la forme d'une 
imprimante PostScript pour les autres utilisateurs du r&#233;seau. 
<P>Pour obtenir une liste des mod&#232;les d'imprimantes Ghostscript disponibles, placez-vous 
dans le r&#233;pertoire de Ghostscript (c:\gstools\gs5.50) et ex&#233;cutez 
<PRE>
 gswin32c -h
</PRE>
<P>Si votre imprimante ne figure pas dans la liste, consultez la page 
<PRE>
 http://www.cs.wisc.edu/~ghost/printer.html
</PRE>
<P>pour voir si l'un des mod&#232;les d'imprimantes Ghostscript existants 
fonctionnera avec votre imprimante. 
<P>Si vous souhaitez configurer le port redirig&#233; ult&#233;rieurement, 
dans les propri&#233;t&#233;s de l'imprimante, s&#233;lectionnez l'onglet <B>Ports</B> 
et configurez <B>Configurer les ports</B>. 
Pour utiliser RedMon, il est n&#233;cessaire que le support bidirectionnel soit d&#233;sactiv&#233;, 
mais il s'av&#232;re qu'il ne peut pas &#234;tre activ&#233;. 
<P>
<IMG SRC="ntprop.gif">
<P>
<P>
<HR>
<H2><A NAME="400">Exemple Ghostscript avec une imprimante HP LaserJet</A></H2>
Pour l'imprimante HP LaserJet 4L, vous devez utiliser le mod&#232;le d'imprimante Ghostscript 
ljet4 et r&#233;gler la r&#233;solution sur 300dpi. 
c:\gstools\ljet4l.rsp devrait contenir les lignes suivantes : 
<PRE>
 -Ic:\gstools\gs5.50;c:\gstools\gs5.50\fonts
 -sDEVICE=ljet4
 -r300
 -dNOPAUSE
 -dSAFER
 -sPAPERSIZE=a4
</PRE>
<P>La commande Ghostscript serait 
<PRE>
 c:\gstools\gs5.50\gswin32c.exe
</PRE>
<P>et les arguments 
<PRE>
 @c:\gstools\ljet4l.rsp -sOutputFile="%1" -
</PRE>
<P>N'omettez pas l'espace et le <B>tiret</B> &#224; la fin de la ligne. 
Si vous oubliez de faire ceci, il pourra arriver que Ghostscript bloque la file 
d'attente de l'imprimante. 
L'impression serait : 
<PRE>
 Copier le fichier temporaire vers l'imprimante
</PRE>
<P>et l'imprimante : 
<PRE>
 HP LaserJet 4L
</PRE>
<P>Tous les autres param&#232;tres devraient &#234;tre identiques &#224; ceux de l'exemple pr&#233;c&#233;dent. 
<P>
<P>
<HR>
<H1><A NAME="425">Probl&#232;mes communs</A></H1>
Si vous avez des probl&#232;mes, il est recommand&#233; de configurer le 
port RedMon de telle sorte qu'il cr&#233;e un fichier trace comportant les informations de d&#233;bogage. 
<P>Probl&#232;me : En essayant d'imprimer, une bo&#238;te de dialogue intitul&#233;e <B>Dossier Imprimantes</B> 
appara&#238;t et affiche le message <B>Il y a eu un probl&#232;me d'impression sur RPT1: pour l'imprimante 
(Apple LaserWriter II NT) : Le syst&#232;me ne peut pas &#233;crire vers le p&#233;riph&#233;rique sp&#233;cifi&#233;.</B> 
<P>RedMon n'a pas pu lancer le programme que vous avez sp&#233;cifi&#233;. 
Regardez dans le fichier trace pour plus de d&#233;tails. 
<P><B>Probl&#232;me :</B> Ghostscript se bloque. 
<P>Il est possible que vous ayez oubli&#233; d'ajouter un espace et un tiret &#224; la fin de la ligne 
contenant les arguments de Ghostscript.  Ceci est n&#233;cessaire pour que Ghostscript puisse 
lire l'entr&#233;e standard. 
<P><B>Probl&#232;me :</B> Certains travaux d'impression sont effectu&#233;s par Ghostscript, d'autres non. 
Si vous imprimez vers le port FILE:, Ghostscript est capable d'effectuer ces travaux. 
<P>Assurez-vous que dans la bo&#238;te de dialogue <B>Param&#232;tres du spouleur</B>, la case d'option 
<B>D&#233;sactiver le support bidirectionnel pour cette imprimante</B> est bien activ&#233;e. 
Si c'est bien le probl&#232;me, le fichier trace lorsque vous avez choisi d'inclure les informations de d&#233;bogage 
contiendra le message 
<PRE>
 REDMON ReadPort: Vous devez d&#233;sactiver le support bidirectionnel
 pour cette imprimante.
</PRE>
<P>
<P>
<HR>
<H1><A NAME="452">Copyright</A></H1>
<PRE>
 Copyright (C) 1997-1998, Ghostgum Software Pty Ltd.  Tous droits r&#233;serv&#233;s.
 Copyright (C) 1998 pour la traduction fran&#231;aise, Cyrille Chevallet.
</PRE>
<P>Ce fichier fait partie de RedMon. 
<P>Ce programme est distribu&#233; SANS AUCUNE GARANTIE. Les auteurs et 
distributeurs n'assument aucune responsabilit&#233; pour les cons&#233;quences r&#233;sultant 
de son utilisation et n'assurent pas qu'il remplit une fonction particuli&#232;re ou 
simplement fonctionne, &#224; moins qu'ils ou elles ne le pr&#233;cisent par &#233;crit. Voir 
la RedMon Free Public Licence (la 'Licence') pour plus d'informations. 
<P>Chaque copie de RedMon doit contenir une copie de la Licence, classiquement 
sous la forme d'un fichier ASCII nomm&#233; LICENCE. La Licence vous 
donne le droit de copier, modifier et redistribuer RedMon, mais uniquement 
sous certaines conditions d&#233;crites dans la Licence. Entre autres, la Licence 
exige que les informations de copyright et cette note soient pr&#233;sentes sur toutes les copies. 
<P><PRE>
    Auteur : Russell Lang, Ghostgum Software Pty Ltd
  Internet : http://www.cs.wisc.edu/~ghost/rjl.html
</PRE>
<P>
<P>
<HR>
<H1><A NAME="473">Nouvelles fonctionnalit&#233;s</A></H1>
1. RedMon peut maintenant cr&#233;er lui-m&#234;me des travaux d'impression. 
Le second travail d'impression appartiendra &#224; la personne &#224; l'origine 
du premier. 
Le nom du document du second travail d'impression est le 
m&#234;me que le premier. 
Vous pouvez ex&#233;cuter un programme qui cr&#233;e un fichier temporaire 
et indiquer &#224; RedMon qu'il doit spouler ce fichier. 
Voir la rubrique d'aide <A HREF="#104">Copier le fichier temporaire vers l'imprimante</A>. 
<P>Vous pouvez ex&#233;cuter un programme qui &#233;crit sur le canal de sortie standard et 
indiquer &#224; RedMon qu'il doit imprimer la sortie standard.  Ceci ne fonctionne 
pas avec les versions actuelles de Ghostscript parce que vous ne pouvez pas 
emp&#234;cher simplement Ghostscript d'&#233;crire vers le 
stream %stdout PostScript. 
Voir la rubrique d'aide <A HREF="#96">Copier la sortie standard vers l'imprimante</A>. 
<P>2. <A HREF="#161">Ex&#233;cuter en tant qu'utilisateur</A> peut &#234;tre utilis&#233; pour ex&#233;cuter une application 
en tant que l'utilisateur local qui a soumis le travail d'impression. 
<P>3. Certaines <A HREF="#134">Variables d'environnement</A> sont d&#233;finies par RedMon pour 
permettre au programme de trouver qui a soumis le travail d'impression. 

<P><HR>Created automatically by doc2html
</BODY>
</HTML>
