<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>Ajuda del GSview</title>
</head>
<body>
<h1>Ajuda del GSview</h1>
<hr>
<h1><a name="Introducci&#243;">Introducci&#243;</a></h1>
El <b>GSview</b> &#233;s una interf&#237;cie gr&#224;fica per al Ghostscript sota l'MS-Windows, 
l'OS/2 o el GNU/Linux. 
El Ghostscript &#233;s un int&#232;rpret per al llenguatge de descripci&#243; de p&#224;gines PostScript 
que utilitzen les impressores l&#224;ser. 
Per als documents que segueixen les convencions d'estructura dels documents  
Adobe PostScript, el GSview permet visualitzar o imprimir-ne les p&#224;gines seleccionades. 
El GSview 4.4 necessita el Ghostscript 7.04 - 8.99. 
<p>
<a href="#Instal&#183laci&#243">Instal&#183laci&#243</a><br>
<a href="#Registre">Registre</a><br>
<a href="#Convencions_de_l'estructura_del_document">Convencions de l'estructura del document</a><br>
<a href="#Format_de_document_port&#224til_(PDF)">Format de document port&#224til (PDF)</a><br>
<a href="#Obertura_d'un_document">Obertura d'un document</a><br>
<a href="#Selecci&#243_de_la_p&#224gina">Selecci&#243 de la p&#224gina</a><br>
<a href="#Informaci&#243_del_document">Informaci&#243 del document</a><br>
<a href="#Impressi&#243">Impressi&#243</a><br>
<a href="#Conversions">Conversions</a><br>
<a href="#Measure">Measure</a><br>
<a href="#Options">Options</a><br>
<a href="#Page_Orientation">Page Orientation</a><br>
<a href="#Display_Settings">Display Settings</a><br>
<a href="#Page_Size">Page Size</a><br>
<a href="#Keys">Keys</a><br>
<a href="#Command_line_options">Command line options</a><br>
<a href="#World_Wide_Web">World Wide Web</a><br>
<a href="#Copyright">Copyright</a><br>
<a href="#Common_Problems">Common Problems</a><br>
<a href="#Other_Useful_Programs">Other Useful Programs</a><br>
<a href="#Other_Help_Topics">Other Help Topics</a><br>
<p>
<hr>
<h1><a name="Instal&#183;laci&#243;">Instal&#183;laci&#243;</a></h1>
Es recomana que utilitzeu el programa d'instal&#183;laci&#243; <b>setup.exe</b> 
per instal&#183;lar el GSview. 
Necessitareu instal&#183;lar el Ghostscript per separat. 
<p>Si voleu instal&#183;lar el GSview manualment, vegeu el tema  
<a href="#Instal·lació_manual">Instal&#183;laci&#243; manual</a>. 
<p>La configuraci&#243; es dur&#224; a terme el primer cop que s'executi el GSview. 
Si voleu canviar la configuraci&#243; m&#233;s tard, utilitzeu 
<b>Opcions</b> | <b>Configuraci&#243; f&#224;cil</b> o b&#233; 
<b>Opcions</b> | <b>Configuraci&#243; avan&#231;ada</b>. 
<p>Vegeu tamb&#233; <b>Opcions</b> | <b>Idioma</b>. 
<p>
<a href="#Obtenci&#243_del_Ghostscript">Obtenci&#243 del Ghostscript</a><br>
<a href="#Instal&#183laci&#243_del_Ghostscript">Instal&#183laci&#243 del Ghostscript</a><br>
<a href="#Desinstal&#183laci&#243_del_GSview">Desinstal&#183laci&#243 del GSview</a><br>
<a href="#Instal&#183laci&#243_manual">Instal&#183laci&#243 manual</a><br>
<a href="#Manual_avan&#231at_d&#146instal&#183laci&#243">Manual avan&#231at d&#146instal&#183laci&#243</a><br>
<a href="#Instal&#183laci&#243_de_xarxa">Instal&#183laci&#243 de xarxa</a><br>
<a href="#Execuci&#243_del_GSview_des_del_Gestor_de_fitxers_o_l'Explorador_del_Windows">Execuci&#243 del GSview des del Gestor de fitxers o l'Explorador del Windows</a><br>
<p>
<hr>
<h2><a name="Obtenci&#243;_del_Ghostscript">Obtenci&#243; del Ghostscript</a></h2>
El GSview necessita l'AFPL Ghostscript. El GSview i el Ghostscript 
estan disponibles per separat des de 
<pre>
 http://www.cs.wisc.edu/~ghost/
</pre>
<p>Per configurar el GSview, obtingueu i instal&#183;leu el Ghostscript 
i el GSview, llavors executeu el GSview. 
<p>
<p>
<hr>
<h2><a name="Instal&#183;laci&#243;_del_Ghostscript">Instal&#183;laci&#243; del Ghostscript</a></h2>
L'AFPL Ghostscript per al Win32 est&#224; disponible com un arxiu autoextra&#239;ble 
que s'instal&#183;la ell sol. 
Per a detalls sobre com obtenir manualment el Ghostscript, si us plau llegiu 
els fitxers de documentaci&#243; del Ghostscript Install.htm i Use.htm 
<p>
<p>
<hr>
<h2><a name="Desinstal&#183;laci&#243;_del_GSview">Desinstal&#183;laci&#243; del GSview</a></h2>
Per desinstal&#183;lar el GSview des del Windows 95 o l'NT 4.0, 
utilitzeu <b>Afegeix o suprimeix programes</b> des del <b>Tauler de control</b> del Windows. 
<p>
<a href="#Desinstal&#183laci&#243_manual">Desinstal&#183laci&#243 manual</a><br>
<p>
<hr>
<h3><a name="Desinstal&#183;laci&#243;_manual">Desinstal&#183;laci&#243; manual</a></h3>
Per desinstal&#183;lar el GSview, suprimiu els fitxers del directori <b>gsview </b>. 
Suprimiu tamb&#233; 
<pre>
 c:\windows\gsview32.ini
</pre>
<p>del directori del sistema apropiat. 
<p>Per al Windows NT potser tamb&#233; necessitareu suprimir el gsview32.ini 
dels directoris de perfils d'usuaris. 
<p>Suprimiu el grup <b>Ghostgum</b> del Gestor de grups o del Men&#250; d'inici 
<p>Si sabeu com editar el registre, suprimiu les seg&#252;ents claus: 
<pre>
 HKEY_CLASSES_ROOT\psfile
 HKEY_CLASSES_ROOT\.eps
 HKEY_CLASSES_ROOT\.ps
 HKEY_CLASSES_ROOT\MIME\Database\Content Type\application/postscript
</pre>
<p>Si vau associar els PDF amb el GSview tamb&#233; necessitareu suprimir 
<pre>
 HKEY_CLASSES_ROOT\pdffile
 HKEY_CLASSES_ROOT\.pdf
 HKEY_CLASSES_ROOT\MIME\Database\Content Type\application/pdf
</pre>
<p>El millor m&#232;tode de desinstal&#183;lar el Ghostscript &#233;s 
utilitzar l'<b>Afegeix o suprimeix programes</b> des del <b>Tauler de control</b> del Windows. 
<p>Per desinstal&#183;lar manualment el Ghostscript, suprimiu els fitxers del directori 
<b>gsN.NN</b>, on N.NN &#233;s el n&#250;mero de versi&#243; del Ghostscript. 
<p>
<p>
<hr>
<h2><a name="Instal&#183;laci&#243;_manual">Instal&#183;laci&#243; manual</a></h2>
Es recomana que utilitzeu el programa d&#146;instal&#183;laci&#243; per instal&#183;lar el 
GSview.  Les instruccions seg&#252;ents descriuen com instal&#183;lar el GSview 
sense utilitzar el programa d&#146;instal&#183;laci&#243;. 
<p>Definiu la variable d&#146;entorn TEMP perqu&#232; apunti a un directori per als 
fitxers temporals. Per exemple: 
<pre>
  SET TEMP=c:\temp
</pre>
<p>El directori ha d&#146;existir i ha d&#146;estar-hi permesa l&#146;escriptura. 
<p>Primer necessiteu instal&#183;lar el Ghostscript, m&#233;s els seus fitxers de biblioteca i fonts. 
Necessiteu la versi&#243; del Ghostscript que hi ha llistada a la <a href="#Introducció">Introducci&#243;</a>. 
Aquesta versi&#243; del GSview no funcionar&#224; amb d&#146;altres versions del Ghostscript. 
Instal&#183;leu el Ghostscript al directori c:\gs\gsN.NN 
(Reemplaceu N.NN per el n&#250;mero de la versi&#243; del Ghostscript.) 
<p>Creeu un directori c:\ghostgum\gsview 
<p>Despr&#233;s instal&#183;leu 
el GSview per al Windows copiant el gsview32.exe, gsv16spl.exe, gvwgs32.exe, 
gsvw32de.dll, gsvw32es.dll, gsvw32fr.dll, gsvw32it.dll, 
gsviewen.hlp, gsviewde.hlp, gsviewes.hlp, gsviewfr.hlp, gsviewit.hlp 
i el printer.ini 
al directori  <b>c:\ghostgum\gsview</b>. 
<p>Inicieu el GSview i seleccioneu la versi&#243; apropiada del Ghostscript 
(normalment l&#146;&#250;ltima). Per canviar-ho m&#233;s endavant, utilitzeu 
<b>Opcions</b> | <b>Configuraci&#243; f&#224;cil</b>. 
<p>Per a un major control sobre la instal&#183;laci&#243;, vegeu el <a href="#Manual_avançat_d’instal·lació">Manual avan&#231;at d&#146;instal&#183;laci&#243;</a>. 
<p>
<p>
<hr>
<h2><a name="Manual_avan&#231;at_d&#146;instal&#183;laci&#243;">Manual avan&#231;at d&#146;instal&#183;laci&#243;</a></h2>
En lloc d&#146;utilitzar <b>Opcions</b> | <b>Configuraci&#243; f&#224;cil</b>, utilitzeu 
<b>Opcions</b> | <b>Configuraci&#243; avan&#231;ada</b>. 
<p>Primer definiu correctament els tres camps de texts (vegeu <b>Configuraci&#243; avan&#231;ada</b>). 
<p>Al quadre de di&#224;leg <b>Configuraci&#243; avan&#231;ada</b>, seleccioneu els quadres de verificaci&#243; 
<b>Copia els par&#224;metres predeterminats de la impressora</b>, <b>Associa els fitxers .ps amb el GSview</b> i 
<b>Crea elements al men&#250; d&#146;inici</b>, o seguiu respectivament els seg&#252;ents tres passos. 
<p>1. Sortiu del GSview, i despr&#233;s afegiu el printer.ini al fitxer INI del GSview 
(c:\windows\gsview32.ini) 
<p>2. Afegiu els tipus de fitxer .ps i .eps (i opcionalment els .pdf) 
al <a href="#Execució_del_GSview_des_del_Gestor_de_fitxers_o_l'Explorador_del_Windows">Registre</a>. 
<p>3. Creeu un element al Gestor de programes o al men&#250; d&#146;inici per al GSview. 
<p>Si teniu alguns tipus de lletra Type 1 al sistema, &#233;s possible dir-li 
al Ghostscript que les utilitzi.  Vegeu <b>Fontmap.os2</b> i <b>Fontmap.atm</b> 
que es donen amb el Ghostscript per a exemples.  Vegeu el tema <b>Fonts</b>. 
<p>Si teniu problemes, proveu de llegir el tema d'ajuda <b>Problemes comuns</b>. 
<p>
<p>
<hr>
<h2><a name="Instal&#183;laci&#243;_de_xarxa">Instal&#183;laci&#243; de xarxa</a></h2>
Instal&#183;leu el GSview a un directori de la xarxa. 
<p>Quan un usuari inici&#239; el per primer cop, o inici&#239; el GSview 
despr&#233;s que el n&#250;mero de versi&#243; hagi canviat, el GSview configurar&#224; 
l'ordinador local. 
<p>L'&#250;s d'un directori UNC quan s'instal&#183;la el GSview no funciona 
des del Windows 3.1, per&#242; si des del Windows 95. 
<p>El GSview intenta mantenir un fitxer de configuraci&#243; per cada usuari. 
Si els perfils d'usuari s'estan utilitzant sota el Windows 95 o l'NT, 
el GSview emmagatzemar&#224; el fitxer INI al directori del perfil de l'usuari, 
tal i com s'indiqui al registre.  Si aquest no es pot trobar, 
i la variable d'entorn USERPROFILE s'ha definit i &#233;s un 
directori, el GSview emmagatzemar&#224; el fitxer INI a aquest directori. 
Si aix&#242; fall&#233;s, el GSview emmagatzemar&#224; el fitxer INI a la ubicaci&#243; 
predeterminada, el directori del Windows. 
Si el directori del perfil de l'usuari existeix, per&#242; hi t&#233; protegida l'escriptura, 
el GSview tindr&#224; un problema. 
<p>Si voleu que el GSview no us mostri la <b>Configuraci&#243; f&#224;cil</b> 
quan s'executa per primer cop, o sempre que s'actualitzi el GSview, 
situeu un fitxer INI al directori del GSview. 
<b>Recordeu suprimir aquest fitxer abans d'actualitzar el GSview en el futur.</b> 
Nom&#233;s hauria de contenir aquelles entrades que voleu sobreescriure 
a la configuraci&#243; dels usuaris. 
La t&#232;cnica que es suggereix &#233;s instal&#183;lar el GSview, i despr&#233;s configurar-lo. 
Copieu el gsview32.ini o el gvpm.ini del directori del sistema o del directori 
del perfil de l'usuari al directori del GSview, i despr&#233;s editeu-lo per 
suprimir totes les entrades excepte: 
<pre>
 [GSview-4.4]
 Version=4.4
 GSversion=800
 Configured=1
 GhostscriptDLL=e:\gs\gs8.00\bin\gsdll32.dll
 GhostscriptInclude=e:\gs\gs8.00\lib;e:\gs\fonts
 GhostscriptOther=-dNOPLATFONTS -sFONTPATH="c:\psfonts"
</pre>
<p>Quan un usuari inicia el GSview, normalment s'utilitza el seu fitxer INI. 
El primer cop que s'inicia el GSview, o quan la versi&#243; del GSview no 
coincideix amb el fitxer INI, passa el seg&#252;ent: 
<p>1. Es llegeix el fitxer INI al directori del GSview, tot substituint 
el fitxer INI dels usuaris. 
<p>2. S'actualitza la llista d'impressores al directori 
del GSview. 
<p>3. NO es fan o es canvien associacions dels fitxers (.ps, .eps, .pdf). 
Si les voleu canviar heu d'utilitzar <b>Opcions</b> | <b>Configuraci&#243; avan&#231;ada</b>. 
<p>4. NO es canvien els grups del Gestor de Programes / elements del men&#250; d'inici /  
dreceres del programa. 
Si els voleu canviar heu d'utilitzar <b>Opcions</b> | <b>Configuraci&#243; avan&#231;ada</b>. 
<p>Si l'esteu instal&#183;lant al Windows NT4/2000, i seleccioneu "Tots els usuaris", 
llavors l'instal&#183;lador escriur&#224; aquest gsview32.ini al directori del GSview. 
Heu de tenir instal&#183;lat el Ghostscript primer. 
<p>Quan un usuari intenta utilitzar el programa de desinstal&#183;laci&#243; del GSview,  
s'intenta suprimir els fitxers del GSview i del Ghostscript a la xarxa. 
Assegureu-vos que els directoris del GSview i del Ghostscript no poden ser escrits 
pels usuaris. 
Per a m&#233;s seguretat, podeu suprimir el fitxer <b>uninstal.txt</b> del directori 
del GSview. 
<p>Alternativament, si voleu instal&#183;lar el GSview a cada ordinador sense 
cap sol&#183;licitud, descomprimiu l'arxiu autoextra&#239;ble i despr&#233;s executeu 
el programa d'instal&#183;laci&#243; aix&#237;: 
<pre>
 setup -nom "El vostre nom" -numero XXXXX-XXXXX "c:\ghostgum"
</pre>
<p>
<p>
<hr>
<h2><a name="Execuci&#243;_del_GSview_des_del_Gestor_de_fitxers_o_l'Explorador_del_Windows">Execuci&#243; del GSview des del Gestor de fitxers o l'Explorador del Windows</a></h2>
Si heu utilitzat el programa setup.exe del GSview i heu contestat <b>s&#237;</b> a 
a totes les preguntes, la configuraci&#243; seg&#252;ent ja ha ocorregut. 
Si no vau actualitzar el registre durant la instal&#183;laci&#243; del GSview, 
la informaci&#243; seg&#252;ent us explica com fer-ho manualment. 
<p>Per executar el GSview quan es fa doble clic a un fitxer PostScript al 
Gestor de fitxers, s'ha de seguir la seq&#252;&#232;ncia seg&#252;ent per ensenyar-li 
al Gestor de fitxers quant als fitxers PostScript. 
<p>Des del <b>Gestor de programes</b>, executeu l'Editor d'informaci&#243; del registre 
<b>Fitxer </b>| <b>Executa...</b> i teclegeu <b>regedit</b>. 
Des de l'<b>Editor d'informaci&#243; del registre</b> seleccioneu <b>Edita </b>| <b>Afegeix un tipus de fitxer...</b> 
i introdu&#239;u els camps seg&#252;ents: 
<pre>
 Identificador = psfile
 Tipus de fitxer = PostScript
 Acci&#243; = Open
 Ordre = c:\ghostgum\gsview\gsview32 %1
 Utilitza DDE = Sense marcar
 Acci&#243; = Print
 Ordre = c:\ghostgum\gsview\gsview32 /p %1
 Utilitza DDE = Sense marcar
</pre>
<p>Llavors premeu <b>D'acord</b>. 
<p>Des del <b>Gestor de fitxers</b>, seleccioneu <b>Fitxer </b>| <b>Associa</b> i llavors 
introdu&#239;u els seg&#252;ents camps: 
<pre>
 Fitxers amb l'extensi&#243; = ps
 Associa amb = PostScript (gsview)
</pre>
<p>Desrp&#233;s premeu <b>D'acord</b>. 
<p>Ja est&#224;! Ara quan feu doble clic a un fitxer PostScript, 
el <b>Gestor de fitxers</b> executar&#224; el GSview.  Quan arrossegueu un fitxer  
PostScript al <b>Gestor d'impressi&#243;</b>, el GSview imprimir&#224; el fitxer. 
Si teniu una impressora PostScript, aix&#242; no us ser&#224; &#250;til. 
En aquest cas, haureu de suprimir l'acci&#243; Print 
del registre. 
<p>Per al Windows 95, la configuraci&#243; es fa amb l'Explorador 
del Windows. 
<p>Inicieu l'<b>Explorador del Windows</b>.  Seleccioneu <b>Visualitzaci&#243;</b> | <b>Opcions</b>.  Seleccioneu la 
pestanya <b>Tipus de fitxers</b>.  Seleccioneu el bot&#243; <b>Crea un tipus</b>. 
Introdu&#239;u els seg&#252;ents camps: 
<pre>
 Descripci&#243; del tipus = PostScript
 Extensi&#243; associada = PS EPS
</pre>
<p>Premeu el bot&#243; <b>Crea</b>, i introdu&#239;u 
<pre>
 Acci&#243; = open
 Aplicaci&#243; utilitzada per dur a terme l'acci&#243; = c:\ghostgum\gsview\gsview32.exe
</pre>
<p>Premeu el bot&#243; <b>D'acord</b> 
<p>Premeu el bot&#243; <b>Crea</b>, i introdu&#239;u 
<pre>
 Acci&#243; = print
 Aplicaci&#243; utilitzada per dur a terme l'acci&#243; = c:\ghostgum\gsview\gsview32.exe /p
</pre>
<p>Premeu el bot&#243; <b>D'acord.</b> 
<p>Premeu el bot&#243; <b>Tanca.</b> 
<p>Premeu el bot&#243; <b>Tanca.</b> 
<p>
<p>
<hr>
<h1><a name="Registre">Registre</a></h1>
Si voleu permetre el desenvolupament del GSview, o b&#233; voleu inhabilitar-ne 
la pantalla empipadora, si us plau, penseu el fet de registrar-lo. 
Tanmateix, no teniu cap necessitat de registrar el GSview. 
El GSview est&#224; disponible sota la Llic&#232;ncia P&#250;blica Gratu&#239;ta d'Aladdin (l'AFPL,  
Aladdin Free Public Licence), continguda al fixer <b>LICENCE</b>. 
Aix&#242; permet l'&#250;s gratu&#239;t, per&#242; en restringeix la distribuci&#243; comercial. 
<p>Ara mateix l'import del registre &#233;s de 40 AUD$. 
El GSview es pot registrar en l&#237;nia a 
<pre>
 http://www.ghostgum.com.au/
</pre>
<p>o enviant per fax o per correu el 
formulari de registre que podeu trobar al fitxer <b>regorder.txt</b> 
al directori del GSview. 
Ghostgum Software prefereix que utilitzeu el registre en l&#237;nia. 
<p>
<p>
<hr>
<h1><a name="Convencions_de_l'estructura_del_document">Convencions de l'estructura del document</a></h1>
Adobe ha definit un conjunt de convencions de comentaris esteses que donen 
informaci&#243; addicional quant a l'estructura de la p&#224;gina i els requeriments 
dels recursos d'un fitxer PostScript. 
Si un fitxer cont&#233; aquests comentaris de Convencions de l'estructura del document (DSC), 
el GSview pot visualitzar p&#224;gines en un ordre aleatori utilitzant <a href="#Selecció_de_la_pàgina">V&#233;s a la p&#224;gina</a> i 
p&#224;gines en ordre invers utilitzant <a href="#Selecció_de_la_pàgina">P&#224;gina anterior</a>. Les p&#224;gines seleccionades es poden 
extreure a un altre fitxer o imprimir-se. 
<p>Si un fitxer no cont&#233; comentaris DSC, el GSview nom&#233;s pot visualitzar-ne p&#224;gines 
en l'ordre original. 
<p>Els fitxers conformes amb els DSC s'inicien amb la l&#237;nia de comentari: 
<pre>
 %!PS-Adobe-3.0
</pre>
<p>on el n&#250;mero 3.0 pot canviar i &#233;s el n&#250;mero de la versi&#243; dels DSC. 
Alguns programes escriuen fitxers PostScript amb un control-D com a primer 
car&#224;cter del fitxer, seguit de la l&#237;nia de comentari anteriorment esmentada. 
El GSview informar&#224; correctament qu&#232; aquests fitxers no s&#243;n conformes amb els DSC, 
per&#242; tot i aix&#237; els visualitzar&#224; amb les caracter&#237;stiques de selecci&#243; de p&#224;gina disponibles. 
Queixeu-vos a l'autor del programa que va fer el fitxer PostScript. 
Per fer el fitxer conforme amb els DSC, editeu-lo i suprimiu-ne el car&#224;cter control-D. 
<p>Els fitxers conformes amb els DSC contenen l&#237;nies com: 
<pre>
 %%Pages: 24
 %%Page: 1 1
</pre>
<p>Aquestes l&#237;nies diuen al GSview quantes p&#224;gines cont&#233; un document i 
on comencen. El GSview utilitza aquesta informaci&#243; per seleccionar p&#224;gines 
individuals. 
<p>Els fitxers PostScript encapsulats (EPSF) s&#243;n documents d'una sola p&#224;gina 
que contenen un subconjunt dels comentaris <b>DSC</b> i ordres PostScript. 
Els fitxers EPS s'inicien amb la seg&#252;ent l&#237;nia de comentari: 
<pre>
 %!PS-Adobe-3.0 EPSF-3.0
</pre>
<p>Els fitxers EPS s'utilitzen principalment com a inclusions en d'altres documents 
i per aquesta ra&#243; requereixen el comentari del requadre del l&#237;mit: 
<pre>
  %%BoundingBox: llx lly urx ury
</pre>
<p>on llx, lly, urx i ury s&#243;n enters que donen les coordenades x i y 
de les cantonades inferior esquerra i superior dreta d'un requadre del l&#237;mit que  
tanca tots els elements de la p&#224;gina. 
<p>Alguns fitxers EPS contenen una visualitzaci&#243; pr&#232;via del document PostScript. 
Aquesta visualitzaci&#243; pot ser un metafitxer del Windows, un fitxer TIFF, o una visualitzaci&#243; 
pr&#232;via d'intercanvi (format EPSI). 
Per als metafitxers del Windows o els fitxers de visualitzaci&#243; pr&#232;via TIFF, el fitxer EPS 
sota el DOS cont&#233; una cap&#231;alera bin&#224;ria que indica la ubicaci&#243; i longitud de la visualitzaci&#243; 
pr&#232;via i les seccions de llenguatge PostScript del fitxer EPS. 
Per al format d'intercanvi, la visualitzaci&#243; pr&#232;via est&#224; continguda als comentaris DSC 
que comencen per 
<pre>
 %%BeginPreview: amplada al&#231;ada profunditat l&#237;nies
</pre>
<p>Un fitxer EPS amb visualitzaci&#243; pr&#232;via es pot crear des d'un fitxer EPS sense 
visualitzaci&#243; pr&#232;via tot utilitzant <b>Afegeix una visualitzaci&#243; pr&#232;via EPS</b>. 
<p>El GSview pot donar avisos quan els documents contenen comentaris DSC 
incorrectes.  Aix&#242; es pot canviar amb <b>Opcions</b> | <b>Avisos DSC</b>. 
<p>
<p>
<hr>
<h1><a name="Format_de_document_port&#224;til_(PDF)">Format de document port&#224;til (PDF)</a></h1>
El GSview pot visualitzar i imprimir fitxers PDF, tot i que hi ha un seguit de 
limitacions amb el m&#232;tode actual. 
<p>Quan s'est&#224; visualitzant, el GSview ignora la mida de la p&#224;gina del men&#250; Suport, 
i en el seu lloc utilitza el /MediaBox del fitxer PDF. 
Si s'habilita el <b>Opcions</b> | <b>Retalla els EPS</b>, el GSview utilitzar&#224; el /CropBox 
del fitxer PDF. 
<p>El GSview necessita que feu <a href="#Obertura_d'un_document">Obre</a> un fitxer PDF per comptar-ne les p&#224;gines. Si 
feu <b>Selecciona</b> un fitxer, el GSview no ser&#224; capa&#231; de fer <b>Extreu el text</b>, 
<b>Cerca</b>, <a href="#Selecció_de_la_pàgina">V&#233;s a la p&#224;gina</a> o realitzar qualsevol altre operaci&#243; que necessiti 
saber quantes p&#224;gines hi ha al document. 
<p>La compatibilitat amb els enlla&#231;os pdfmark no &#233;s completa. 
<p>Per convertir un fitxer PostScript a un de PDF, utilitzeu <a href="#Obertura_d'un_document">Fitxer</a> | <b>Converteix</b>, 
i despr&#233;s seleccioneu el dispositiu <b>pdfwrite</b>. 
<p>Per convertir un fitxer PDF a un de PostScript, utilitzeu <a href="#Obertura_d'un_document">Fitxer</a> | <b>Converteix</b>, 
i despr&#233;s seleccioneu el dispositiu <b>pswrite</b>. 
<p><a href="#Obertura_d'un_document">Fitxer</a> | <b>Extreu</b> no funciona pels fitxers PDF. 
L'extracci&#243; de p&#224;gines PDF extreu m&#233;s aviat PostScript que no pas PDF. 
<p><p>Per convertir massivament diversos fitxers, mireu a 
ps2pdf.bat i pdf2ps.bat 
al directori del Ghostscript. 
Necessitareu utilitzar 
gswin32c.exe 
en lloc del gs.exe.  Tamb&#233; necessitareu definir el directori d'inclusi&#243;  
del Ghostscript utilitzant <b>-I</b> o la variable d'entorn <b>GS_LIB</b>. 
<p>
<p>
<hr>
<h1><a name="Obertura_d'un_document">Obertura d'un document</a></h1>
L'ordre <b>Obre</b> al men&#250; <b>Fitxer</b> obre un fitxer i en visualitza 
la primera p&#224;gina. 
<p>Si el fitxer cont&#233; comentaris <a href="#Convencions_de_l'estructura_del_document">DSC</a>, les p&#224;gines es poden seleccionar utilitzant 
<a href="#Selecció_de_la_pàgina">P&#224;gina seg&#252;ent</a>, <a href="#Selecció_de_la_pàgina">P&#224;gina anterior</a> i <a href="#Selecció_de_la_pàgina">V&#233;s a la p&#224;gina</a>. 
<p>Si el fitxer no cont&#233; comentaris <a href="#Convencions_de_l'estructura_del_document">DSC</a>, <a href="#Selecció_de_la_pàgina">P&#224;gina anterior</a> i <a href="#Selecció_de_la_pàgina">V&#233;s a la p&#224;gina</a> 
no funcionaran. No s'hauria de seleccionar un altre fitxer fins que es visualitzi 
l'&#250;ltima p&#224;gina del document. 
<p>Quan s'obre un fitxer, el GSview en visualitza el nom del fitxer, 
la p&#224;gina actual (si est&#224; disponible) i mentre el cursor &#233;s sobre la imatge, 
la ubicaci&#243; del cursor en les coordenades que s'han indicat 
a <b>Opcions</b> | <b>Unitats</b>.  Les coordenades poden ser punts del PostScript 
(1/72"), mil&#183;l&#237;metres o polzades. 
La ubicaci&#243; del cursor &#233;s &#250;til per calcular els requadres del l&#237;mit. 
<p>L'ordre <b>Selecciona un fitxer</b> &#233;s similar a <b>Obre</b> per&#242; aquesta no visualitza 
el document. 
Aquesta ordre &#233;s &#250;til per obrir documents abans d'imprimir-los. 
<p>L'ordre <b>Anomena i desa</b> desa una c&#242;pia del document actual. 
Aix&#242; &#233;s &#250;til si s'est&#224; utilitzant el GSview com a visualitzador de PostScript per 
altres aplicacions i voleu desar el fitxer que s'est&#224; visualitzant actualment. 
<p>L'ordre <b>Tanca</b> tanca el document obert actualment. 
Aix&#242; s'haur&#224; d'utilitzar abans que un altre programa canvi&#239; el fitxer 
actual. 
Si no voleu fer-ho i el GSview detecta que la mida o la data del fitxer 
han canviat, es tancar&#224; el Ghostscript i es tornar&#224; a escannejar el document. 
<p>Vegeu tamb&#233; <a href="#Impressió">Imprimeix</a>. 
<p>
<p>
<hr>
<h1><a name="Selecci&#243;_de_la_p&#224;gina">Selecci&#243; de la p&#224;gina</a></h1>
<b>Visualitza</b> | <b>P&#224;gina seg&#252;ent</b> o el bot&#243; <b>+</b> mouen el document una 
p&#224;gina endavant. 
Aix&#242; funciona fins i tot si el document no t&#233; comentaris <a href="#Convencions_de_l'estructura_del_document">DSC</a>. 
<p><b>Visualitza</b> | <b>P&#224;gina anterior</b> o el bot&#243; <b>-</b> mouen el document una p&#224;gina endarrere. 
<p><b>Visualitza</b> | <b>Torna a dibuixar</b> o la tecla <b>F5</b> tornen a visualitzar i dibuixar la p&#224;gina actual. 
<p><b>Visualitza</b> | <b>V&#233;s a la p&#224;gina</b> o el bot&#243; de la <b>m&#224; que apunta</b> mostra un quadre de di&#224;leg 
que us permet seleccionar el n&#250;mero de la seg&#252;ent p&#224;gina a mostrar. 
El quadre di&#224;leg <b>Selecciona la p&#224;gina</b> mostra les etiquetes de les p&#224;gines perqu&#232; acostumen a 
ser m&#233;s &#250;tils que una numeraci&#243; de p&#224;gines seq&#252;encial. 
<p><b>Visualitza</b> | <b>P&#224;gina seg&#252;ent i inicial</b> o la barra d'espai mouen el document a la part superior 
de la p&#224;gina seg&#252;ent. 
<p><b>Visualitza</b> | <b>P&#224;gina anterior i inicial</b> o la tecla de retroc&#233;s mouen el document 
a la part superior de la p&#224;gina anterior. 
<p>Les ordres <b>P&#224;gina anterior</b>, <b>Torna a dibuixar</b> i <b>V&#233;s a la p&#224;gina</b> nom&#233;s funcionen si el 
document cont&#233; comentaris <a href="#Convencions_de_l'estructura_del_document">DSC</a>. 
<p><b>Visualitza</b> | <b>Ajusta la finestra</b> o la tecla <b>F6</b> canvien la resoluci&#243; de visualitzaci&#243; 
per ajustar la p&#224;gina sencera a la finestra actual. L'&#250;s repetit 
fa que tant l'amplada com l'al&#231;ada de la p&#224;gina s'ajustin a la finestra 
actual. 
<p><b>Visualitza</b> | <b>Pantalla completa</b> o la tecla <b>F4</b> visualitzen la p&#224;gina a pantalla completa 
(sense la barra del t&#237;tol, les barres de despla&#231;ament, etc.). 
Per tornar a la visualitzaci&#243; normal, premeu la tecla d'escapada. 
<p>
<p>
<hr>
<h1><a name="Informaci&#243;_del_document">Informaci&#243; del document</a></h1>
S'utilitza una &#224;rea d'informaci&#243; breu a la part superior de la finestra del 
GSview per visualitzar el nom de fitxer del document, el n&#250;mero i etiqueta de la p&#224;gina 
actual (si est&#224; disponible) i mentre el cursor &#233;s sobre la imatge, la ubicaci&#243; del cursor 
(relativa a la cantonada inferior esquerra del paper)  
amb les coordenades que s'han especificat a <b>Opcions</b> | <b>Unitats</b>. 
La ubicaci&#243; del cursor &#233;s &#250;til per calcular els requadres del l&#237;mit. 
<p>L'ordre <b>Informaci&#243;</b> al men&#250; <b>Fitxer </b> mostra un quadre de di&#224;leg amb la informaci&#243; 
seg&#252;ent quant als comentaris <a href="#Convencions_de_l'estructura_del_document">DSC</a> al document actual. 
<p>El <b>Fitxer </b>&#233;s el nom del cam&#237; del document complet. 
<p>El <b>Tipus</b> pot ser<b> DSC</b>,<b> EPS</b>, <b>Sense comentaris DSC</b> o <b>S'estan ignorant els comentaris DSC</b>. 
L'<a href="#Convencions_de_l'estructura_del_document">EPS</a> &#233;s un fitxer PostScript encapsulat - un document d'una sola p&#224;gina 
que cont&#233; un subconjunt de comentaris <a href="#Convencions_de_l'estructura_del_document">DSC</a> i d'ordres PostScript. 
Els fitxers <b>EPS </b>s'utilitzen normalment com inclusions a d'altres documents. 
<b>S'estan ignorant els comentaris DSC</b> es mostra si se selecciona <b>Opcions</b> | <b>Ignora els DSC</b>. 
Aquests poden tenir el prefixe <b>Ctrl-D seguit de</b> o <b>PJL seguit de</b>. 
Els dos indiquen que el document no compleix amb els DSC 
perqu&#232; hi ha brossa al principi del document. 
Per arreglar el primer, vegeu <b>Problemes comuns</b>. 
Per arreglar el segon, no utilitzeu un controlador HP LaserJet quan creeu 
documents PostScript per a distribuir als altres. 
<p>El <b>T&#237;tol</b> &#233;s un text que es pot utilitzar quan s'imprimeixen p&#224;gines 
i per escannejar i recon&#232;ixer documents. 
<p>La <b>Data</b> &#233;s la data de quan es va crear el document. 
<p>El <b>Requadre del l&#237;mit</b> delimita un requadre que tanca tots els elements pintats 
a la p&#224;gina.  Els quatre valors enters s&#243;n coordenades de les cantonades 
inferior esquerra i superior dreta del requadre del l&#237;mit en les coordenades 
predeterminades de l'usuari (1/72 polzades). 
<p>L'<b>Orientaci&#243; </b>&#233;s la orientaci&#243; predeterminada de la p&#224;gina i pot ser tant 
<b>Horitzontal </b>com<b> Vertical</b>.  Vegeu el men&#250; <b>Orientaci&#243;</b>. 
<p>L'<b>Ordre de p&#224;gines</b> pot ser tant <b>Ascendent</b>, <b>Descendent</b> com <b>Especial</b>. 
Si l'<b>Ordre de p&#224;gines</b> &#233;s <b>Descendent</b>, el GSview inverteix autom&#224;ticament 
les p&#224;gines quan s'est&#224; visualitzant, o quan s'est&#224; imprimint de manera que apareixen en ordre ascendent.   
Quan s'extreu o s'imprimeix, el GSview pot rebre instruccions 
d'imprimir les p&#224;gines en ordre descendent (invers). 
<b>Especial</b> significa que les p&#224;gines no s'han de tornar a ordenar. 
<p>El <b>Suport predeterminat</b> d&#243;na el nom del suport seguit de l'amplada i l'al&#231;ada 
d'aquest suport en les coordenades predeterminades de l'usuari (1/72 polzades). 
<p>Les <b>P&#224;gines</b> s&#243;n el n&#250;mero total de p&#224;gines del document. 
<p>La <b>P&#224;gina</b> d&#243;na l'etiqueta i el n&#250;mero de la p&#224;gina. 
<p>El <b>Mapa de bits </b>&#233;s la mida del mapa de bits que es visualitza, cosa que pot ser 
&#250;til si copieu al porta-retalls la imatge que es visualitza. 
<p>
<p>
<hr>
<h1><a name="Impressi&#243;">Impressi&#243;</a></h1>
L'ordre <b>Imprimeix</b> del men&#250; <b>Fitxer </b> permet la impressi&#243; del document 
tot utilitzant el Ghostscript.  Hi ha tres m&#232;todes que utilitza el GSview per 
imprimir: <a href="#Impressora_Windows_GDI">Impressora Windows GDI</a>, <b>Dispositiu Ghostscript</b> 
o <b>Impressora PostScript</b>. 
<p><a href="#Impressora_Windows_GDI">Impressora Windows GDI</a> utilitza el Ghostscript per crear mapes de bits per 
cada p&#224;gina, i les imprimeix fent &#250;s del dispositiu est&#224;ndard del Windows. 
Aquest &#233;s el m&#232;tode m&#233;s lent, per&#242; hauria de funcionar amb la majoria d'impressores. 
<p><b>Dispositiu Ghostscript</b> utilitza els dispositius d'impressores del Ghostscript. 
Aquest &#233;s m&#233;s r&#224;pid, per&#242; necessiteu que el Ghostscript tingui un controlador de 
la vostra impressora i necessiteu saber com es diu. 
Per exemple, l'HP LaserJet 4 utilitza el ljet4. 
Vegeu la documentaci&#243; del Ghostscript per a m&#233;s detalls. 
<p><b>Impressora PostScript</b> no utilitza el Ghostscript per imprimir els fitxers 
PostScript. En lloc d'aix&#242;, s'envia el fitxer directament a la impressora. 
<p>Hi ha una quantitat significativa d'interacci&#243; entre els par&#224;metres 
al quadre de di&#224;leg d'impressi&#243;. Per exemple, seleccionar <b>Dispositiu </b> 
inhabilita el bot&#243; <b>Propietats </b> perqu&#232; no &#233;s rellevant. 
Hi ha m&#233;s detalls als temes seg&#252;ents. 
<p>Vegeu tamb&#233; <a href="#Conversions">Conversions</a> i <b>Converteix</b>. 
<p>
<a href="#Selecci&#243_de_p&#224gines">Selecci&#243 de p&#224gines</a><br>
<a href="#Impressora_Windows_GDI">Impressora Windows GDI</a><br>
<a href="#Ghostscript_device">Ghostscript device</a><br>
<a href="#PostScript_printer">PostScript printer</a><br>
<a href="#Print_File">Print File</a><br>
<a href="#Properties">Properties</a><br>
<a href="#Page_Size_Matching">Page Size Matching</a><br>
<p>
<hr>
<h2><a name="Selecci&#243;_de_p&#224;gines">Selecci&#243; de p&#224;gines</a></h2>
Quan s'imprimeix, es pot seleccionar un rang de p&#224;gines. 
Dins aquest rang, podeu seleccionar totes les p&#224;gines o les p&#224;gines parelles o imparelles. 
Si seleccioneu p&#224;gines imparelles al rang de 10 a 20, la primera p&#224;gina que s'imprimir&#224; 
ser&#224; la 11. 
<p>El bot&#243; <b>Selecciona</b> es pot inhabilitar si no &#233;s compatible amb el m&#232;tode d'impressi&#243;. 
<p>El quadre de verificaci&#243; <b>Inverteix</b> fa que les p&#224;gines s'imprimeixin en 
ordre descendent. Aix&#242; s'habilita &#250;nicament si el document cont&#233; comentaris <a href="#Convencions_de_l'estructura_del_document">DSC</a>. 
<p>Si voleu imprimir les p&#224;gines des d'un document <a href="#Convencions_de_l'estructura_del_document">DSC</a> que tingui un ordre de p&#224;gines 
especial (per exemple, que les p&#224;gines no es puguin tornar a ordenar), 
seleccioneu la <a href="#Impressora_Windows_GDI">Impressora Windows GDI</a> i <b>Ignora els DSC</b>. 
<p>
<p>
<hr>
<h2><a name="Impressora_Windows_GDI">Impressora Windows GDI</a></h2>
Utilitza el Ghostscript per crear un mapa de bits per a cada p&#224;gina, i 
aquests s'imprimeixen tot utilitzant el dispositiu est&#224;ndard d'impressi&#243; del Windows. 
Hauria de funcionar amb totes les impressores que s&#243;n compatibles amb l'impressi&#243; de gr&#224;fics. 
<p>Per defecte, s'utilitza un mapa de bits monocrom per a una m&#224;xima velocitat. 
Si voleu color, necessitareu habilitar-ho utilitzant el bot&#243; <b>Par&#224;metres </b>. 
<p>Per controlar com gestiona les sol&#183;licituts de canvi de mida de la p&#224;gina  
per als documents PostScript o PDF el GSview, vegeu el tema 
<b>Ajust de la mida de la p&#224;gina</b>. 
<p>Les <b>Opcions </b>normalment s&#243;n buides, per&#242; poden contenir opcions en l&#237;nies d'ordres. 
Utilitzeu-ho amb cura! 
<p>Aquest m&#232;tode d'impressi&#243; permet imprimir les p&#224;gines seleccionades, fins i tot si 
un document PostScript no cont&#233; comentaris <a href="#Convencions_de_l'estructura_del_document">DSC</a>.  Ho fa 
mitjan&#231;ant la representaci&#243; de totes les p&#224;gines, per&#242; nom&#233;s enviant a la impressora les que se sol&#183;liciten. 
Podria ser molt lent. 
<p>
<p>
<hr>
<h2><a name="Ghostscript_device">Ghostscript device</a></h2>
The <b>Select Ghostscript Device</b> dialog box allows selection of 
the Ghostscript printer device and resolution. 
The default list of available devices and resolutions is stored 
in the [Devices] section of gsview32.ini and is taken from the 
standard distribution version of Ghostscript 6.0. 
You can use other devices or resolutions. 
<p>To control how GSview handles requests by the PostScript or 
PDF documents to change the page size, see the 
<a href="#Page_Size_Matching">Page Size Matching</a> topic. 
<p>Some Ghostscript options may be added using either the<b> Options</b> 
field or the <a href="#Properties">Properties</a> button. 
<p>The <b>uniprint</b> button selects the uniprint device and displays a list 
of available configuration files (*.upp) for the uniprint device. 
If you select one of these configuration files, the configuration file 
name will be placed in the <b>Options </b>field of the Printer Setup. 
See the Ghostscript file <b>Devices.htm</b> for details of how to configure 
the uniprint device. 
<p>
<p>
<hr>
<h2><a name="PostScript_printer">PostScript printer</a></h2>
If <b>PostScript Printer</b> is selected, the selected pages will be 
sent direct to the printer queue, without using Ghostscript. 
This is similar to <b>File </b>| <a href="#Print_File">Print File</a>, except that you can specify 
which pages to print. 
<p>When a PostScript printer is connected via a serial port, it sometimes 
requires a Ctrl+D character to be sent after the PostScript file, 
and depending on how well behaved other programs are, sometimes before. 
This is part of the serial communications protocol used by these 
printers - it is not part of PostScript. 
The <b>Settings </b>dialog allows you can choose to 
send Ctrl+D before and/or after the PostScript file. 
<p>Some PostScript printers understand multiple languages, and 
require a prolog to enable the PostScript mode. 
For example, HP LaserJet printers (with the PostScript option) 
require the following prolog 
<pre>
 ^[%-12345X@PJL JOB
 @PJL ENTER LANGUAGE = POSTSCRIPT
</pre>
<p>and the following epilog 
<pre>
 ^[%-12345X@PJL EOJ
 ^[%12345X
</pre>
<p>The prolog and epilog files allow you to send a file to the 
printer before and after the PostScript file. 
<p>Another use of the prolog might be to invoke duplex printing 
<pre>
 &lt;&lt; /Duplex true /Tumble false &gt;&gt; setpagedevice
</pre>
<p>If the document is <a href="#Format_de_document_portàtil_(PDF)">PDF</a>, Ghostscript will be used to convert 
the document to PostScript which will then be sent to the printer. 
<p>
<p>
<hr>
<h2><a name="Print_File">Print File</a></h2>
<b>File | Print File</b> sends a file to a local port, bypassing the 
Windows printer drivers. 
This is useful for sending a document to a PostScript printer, 
or for sending an output file produced by Ghostscript to a printer. 
<p>All pages, individual pages or any combination may be printed. 
The <b>All</b>, <b>Odd</b> and <b>Even</b> buttons provide quick selection of pages. 
If a single contiguous block of pages is marked, the <b>Odd</b> and <b>Even</b> 
buttons will select odd or even pages within this range. 
The <b>Reverse</b> check box causes the pages to be printed in 
descending order. 
<p><p>
<p>
<hr>
<h2><a name="Properties">Properties</a></h2>
The <b>Properties</b> button allows some Ghostcript devices to configure 
extra properties and a page offset to be specified. 
<p>A page offset can be specified for each device. 
The page offset is useful for correcting a mismatch between the page 
origin of a Ghostscript printer device and a particular printer. 
Increasing the X value will translate the image towards the right. 
Increasing the Y value will usually translate the image downwards. 
<p><b>Properties</b> are typically used to set BitsPerPixel for a colour 
printer, or other types of colour or density correction, 
or PDF distiller parameters. 
<p><b>Properties</b> are specific to a particular device.  Changing 
the value of the <b>BitsPerPixel</b> property on one device does not 
change it for any other device. 
<p>When you press the <b>OK</b> button in the <b>Properties</b> dialog 
box, the current settings are written to the 
gsview32.ini 
<p>file. 
<p>Some <b>Properties</b> are predefined in GSview, but these may not 
match those available in Ghostscript.  The <b>Edit </b>and <b>New</b> 
buttons allow you to modify available <b>Properties</b> for that device. 
See the <a href="#Edit_Properties">Edit Properties</a> topic for more details. 
<p>
<a href="#Edit_Properties">Edit Properties</a><br>
<p>
<hr>
<h3><a name="Edit_Properties">Edit Properties</a></h3>
Not every device supports the use of optional <a href="#Properties">Properties</a>.  To find 
out which devices support <a href="#Properties">Properties</a> and which <a href="#Properties">Properties</a> are 
recognised by each device, read the Ghostscript 
file Devices.htm or look at the Ghostscript source code. 
<p>There are two ways to add or edit <a href="#Properties">Properties</a>. 
<p>The first method uses the <b>Edit </b>or <b>New</b> button on the <a href="#Properties">Properties</a> 
dialog box. 
<p>Each property must be either a number or a string.  Number properties 
are equivalent to the Ghostscript <b>-d</b> command line option.  String 
properties are equivalent to the Ghostscript <b>-s</b> command line option. 
Each property consists of a <b>Name</b> and <b>Value</b>.  These are used as 
<b>-dNAME=VALUE</b> or <b>-sNAME=VALUE</b>. 
The <b>Value</b> is chosen from the comma separated list of <b>Values</b> 
entered into the <b>Edit Properties</b> dialog box.  Spaces must not 
be embedded in the <b>Name</b> or <b>Values</b>. 
<p>To delete a property, select it on the <a href="#Properties">Properties</a> dialog box, 
then press<b> Edit</b>, then press the <b>Delete</b> button on the <b>Edit Properties</b> 
dialog box. 
<p>The second method is to manually edit the GSview INI file. 
<p>For each device, you must add two sections to the 
gsview32.ini 
file. 
The following example shows how to add property information 
for the cdjcolor driver. 
First add a section which gives the current values. 
This section, after the first character is removed, gives the options 
that will appear in the <b>Property</b> list box. 
The first character is <b>s</b> for string or <b>d</b> for number. 
<pre>
 [cdjcolor]
 dBitsPerPixel=24
 dDepletion=1
 dShingling=2
 dBlackCorrect=4
</pre>
<p>Next add a section which gives the values to display in the 
<b>Value</b> list box. 
<pre>
 [cdjcolor values]
 dBitsPerPixel=1,3,8,16,24
 dDepletion=1,2,3
 dShingling=0,1,2
 dBlackCorrect=0,1,2,3,4,5,6,7,8,9
</pre>
<p>GSview will also add the value <b>[Not defined]</b> to the listbox. 
<p>When GSview prints a file, it will give Ghostscript the contents 
of the [cdjcolor] section of 
gsview32.ini 
as follows: 
<pre>
 -dBitsPerPixel=24 -dDepletion=1 -dShingling=2 -dBlackCorrect=4
</pre>
<p>If the value of a property is <b>[Not defined]</b>, that property will 
not be sent to Ghostscript. 
<p>
<p>
<hr>
<h2><a name="Page_Size_Matching">Page Size Matching</a></h2>
If <b>Fixed Page Size</b> is selected (the default), GSview will use the 
page size on the Media menu and will ignore attempts by PostScript 
or PDF documents to change the page size. 
This is useful for PDF files that contain a mix of portrait and 
landscape pages. 
<p>If <b>Shrink to fit Page Size</b> is selected, any page size selected 
by the document that is larger than the selected media will 
be shrunk to fit the page size on the Media menu. 
This is useful if you want to print an A4 sized page on 
letter paper (although a better idea is to buy A4 paper). 
<p>If <b>Variable Page Size</b> GSview will set the default page 
size from the Media menu, but allow the page size to be changed. 
<p>
<p>
<hr>
<h1><a name="Conversions">Conversions</a></h1>
There are several ways to convert PostScript and PDF files. 
<p><b>File </b>| <a href="#Convert">Convert</a> uses Ghostscript to convert PostScript or 
PDF to bitmaps, PostScript or PDF. 
<p><b>File </b>| <a href="#Extract">Extract</a> allows a range of pages to be copied from 
a PostScript document. 
<p><b>File </b>| <a href="#PS_to_EPS">PS to EPS</a> allows the bounding box to be updated and 
allows the header to be changed from PS to EPS. 
Read the documentation thoroughly before using this. 
<p><b>Edit </b>| <a href="#EPS_Preview">Add EPS Preview</a> adds a bitmap preview to an EPS 
file. 
<p><b>Edit </b>| <a href="#EPS_Preview">Extract EPS</a> extracts the PostScript or Preview 
from a DOS EPS file. 
<p><b>Edit </b>| <a href="#Convert_to_vector_format">Convert to vector format</a> uses pstoedit to convert 
PostScript or PDF to an editable vector format. 
<p><b>Edit </b>| <a href="#Text_Extract_and_Find">Text Extract</a> uses pstotext to extract text from 
a PostScript or PDF document. 
<p><b>Edit </b>| <a href="#Clipboard">Copy</a> copies the display bitmap to the clipboard. 
<b>Edit </b>| <a href="#Clipboard">Paste To</a> copies a clipboard DIB bitmap to a file. 
<b>Edit </b>| <a href="#Clipboard">Convert Bitmap</a> converts a clipboard DIB bitmap 
to a clipboard device dependent bitmap. 
<p>
<a href="#File_conversions_and_tricks">File conversions and tricks</a><br>
<a href="#Convert">Convert</a><br>
<a href="#Extract">Extract</a><br>
<a href="#PS_to_EPS">PS to EPS</a><br>
<a href="#EPS_Preview">EPS Preview</a><br>
<a href="#User_Supplied_Preview">User Supplied Preview</a><br>
<a href="#Convert_to_vector_format">Convert to vector format</a><br>
<a href="#Text_Extract_and_Find">Text Extract and Find</a><br>
<a href="#Clipboard">Clipboard</a><br>
<p>
<hr>
<h2><a name="File_conversions_and_tricks">File conversions and tricks</a></h2>
Some common file conversions that can be performed 
using GSview and Ghostscript are: 
<p>Convert PostScript to PDF. 
File | <a href="#Convert">Convert</a>, select pdfwrite, 300dpi, 
With Ghostscript 5.50, fonts with non-standard encodings 
will be included as bitmaps.  If you choose 72dpi, fonts 
will look rough.  Ghostscript 6.0 will embed fonts. 
<p>Convert PDF to PostScript. 
File | <a href="#Convert">Convert</a>, select pswrite, 300dpi. 
<p>Convert Level 2 PostScript to Level 1 PostScript. 
File | <a href="#Convert">Convert</a>, select psmono, 300dpi, 
Instead of 300dpi, you should use the resolution of your 
printer. 
<p>Convert to a bitmap. 
File | <a href="#Convert">Convert</a>, select bmp16m, 72dpi. 
<p>Convert to an editable vector format (pstoedit). 
Edit | <a href="#Convert_to_vector_format">Convert to vector format</a> OR convert to PDF 
using the method above. 
<p>Extract text (pstotext). 
Edit | <a href="#Text_Extract_and_Find">Text Extract</a> 
<p>Add a preview to an EPS file. 
Edit | <a href="#EPS_Preview">Add EPS Preview</a>.   See <a href="#EPS_Preview">Add EPS Preview</a> for 
more details. 
<p>Remove preview from an EPS file. 
Edit | <a href="#EPS_Preview">Extract EPS</a> | PostScript 
<p>Display with smooth edges. 
Media | <a href="#Display_Settings">Display Settings</a>.  Set <b>Text Alpha</b> and 
<b>Graphics Alpha</b> to 4.  You need a display with 
at least 8 bits per pixel. 
<p>Save the displayed bitmap. 
Edit | <a href="#Clipboard">Copy</a> to copy to the clipboard. 
To save to a BMP file, use Edit | <a href="#Clipboard">Copy</a> then <a href="#Clipboard">Paste To</a>... 
<p>Create a bitmap with smooth edges (anti-aliasing). 
1. Display with smooth edges and save the display bitmap. 
OR 
2. 
<a href="#Convert">Convert</a> using a bitmap device and set the following 
in the properties. 
<pre>
   -dTextAlphaBits=4 -dGraphicsAlphaBits=4
</pre>
<p>
<p>
<hr>
<h2><a name="Convert">Convert</a></h2>
<b>File </b>| <b>Convert</b> uses Ghostscript to convert PostScript or PDF 
to bitmaps, PostScript or PDF. 
<p>You need to select a Ghostscript output device and resolution. 
The default list of available devices and resolutions is stored 
in the [Convert] section of 
gsview32.ini 
and is taken from the standard distribution version of Ghostscript 6.01. 
You can use other devices or resolutions. 
<p>Some Ghostscript options may be added using either the 
<b>Options </b>field or the <a href="#Properties">Properties</a> button. 
<p>All pages, individual pages or any combination may be converted. 
The <b>All</b>, <b>Odd</b> and <b>Even</b> buttons provide quick selection of pages. 
If a single contiguous block of pages is marked, the <b>Odd</b> and <b>Even</b> 
buttons will select odd or even pages within this range. 
The <b>Reverse</b> check box causes the pages to be converted in 
descending order. 
<p>To control how GSview handles requests by the PostScript or 
PDF documents to change the page size, see the 
<a href="#Page_Size_Matching">Page Size Matching</a> topic. 
<p>See also <a href="#Conversions">Conversions</a>. 
<p>
<p>
<hr>
<h2><a name="Extract">Extract</a></h2>
<b>Extract</b> allows a range of pages to be copied from the current 
document to a new document.  For example, ten pages can be extracted 
from the middle of the current document and written to another file, 
which will later be sent to a printer. 
If you select <b>Reverse</b>, the extracted pages will be in descending 
order. 
<p>See also <a href="#Conversions">Conversions</a>. 
<p>
<p>
<hr>
<h2><a name="PS_to_EPS">PS to EPS</a></h2>
In general, it is not possible to convert a PostScript file to <a href="#Convencions_de_l'estructura_del_document">EPS</a>. 
However, many single page PostScript files can be converted to <a href="#Convencions_de_l'estructura_del_document">EPS</a> 
by changing the first line of the file to 
<pre>
 %!PS-Adobe-3.0 EPSF-3.0
</pre>
<p>and then adding or fixing up the <b>%%BoundingBox</b> comment. 
<p>EPS files are commonly used for inclusion in other documents and 
for this reason require the bounding box comment: 
<pre>
  %%BoundingBox: llx lly urx ury
</pre>
<p>where llx, lly, urx and ury are integers giving the x and y co-ordinates 
of the lower left and upper right corners of a bounding box which encloses 
all marks made on the page. 
<p><b>When used incorrectly, the PS to EPS command can produce PostScript 
files with incorrect DSC comments.  Such a document will cause problems 
when you try to include it inside another document.</b> 
<p>To convert a PostScript file to <a href="#Convencions_de_l'estructura_del_document">EPS</a>, the original file <b>must</b> be 
a <b>single page</b> document.  If the document contains <a href="#Convencions_de_l'estructura_del_document">DSC</a> comments 
and is multi page, extract the desired page with <b>File</b> | <a href="#Extract">Extract</a>. 
If the document does not contain <a href="#Convencions_de_l'estructura_del_document">DSC</a> comments, you will need to 
edit the file by hand to extract the desired page. 
<p><a href="#Convencions_de_l'estructura_del_document">EPS</a> documents <b>must not</b> use any of the following operators: 
<pre>
 banddevice   clear         cleardictstack  copypage
 erasepage    exitserver    framedevice     grestoreall
 initclip     initgraphics  initmatrix      quit
 renderbands  setglobal     setpagedevice   setpageparams
 setshared    startjob      letter          note
 legal        a3            a4              a5
</pre>
<p>The following operators should be used with care: 
<pre>
 nulldevice   setgstate     sethalftone    setmatrix
 setscreen    settransfer   setcolortransfer
</pre>
<p>It is <b>your</b> responsibility to make sure that the above requirements 
are met. 
<p>To test if a document contains any of the above operators, select 
<a href="#Options">Options</a> | <a href="#EPS_Warn">EPS Warn</a> and then <b>Open</b> the desired document. 
After the page has been displayed, <b>Close</b> the document and 
then display the Ghostscript messages with <b>File</b> | <a href="#Show_Messages">Show Messages</a>. 
If any of the above operators have been used you should see lines like: 
<pre>
 Warning: EPS files must not use ...
</pre>
<p>If you find these warnings then do <b>not</b> use <b>PS to EPS</b>. 
Remember to turn off <a href="#EPS_Warn">EPS Warn</a> afterwards. 
<p>A document must be displayed before <b>PS to EPS</b> is used. 
<p>For documents without <a href="#Convencions_de_l'estructura_del_document">DSC</a> comments, <b>PS to EPS</b> allows a bounding 
box to be specified, then writes out an <a href="#Convencions_de_l'estructura_del_document">EPS</a> file consisting of 
an <a href="#Convencions_de_l'estructura_del_document">EPS</a> wrapper around the original document. 
<p>For documents with <a href="#Convencions_de_l'estructura_del_document">DSC</a> comments, <b>PS to EPS</b> will change the 
first line of the file to 
<pre>
 %!PS-Adobe-3.0 EPSF-3.0
</pre>
<p>then allows the <b>%%BoundingBox</b> comment to be changed or added. 
<p>For <a href="#Convencions_de_l'estructura_del_document">EPS</a> documents, <b>PS to EPS</b> allows the <b>%%BoundingBox</b> comment to 
be changed. 
<p><b>PS to EPS</b> does not clip the document to the <b>%%BoundingBox</b>. 
To do so would require changing the PostScript code itself. 
<b>PS to EPS</b> only changes the <a href="#Convencions_de_l'estructura_del_document">DSC</a> comments. 
<p>If <b>Automatically calculate Bounding Box</b> is checked, GSview 
will calculate the bounding box from the non white pixels. 
If unchecked, you get to choose the bounding box by clicking at 
the left, bottom, right and top. 
<p><b>PS to EPS</b> does not add a preview to a document. 
If you want a preview you add it with <b>Edit </b>| <a href="#EPS_Preview">Add EPS Preview</a> after 
first creating an <a href="#Convencions_de_l'estructura_del_document">EPS</a> file with a correct <b>%%BoundingBox</b>. 
<p>See also <a href="#EPS_Preview">Add EPS Preview</a>, <a href="#Extract">Extract</a>, <a href="#EPS_Warn">EPS Warn</a> and <a href="#Conversions">Conversions</a>. 
<p>
<p>
<hr>
<h2><a name="EPS_Preview">EPS Preview</a></h2>
<b>Add EPS Preview</b> takes a bitmap from the 
display and uses it to add a preview to an EPS file. 
<b>Add EPS Preview</b> can create a DOS EPS file with a 
Windows Metafile or TIFF preview, or an EPSI file with an Interchange preview. 
To use the <b>Add EPS Preview</b> command the following steps must be followed. 
<p>1. Deselect <b>Options | Ignore DSC</b> 
<p>2. Make sure the document has a correct bounding box. 
<a href="#Options">Options</a> | <a href="#Show_Bounding_Box">Show Bounding Box</a> is useful for checking the 
bounding box. 
A bounding box can be added or changed using <b>File</b> | <a href="#PS_to_EPS">PS to EPS</a>. 
<p>3. Select <a href="#Page_Orientation">Orientation</a> | <a href="#Page_Orientation">Portrait</a>. 
<p>4. Select <b>Media </b>| <a href="#Display_Settings">Display Settings</a> and set a suitable resolution 
for the preview.  If the resolution is too high 
it will make the EPS file excessively large. 
<p>5. <b>Open</b> an EPS file that does not contain a preview. 
<p>6.  Select <b>Edit </b>| <b>Add EPS Preview</b>, then the preview format, 
then the new EPS filename.  GSview will write a new file containing 
the original PostScript EPS file and a preview created from the 
display bitmap. 
The available preview formats are <b>Interchange</b>, 
<b>TIFF 4</b>, <b>TIFF 6 uncompressed</b>, <b>TIFF 6 packbits</b> and <b>Windows Metafile</b>. 
If adding an Interchange preview, the document must have an <b>%%EndComments</b> 
line, otherwise GSview may put the preview in the wrong place. 
An interchange preview is always monochrome. 
A TIFF 4 preview is a Baseline Bilevel Image (1 bit/pixel) with 
no compression as described in the TIFF 6.0 memorandum, but avoiding 
tags which are not described in the TIFF 4 specification. 
WordPerfect 5.1 requires a TIFF 4 preview. 
A TIFF 6 preview is a Baseline Bilevel Image, 
or a Baseline Palette-colour Image (4 or 8 bits/pixel) 
or a Baseline RGB Full Colour Image (24 bits/pixel) 
according to the TIFF 6.0 specification. 
TIFF 6 previews are either uncompressed or compressed with packbits. 
A Windows Metafile preview contains an uncompressed bitmap. 
<p>7. 
Reset <a href="#Page_Orientation">Orientation</a> | <a href="#Page_Orientation">Portrait</a>, and 
<b>Media </b>| <a href="#Display_Settings">Display Settings</a> to their previous values. 
<p>To extract the PostScript or Preview section from a DOS EPS 
file, use <b>File</b> | <b>Select File</b> followed by <b>Edit </b>| <b>Extract EPS</b> 
then <b>PostScript</b> or <b>Preview</b>. 
<p>See also <a href="#PS_to_EPS">PS to EPS</a>. 
<p>
<p>
<hr>
<h2><a name="User_Supplied_Preview">User Supplied Preview</a></h2>
The <b>Edit </b>| <a href="#EPS_Preview">Add EPS Preview</a> | <b>User Supplied Preview</b> command 
allows an existing TIFF or WMF file to be added to an EPS file 
to create a DOS EPS file. 
This is useful if an application can export to an EPS file and to 
a WMF file, but cannot create a DOS EPS file with a WMF preview. 
The EPS file <b>must</b> contain a bounding box that corresponds with 
the TIFF or WMF preview file. 
It is not necessary to display the EPS file. <b>User Supplied Preview</b> 
can be used after an EPS file has been opened with <b>Select File</b>. 
<p>You can add a preview that has no resemblance to the PostScript, 
which is most undesirable. 
<p>
<p>
<hr>
<h2><a name="Convert_to_vector_format">Convert to vector format</a></h2>
You can convert a PostScript or PDF file to an editable vector 
format using <b>pstoedit</b> by Wolfgang Glunz. 
<b>pstoedit</b> is licensed with the GNU Public Licence and is not 
included with GSview.  You will need to download it separately 
from the pstoedit homepage 
<pre>
 http://www.pstoedit.net/pstoedit
</pre>
<p>or from 
<pre>
 http://www.cs.wisc.edu/~ghost/gsview/pstoedit.htm
</pre>
<p>To use <b>pstoedit</b> from within GSview, use 
<b>Edit | Convert to vector format</b>. 
Three dialog boxes will be shown. 
<p>The first dialog is for pstoedit settings. 
<p>Select an output <b>Format</b>. 
<p><b>Draw text as polygons</b> should be selected if the PostScript file 
contains text and the output format does not support this, e.g. gnuplot. 
This might produce a large output file. 
<p>When <b>Map to ISO-Latin1</b> is selected, pstoedit maps all character codes 
to the ones defined by the ISO-Latin1 encoding, which is used by 
HTML and MS-Windows.  This is the default. 
If you uncheck this item, the encoding from the input PostScript 
is passed unchanged to the output. 
<p>If the output format does not support curves in the way PostScript 
does, all curves are approximated by lines. The <b>Flatness</b> option 
is used to control this approximation. This parameter is directly 
converted to a PostScript setflat command. Small values produce 
a more accurate approximation, but more line segments. 
<p>Sometimes fonts embedded in a PostScript program do not have a 
fontname. For example, this happens in PostScript files generated 
by dvips. In such a case pstoedit uses a replacement font. 
The default for this is Courier.  Another font can be specified 
using the <b>Default Font</b> option. 
Some alternative font names are Courier, Helvetica and Times-Roman. 
<p>Some of the output formats support extra options.  See the pstoedit 
manual for more details.  For example, the java output format 
uses <b>Driver Options</b> to specify the name of the java class. 
<p>The second dialog (omitted if no page numbering is available) 
specifies the page to be converted, or if supported by the output 
format, a range of pages to be converted. 
<p>The third dialog specifies the output file name. 
<p>Not all <b>pstoedit</b> formats support bitmap graphics. 
If you need bitmap output, see <a href="#File_conversions_and_tricks">File conversions and tricks</a>. 
<p>For more details please read the pstoedit manual. 
<p>See also <a href="#Conversions">Conversions</a>. 
<p>
<p>
<hr>
<h2><a name="Text_Extract_and_Find">Text Extract and Find</a></h2>
In general, extracting text from a PostScript document is not a 
trivial operation.  Words may be broken.  Text may be encoded. 
Ligatures may be used (e.g. replacing 'fi' with a single character). 
There may be no relationship between the location of a word in 
the PostScript file and its location on the page. 
Success in extracting text from a PostScript document depends 
greatly on the document itself. 
<p>GSview has two methods of extracting text from a PostScript file. 
<p>The quick method extracts all text from PostScript strings. 
<p>The second method uses pstotext and Ghostscript to more accurately 
extract text from a PostScript document. 
<p>The method used is selected by <a href="#Options">Options</a> | <a href="#PStoText">PStoText</a>. 
See the appropriate topic below: 
<p>See also <a href="#Conversions">Conversions</a>. 
<p>
<a href="#Quick_Text_Extract_and_Find">Quick Text Extract and Find</a><br>
<a href="#PStoText_Text_Extract_and_Find">PStoText Text Extract and Find</a><br>
<p>
<hr>
<h3><a name="Quick_Text_Extract_and_Find">Quick Text Extract and Find</a></h3>
It is common for PostScript documents to contain text in the 
same order as it appears on the page, and for it to be given in 
PostScript strings, surrounded by parentheses.  Complete lines 
may be given in one string, or one word per string.  For this sort 
of document, extracting text can be done with reasonable success. 
<p><b>Edit </b>| <a href="#Text_Extract_and_Find">Text Extract</a> will extract text contained in strings from 
specified pages and write it to a text file. 
Line breaks in this text file correspond to lines in the document. 
Spaces in the text file correspond to spaces within strings, or to 
separate strings.  A more effective method of extracting text is to 
use ps2ascii.ps supplied with Ghostscript, or to use the <a href="#PStoText">PStoText</a> 
program listed on the Ghostscript <a href="#World_Wide_Web">WWW</a> page.  <a href="#PStoText">PStoText</a> can be 
used from GSview by using <a href="#Options">Options</a> | <a href="#PStoText">PStoText</a>. 
<p><b>Edit </b>| <a href="#Text_Extract_and_Find">Find</a> will search for text and display the first 
page that contains the text.  <a href="#Text_Extract_and_Find">Find</a> asks for a search text 
and a range of pages in which to search. 
The preceding comments about extracting text from a PostScript 
document should be noted.  <a href="#Text_Extract_and_Find">Find</a> first extracts text from 
the document, then searches it ignoring all spaces in both the 
document and the search text.  Case is ignored when searching. 
Consequently the search text <b>these</b> would match both <b>These</b> 
and <b>The serial</b>.  No information is given about where the word 
is located on a given page because this information is not 
available without a complete PostScript interpreter. 
<a href="#Text_Extract_and_Find">Find</a> will not work for non DSC documents or DSC documents with 
special page order. 
<p><b>Edit </b>| <a href="#Text_Extract_and_Find">Find Next</a> will continue the search from the next page. 
<p>
<p>
<hr>
<h3><a name="PStoText_Text_Extract_and_Find">PStoText Text Extract and Find</a></h3>
This method uses pstotext and Ghostscript to extract text from 
a PostScript document.  Before doing any text extraction or 
searching, the entire PostScript document will be processed by 
Ghostscript and pstotext to produce a text index file. 
This may take a long time.  Once this has finished, text extraction 
and searching should be quick. 
<p>pstotext uses the ISO-Latin1 character set.  See the pstotext 
documentation for more details. 
<pre>
 http://www.research.digital.com/SRC/virtualpaper/pstotext.html
</pre>
<p><a href="#Page_Orientation">Orientation</a> must be set to match the text direction of the 
document. 
<p><b>Edit </b>| <a href="#Text_Extract_and_Find">Text Extract</a> will extract text from specified pages 
and write it to a text file. 
<p>Words can be copied to the clipboard using<b> Edit</b> | <a href="#Clipboard">Copy</a>. 
<p><b>Edit </b>| <a href="#Text_Extract_and_Find">Find</a> will search for text and display the first 
page that contains the text.  <a href="#Text_Extract_and_Find">Find</a> asks for a search text 
and a range of pages in which to search. 
The search text is first broken up into words.  For each search word, 
a search is made to find a match anywhere within a document word. 
Searching for<b> frog</b> would find<b> frog</b>,<b> frogs</b> and<b> bullfrogs</b>. 
The wildcards '*' (zero or more characters) and '?' (any one character) 
are supported, but it doesn't make sense to use them at the beginning 
or end of a word. 
Wildcards do not extend beyond the word being searched. 
Multiple complete words may be specified, e.g.  <b>GSview is a</b>. 
If the search text is found, the page containing the text is displayed 
and the first word highlighted. 
<a href="#Text_Extract_and_Find">Find</a> will not work for non DSC documents or DSC documents with 
special page order. 
<p><b>Edit </b>| <a href="#Text_Extract_and_Find">Find Next</a> will continue the search. 
<p>For most PostScript files you should use 
<a href="#Options">Options</a> | <a href="#PStoText">PStoText</a> | <b>Normal</b>. 
<p><a href="#Options">Options</a> | <a href="#PStoText">PStoText</a> | <b>Dvips Cork Encoding</b> 
is only relevant for PostScript files produced by 
dvips from TeX or LaTeX documents; it tells <b>pstotext</b> to use the 
Cork encoding rather than the old TeX text encoding. Unfortunately 
files produced by dvips don't distinguish which font encodings were 
used. 
<p>
<p>
<hr>
<h2><a name="Clipboard">Clipboard</a></h2>
The GSview window can be copied to the Clipboard as a bitmap 
by selecting <b>Copy</b> from the <b>Edit</b> menu. 
The bitmap will be a Device Independent Bitmap (DIB/BMP format). 
<p>An alternative way to get a bitmap output from Ghostscript is 
to use one of the BMP drivers.  See <b>Print</b>. 
<p><b>Paste To</b> copies a Device Independent Bitmap from the Clipboard 
(if available) to a BMP file. 
<p><b>Convert Bitmap</b> converts between a Device Independent Bitmap and 
a Device Dependent Bitmap. 
If the clipboard contains a Device Independent Bitmap (BMP format), 
this is converted to a Device Dependent Bitmap and added to the clipboard. 
If the clipboard does not contain a colour palette, one is created 
from the Device Independent Bitmap and added to the clipboard. 
This option is present because some applications (notably Windows 
Paintbrush) won't recognise a Device Independent Bitmap in the clipboard. 
<p>If <a href="#Text_Extract_and_Find">Text Extract</a> or <a href="#Text_Extract_and_Find">Find</a> are used on a document with <a href="#PStoText">PStoText</a> enabled, 
GSview creates an index of the words in the document.  If any words are 
marked with the mouse, 
<b>Copy</b> will copy these words to the clipboard instead 
of copying a bitmap. 
Text cannot be marked until either <a href="#Text_Extract_and_Find">Text Extract</a> 
or <a href="#Text_Extract_and_Find">Find</a> has been used with <a href="#Options">Options</a> | <a href="#PStoText">PStoText</a> enabled. 
<p>
<p>
<hr>
<h1><a name="Measure">Measure</a></h1>
Lengths can be measured using the cursor location displayed on 
the status bar, or with the <b>Edit |</b> <b>Measure</b> dialog box. 
<p>This dialog box shows the start location, finish location, 
difference between these locations and the length and angle 
between these locations. 
The start location is set when you click the left mouse button. 
The default start location is the lower left corner of the page. 
The units can be pt, mm, inch, or custom. 
<p>Custom units allows you to display coordinates as they appear 
in a PostScript file. 
Custom units are usually specified by starting with an identity 
matrix and then performing a series of transformations. 
If a PostScript file invokes landscape orientation using 
<pre>
 90 rotate
 0 -595 translate
</pre>
<p>then to display the user coordinates you would enter 
the following in the Calculate Transformation dialog: 
<pre>
 Custom
 initmatrix
 90 rotate
 0 -595 translate
 invertmatrix
 Ok
</pre>
<p>The Current Transformation Matrix (CTM) is shown in 
upper part of the dialog.  You can enter a CTM directly 
if you like maths. 
It is easier to enter values in the Custom edit fields below this, 
but these have no effect until one of the transform buttons 
(translate, rotate, scale) is selected. 
<p>See also <a href="#Units">Units</a>. 
<p>
<p>
<hr>
<h1><a name="Options">Options</a></h1>
The <b>Options</b> menu has the following selections: 
<p>
<a href="#Easy_Configure">Easy Configure</a><br>
<a href="#Advanced_Configure">Advanced Configure</a><br>
<a href="#Sounds">Sounds</a><br>
<a href="#Units">Units</a><br>
<a href="#Language">Language</a><br>
<a href="#PStoText">PStoText</a><br>
<a href="#DSC_Warnings">DSC Warnings</a><br>
<a href="#Save_Settings">Save Settings</a><br>
<a href="#Safer">Safer</a><br>
<a href="#Save_Last_Directory">Save Last Directory</a><br>
<a href="#Button_Bar">Button Bar</a><br>
<a href="#Fit_Window_To_Page">Fit Window To Page</a><br>
<a href="#Auto_Redisplay">Auto Redisplay</a><br>
<a href="#EPS_Clip">EPS Clip</a><br>
<a href="#EPS_Warn">EPS Warn</a><br>
<a href="#Ignore_DSC">Ignore DSC</a><br>
<a href="#Show_Bounding_Box">Show Bounding Box</a><br>
<p>
<hr>
<h2><a name="Easy_Configure">Easy Configure</a></h2>
Easy configure allows you to select which version of 
Ghostscript to use.  It is assumed that you have already installed 
AFPL Ghostscript 7.04 or later. 
If you do not have Ghostscript installed, see the topic 
<b>Obtaining Ghostscript</b>. 
For more control over configuration of GSview, see 
<a href="#Advanced_Configure">Advanced Configure</a>. 
<p>Easy configure will set the correct paths for Ghostscript 
and copy some printer defaults to the INI file. 
It does not alter the registry or start menu. 
<p>
<p>
<hr>
<h2><a name="Advanced_Configure">Advanced Configure</a></h2>
<b>Ghostscript DLL</b> tells GSview where to find Ghostscript. 
The default for Win32 is 
<pre>
 c:\gs\gsN.NN\bin\gsdll32.dll
</pre>
<p>Enter the correct Ghostscript include path into the 
<b>Ghostscript Include Path</b> field. 
This include path must include the directories where the Ghostscript 
library files (gs_*.ps and Fontmap) and the Ghostscript fonts (*.pfb) 
are located. For example: 
<pre>
  c:\gs\gsN.NN\lib;c:\gs\fonts
</pre>
<p>Do NOT put a <b>-I</b> before the include path. 
<p>The <b>Ghostscript Options</b> field may be empty. 
If you wish to turn off the <b>Platform Fonts</b> feature under 
MS-Windows, put <b>-dNOPLATFONTS</b> in the <b>Ghostscript Options</b> field. 
If you wish to search for fonts not listed in Fontmap, 
add -sFONTPATH to this field.  For example 
<pre>
  -dNOPLATFONTS -sFONTPATH="c:\psfonts"
</pre>
<p>If you do not get the <b>Ghostscript DLL</b> field correct, GSview will 
not be able to load Ghostscript. 
If you do not get the <b>Ghostscript Include Path</b> correct, Ghostscript 
will not initialise and will then unload. 
<p>Selecting <b>Copy printer defaults</b> will update gsview32.ini from the 
file printer.ini. 
<p>Selecting <b>Associate .ps files with GSview</b> will update the registry 
to associate PostScript files with GSview. 
<p>Selecting <b>Associate .pdf files with GSview</b> will update the registry 
to associate Portable Document Format files with GSview. 
<p>Selecting <b>Create Start Menu items</b> will add GSview to the start menu. 
<p>There is no undo facility for the actions of these four checkboxes. 
The Associate and Start Menu actions are normally performed 
(with an undo facility) by the GSview setup program. 
<p>See the <b>Installation</b> topic. 
<p>
<p>
<hr>
<h2><a name="Sounds">Sounds</a></h2>
The <b>Sounds</b> option assigns sounds to various events. 
For each event the sound can be set to <b>None</b>, a <b>Speaker Beep</b> or 
a <b>Wave</b> file. 
<p>You must have a sound driver loaded before using Wave files. 
Wave file sounds are not available under MS-Windows 3.0. 
<p>The events are: 
<p><b>Output Page</b>: the PostScript showpage operator was executed. 
<p><b>No Page</b>: an invalid page was selected. 
For example, pressing <b>Prev</b> while on the first page of a document 
with <a href="#Convencions_de_l'estructura_del_document">DSC</a> comments. 
<p><b>No Number</b>: a command required page numbering and the document did 
not have page numbering. 
For example, pressing <b>Goto Page</b> when viewing a document without 
<a href="#Convencions_de_l'estructura_del_document">DSC</a> comments. 
<p><b>Not Open</b>:  a command required a document to be open and this was 
not the case. 
For example, pressing <b>Goto Page</b> when no document is open. 
<p><b>Error</b>: many types of errors. 
<p><b>Start</b>: GSview opened. 
<p><b>Exit</b>: GSview closed. 
<p><b>Busy</b>: busy at the moment, can't do what you asked. 
<p>The defaults are for <b>No Page</b>, <b>Error</b> and <b>Busy</b> to be a 
<b>Speaker Beep</b> and all other events to be <b>None</b>. 
<p>
<p>
<hr>
<h2><a name="Units">Units</a></h2>
The <b>Units</b> option sets the units used to display the cursor location 
on the status bar.  Available units are PostScript points (<b>pt</b> = 1/72"), 
millimetres (<b>mm</b>) and inches (<b>in</b>). 
The default is <b>pt</b>. 
<p>The resolution of the units can be increased by selecting 
<b>Units </b>| <b>Fine Resolution</b>. 
<p>See also <a href="#Measure">Measure</a>. 
<p>
<p>
<hr>
<h2><a name="Language">Language</a></h2>
GSview is available in English, Dutch, French, German, Greek, 
Italian and Spanish. 
To change the language use <a href="#Options">Options</a> | <b>Language</b>. 
<p>On Windows NT, all existing languages are available to be 
selected, independent of the regional settings. 
On other systems, the language availability depends on the 
selected regional settings, in particular the chosen locale 
or system code page. 
<p>
<p>
<hr>
<h2><a name="PStoText">PStoText</a></h2>
GSview has two methods of extracting and searching text. 
<p>The <a href="#Quick_Text_Extract_and_Find">Quick Text Extract and Find</a> method does a simple extraction 
of PostScript strings.  This method is easily confused. 
This is selected by the menu item <b>PStoText</b> | <b>Disabled</b>. 
<p>The <a href="#PStoText_Text_Extract_and_Find">PStoText Text Extract and Find</a> method uses the external pstotext 
tool and Ghostscript to extract words and their co-ordinates. 
This method is more accurate, but there may be a long pause while 
pstotext and Ghostscript do the initial processing. 
After this, text extraction and searching should be quick. 
There are two modes of operation.  <b>Normal</b> should be used 
for most PostScript files.  <b>Dvips Cork Encoding</b> should be 
used if you have a PostScript file produced by dvips 
which uses Cork Encoding. 
<p>The default is <b>Normal</b>. 
<p>
<p>
<hr>
<h2><a name="DSC_Warnings">DSC Warnings</a></h2>
Some documents contain errors in the Document Structuring Conventions. 
The level of warnings provided by GSview can be set using 
<a href="#Options">Options</a> | <b>DSC Warnings</b>. 
If set to<b> Off</b>, GSview will assume that the DSC comments are correct. 
<b>Errors</b> will notify you of errors in the DSC comments . 
<b>Warnings</b> will notify you of warnings and errors in the DSC comments. 
<b>All</b> will notify you of irregularities, warnings and errors in the 
DSC comments.  The default is <b>Warnings</b>. 
<p>If you ask to be notified about errors and warnings, the DSC 
warning dialog box allows you to make the following choices: 
<b>OK</b> tells GSview to take a guess about what was probably meant 
(rather than what the DSC comment actually said), 
<b>Cancel</b> tells GSview to treat the DSC as being correct, 
<b>Ignore DSC </b> tells GSview to ignore all DSC comments. 
<p>If <b>DSC Warnings</b> is<b> Off</b>, GSview will assume <b>Cancel</b>. 
Documents with incorrect DSC comments will be likely to cause problems. 
<p>
<p>
<hr>
<h2><a name="Save_Settings">Save Settings</a></h2>
The <b>Save Settings Now</b> option saves the GSview window position, 
window size, last used printer, last directory, 
all items on the <a href="#Options">Options</a> menu and all items on the <a href="#Page_Size">Media</a> menu 
to the initialisation file 
gsview32.ini in the Windows system directory (or for Windows 
95 or NT 4 in the user profile directory if user profiles are 
being used). 
GSview reads this file during startup. 
<p>When the <b>Save Settings on Exit</b> option is checked, GSview will 
automatically save the above settings when you quit GSview. 
<p>
<p>
<hr>
<h2><a name="Safer">Safer</a></h2>
When the <b>Safer</b> option is <b>checked</b>, GSview will give Ghostscript 
the <b>-dSAFER</b> flag, which disables the deletefile and renamefile operators, 
and the ability to open files in any mode other than read-only. 
This is the default. 
<p>When the <b>Safer</b> option is <b>unchecked</b> Ghostscript can change 
files. 
<p>
<p>
<hr>
<h2><a name="Save_Last_Directory">Save Last Directory</a></h2>
When the <b>Save Last Directory</b> option is <b>checked</b>, GSview will 
save the current directory when you quit GSview.  When GSview 
is started next, this will be made the current directory. 
This is the default. 
<p>When <b>Save Last Directory</b> option is <b>unchecked</b>, the current 
directory when GSview is started will be the current directory 
of the program that started GSview. 
<p>
<p>
<hr>
<h2><a name="Button_Bar">Button Bar</a></h2>
When the <b>Button Bar</b> option is <b>checked</b>, GSview will display 
a Button Bar 
at the top 
of the window.  This is the default. 
The Button Bar contains the following items in order from 
left to right: 

<img src="gvwopen.gif">
<b>File</b> | <b>Open</b> 
<p>
<img src="gvwprint.gif">
<b>File</b> | <b>Print</b> 
<p>
<img src="gvwinfo.gif">
<b>File</b> | <b>Info</b> 
<p>
<img src="gvwhelp.gif">
<b>Help</b> | <b>Contents</b> 
<p>
<img src="gvwgoto.gif">
<b>View</b> | <b>Goto Page</b> 
<p>
<img src="gvwprevs.gif">
<b>Go back 5 pages</b> 
<p>
<img src="gvwprev.gif">
<b>View</b> | <b>Previous Page</b> 
<p>
<img src="gvwnext.gif">
<b>View</b> | <b>Next Page</b> 
<p>
<img src="gvwnexts.gif">
<b>Go forward 5 pages</b> 
<p>
<img src="gvwback.gif">
<b>View</b> | <b>Go Back</b> 
<p>
<img src="gvwfwd.gif">
<b>View</b> | <b>Go Forward</b> 
<p>
<img src="gvwmagp.gif">
<b>Increase resolution by 1.2</b> 
<p>
<img src="gvwmagm.gif">
<b>Decrease resolution by 1/1.2</b> 
<p>
<img src="gvwfind.gif">
<b>Edit </b>| <a href="#Text_Extract_and_Find">Find</a> 
<p>
<img src="gvwfindn.gif">
<b>Edit </b>| <a href="#Text_Extract_and_Find">Find Next</a> 
<p>If using the increase/decrease resolution buttons, <a href="#Auto_Redisplay">Auto Redisplay</a> 
should be set.  Instead of using these buttons the 
<b>Media </b>| <a href="#Display_Settings">Display Settings</a> command can be used. 
When the <b>Button Bar</b> option is <b>unchecked</b>, GSview will not 
display the Button Bar. 
<p>
<p>
<hr>
<h2><a name="Fit_Window_To_Page">Fit Window To Page</a></h2>
When the <b>Fit Window To Page</b> option is <b>checked</b>, changes to the page 
size or orientation will cause the window size to be enlarged or 
reduced to suit the page size. 
Whenever the window is resized, GSview will force it to be no larger 
than the page being displayed. 
<p>Changes in the window size will only occur when the window is resized 
or the page size changed; it does not happen immediately after this 
option is changed. 
Fit Window To Page is ignored for a maximized window. 
<p>If <b>Fit Window To Page</b> is <b>unchecked</b>, GSview will not resize the 
window and areas outside the page will be drawn in light grey. 
This is useful if you do not wish the window to shrink when looking 
at pages at low resolution.  This is the default. 
<p>See also <b>View</b> | <b>Fit Window</b>. 
<p>
<p>
<hr>
<h2><a name="Auto_Redisplay">Auto Redisplay</a></h2>
When the <b>Auto Redisplay</b> option is <b>checked</b>, GSview will 
redisplay <a href="#Convencions_de_l'estructura_del_document">DSC</a> documents when the <a href="#Page_Orientation">Orientation</a>, <a href="#Display_Settings">Resolution</a>, 
<a href="#Display_Settings">Depth</a> or <a href="#Page_Size">Media</a> are changed. 
This is the default. 
<p>For <b>non-DSC documents</b>, if <b>Auto Redisplay</b> is <b>checked</b>, 
GSview will <b>restart at the first page</b>. 
<p>If <b>Auto Redisplay</b> is <b>unchecked</b>, the <b>View</b> | <b>Redisplay</b> command 
must be used to redisplay a document after changing the 
<a href="#Page_Orientation">Orientation</a>, <a href="#Display_Settings">Resolution</a>, <a href="#Display_Settings">Depth</a> or <a href="#Page_Size">Media</a>. 
<p>
<p>
<hr>
<h2><a name="EPS_Clip">EPS Clip</a></h2>
When the <b>EPS Clip</b> option is <b>checked</b>, GSview will clip the 
display bitmap to the bounding box of an EPS file instead of using the 
page size specified on the <a href="#Page_Size">Media</a> menu.  This is useful when 
adding a bitmap preview to an EPS file. 
If a PDF file is being displayed, <b>EPS Clip</b> will cause the 
display to be clipped to the PDF crop box. 
<p>If <b>EPS Clip</b> is <b>unchecked</b>, GSview will use the page size 
specified on the <a href="#Page_Size">Media</a> menu for EPS files.  This is the default. 
<p><b>EPS Clip</b> does not alter the original document, it only affects 
how much of the document is displayed by GSview. 
It does not affect printing. 
<p>See also <b>Edit </b>| <a href="#EPS_Preview">Add EPS Preview</a> 
<p>
<p>
<hr>
<h2><a name="EPS_Warn">EPS Warn</a></h2>
When the <b>EPS Warn</b> option is <b>checked</b>, GSview will write a 
prolog to Ghostscript when each file is opened.  This prolog will 
produce warning messages in the <b>File </b>| <a href="#Show_Messages">Show Messages</a> 
window if any PostScript operators that should not be used in <a href="#Convencions_de_l'estructura_del_document">EPS</a> 
files are used.  An example warning message is: 
<pre>
 Warning: EPS files must not use /initgraphics
</pre>
<p><b>EPS Warn</b> is not infallible.  It is possible to access restricted 
operators without <b>EPS Warn</b> producing a warning. 
If you do get a warning, do NOT used <a href="#PS_to_EPS">PS to EPS</a>. 
<p>The default for <b>EPS Warn</b> is <b>unchecked</b>. 
<p>See also <a href="#PS_to_EPS">PS to EPS</a>. 
<p>
<p>
<hr>
<h2><a name="Ignore_DSC">Ignore DSC</a></h2>
Some documents incorrectly claim to conform to the Adobe Document 
Structuring Conventions.  Attempting to display one of these bogus 
documents will probably leave GSview horribly confused and unable 
to display the document.  If <b>Ignore DSC</b> is <b>checked</b>, GSview 
will treat the document as if it does not contain DSC comments 
and will only display the pages in the original order. 
<p>The default for <b>Ignore DSC</b> is <b>unchecked</b>. 
<p>
<p>
<hr>
<h2><a name="Show_Bounding_Box">Show Bounding Box</a></h2>
Selecting this option causes a dashed rectangle to drawn over 
the image, showing the location of the bounding box. 
This bounding box is only drawn on the display, and does not 
affect printer output. 
The bounding box will only be shown for <a href="#Convencions_de_l'estructura_del_document">DSC</a> documents (non 
conforming documents don't have a bounding box). 
<p>The default for <b>Show Bounding Box</b> is <b>unchecked</b>. 
<p>
<p>
<hr>
<h1><a name="Page_Orientation">Page Orientation</a></h1>
The <b>Portrait</b>, <b>Landscape</b>, <b>Upside-down</b> and <b>Seascape</b> 
(reverse Landscape) commands on the <b>Orientation </b>Menu select 
the page orientation used by the display. 
<b>Landscape</b> implies a clockwise rotation of the paper by 90 degrees. 
<b>Seascape</b> implies an anti-clockwise rotation of the paper by 90 degrees. 
These orientation options only affect the display and do not affect 
the print commands. 
<p>If the <b>Auto</b> command on the orientation menu is checked and 
a <a href="#Convencions_de_l'estructura_del_document">DSC</a> page orientation comment is found (%%Orientation or 
%%PageOrientation), the orientation will be selected automatically. 
<p>When the <b>Swap Landscape</b> option is <b>checked</b>, GSview swaps the 
meaning of Landscape and Seascape. 
Most of the Landscape documents that I have encountered require a 90 
clockwise rotation of the paper to view. 
However, there is no standard and some documents need to be rotated 
the other way. 
The <b>Swap Landscape</b> button allows GSview to automatically rotate the 
document the right way in response to the <b>%%Orientation</b> comment in the 
PostScript file. 
<p>See also <a href="#Page_Size">Page Size</a> and <a href="#Display_Settings">Display Settings</a>. 
<p>
<p>
<hr>
<h1><a name="Display_Settings">Display Settings</a></h1>
Some settings for display only can be set with <a href="#Page_Size">Media</a> | <b>Display Settings</b>. 
<p>The <b>Resolution</b> field sets the display resolution in dots per inch. 
The default for a VGA display is 96 dots per inch. 
This can also be changed by the resolution changing buttons on 
the button bar. 
<p>For DSC conforming files, pressing the right mouse button will 
<a href="#Zoom">Zoom</a> into the page at what is usually printer resolution. 
Pressing the right mouse button a second time will zoom back out to 
normal display resolution. 
The <b>Zoom Resolution</b> field sets the zoom resolution in dots per inch. 
<p>The <b>Depth</b> field sets the page bitmap depth in bits per pixels 
for the display. 
Default will select the highest depth supported by your display 
driver.  In general, you shouldn't set this higher than your 
actual display depth because doing so will use extra memory 
for the page bitmap but won't improve the display. 
<p>The <b>Text Alpha</b> field sets anti-aliasing for fonts.  The default 
(use anti-aliasing) is 4 bits.  To disable anti-aliasing of fonts, 
use 1 bit. 
<p><b>IMPORTANT</b>: If you use <b>Text Alpha</b>, GSview will disable 
<b>Platform Fonts</b> by doing the equivalent of adding 
<pre>
  -dNOPLATFONTS
</pre>
<p>to the <b>Options </b>| <a href="#Advanced_Configure">Advanced Configure</a> Ghostscript Options field. 
<p>The <b>Graphics Alpha</b> field sets anti-aliasing for graphics and 
also for text that is too large to fit in the font cache. 
<p>Using anti-aliasing slows down drawing. 
Text and Graphics Alpha can only be used if your display depth is 
set to 8bits/pixel or higher. 
<p>
<a href="#Zoom">Zoom</a><br>
<p>
<hr>
<h2><a name="Zoom">Zoom</a></h2>
To enlarge a displayed feature, position the cross-hair mouse pointer 
over the feature then press the right mouse button. 
The window will swap from normal display resolution to zoom 
resolution and the status line will have the word <b>Zoomed</b> appended to it. 
The zoomed feature will be in the centre of the window. 
To cancel <b>Zoom</b>, press the right mouse button again or select 
any command that redraws the page (e.g. <b>Redisplay</b>, <b>Next Page</b>). 
By default the zoom resolution is 300 dots per inch but this can 
be changed with <a href="#Page_Size">Media</a> | <a href="#Display_Settings">Display Settings</a> dialog box. 
<p><b>Zoom</b> will only work for <a href="#Convencions_de_l'estructura_del_document">DSC</a> conforming documents. 
<p>To enlarge or shrink the entire page, use the <a href="#Display_Settings">Resolution</a> 
on the <a href="#Page_Size">Media</a> | <a href="#Display_Settings">Display Settings</a> dialog box, use the magnifying 
glass toolbar buttons. 
<p>
<p>
<hr>
<h1><a name="Page_Size">Page Size</a></h1>
The <b>Media</b> menu also allows selection of page size. 
Available page sizes are: 
<pre>
 11x17          11   x 17   inch
 A0              840 x 1189 mm
 A1              594 x 840  mm
 A2              420 x 594  mm
 A3              297 x 420  mm
 A4              210 x 297  mm
 A5              148 x 210  mm
 B4              257 x 364  mm
 B5              182 x 257  mm
 Ledger         17   x 11   inch
 Letter          8.5 x 11   inch
 Legal           8.5 x 14   inch
 Note            8.5 x 11   inch
</pre>
<p>A user defined size can be specified in PostScript points (1/72 inch) 
with the <b>User Defined</b> command.  A size of 480x360 points at 96 dpi 
will give an image size of 640x480 pixels. 
<p>If a <a href="#Convencions_de_l'estructura_del_document">DSC</a> media comment is found, such as 
<pre>
 %%DocumentPaperSizes: a4
 %%DocumentMedia: a4 595 842 80 white ( )
</pre>
<p>the page type will be selected automatically. 
If the media specification is not one of the above page types, 
the <b>User Defined</b> size will be set. 
<p>If <b>Rotate Media</b> is checked, the width and height of the page 
are exchanged.  The image drawn on the page is not rotated. 
This affects both display and printing. 
Selecting <b>A4</b> and <b>Rotate Media</b> is equivalent to selecting 
<b>User Defined</b> with a size of 842 x 595 pt. 
It is more common to use the settings on the <a href="#Page_Orientation">Orientation</a> menu 
than <b>Rotate Media</b>. 
<p>
<p>
<hr>
<h1><a name="Keys">Keys</a></h1>
Following are the key assignments for GSview. 
<p><b>O</b>, <b>o</b>  Open and display a file.  (<b>File</b> | <b>Open</b>) 
<p><b>C</b>, <b>c</b>  Close file.  (<b>File</b> | <b>Close</b>) 
<p><b>N</b>, <b>n</b>, <b>+</b>  Next Page.  (<b>View</b> | <b>Next Page</b>) 
<p>Space     Next Page and Home.  (<b>View</b> | <b>Next Page and Home</b>) 
<p><b>V</b>, <b>v</b>, <b>-</b>  Previous Page.  (<b>View</b> | <b>Previous Page</b>) 
<p>BackSpace  Previous Page and Home.  (<b>View</b> | <b>Previous Page and Home</b>) 
<p><b>G</b>, <b>g</b>  Goto Page.  (<b>View</b> | <b>Goto Page</b>) 
<p><b>I</b>, <b>i</b>  File information.  (<b>File</b> | <b>Info</b>) 
<p><b>R</b>, <b>r</b>, <b>F5</b>  Redisplay page.  (<b>View</b> | <b>Redisplay</b>) 
<p><b>S</b>, <b>s</b>  Select file: open but don't display.  (<b>File</b> | <b>Select File</b>) 
<p><b>A</b>, <b>a</b>  Save As. (<b>File</b> | <b>Save As</b>) 
<p><b>P</b>, <b>p</b>  Print all or some pages to a printer.  (<b>File</b> | <b>Print</b>) 
<p><b>F</b>, <b>f</b>  Convert all or some pages to a PDF or bitmap File. 
(<b>File</b> | <a href="#Convert">Convert</a>). 
<p><b>E</b>, <b>e</b>  Extract some pages to another File.  (<b>File</b> | <a href="#Extract">Extract</a>) 
<p><b>M</b>, <b>m</b>  Show Ghostscript Messages.  (<b>File</b> | <a href="#Show_Messages">Show Messages</a>) 
<p><b>&lt;</b> Decrease resolution by 1/1.2 
<p><b>&gt;</b> Increase resolution by 1.2 
<p><b>F1</b>  Help.  (<b>Help</b> | <b>Contents</b>) 
<p><b>Ctrl+C</b>, <b>Ctrl+Insert</b>  Copy displayed bitmap to clipboard.  (<b>Edit</b> | <a href="#Clipboard">Copy</a>) 
<p><b>Ctrl+F</b>, Find Text. (<b>Edit</b> | <a href="#Text_Extract_and_Find">Find</a>) 
<p><b>F3</b>, Find Next. (<b>Edit</b> | <a href="#Text_Extract_and_Find">Find Next</a>) 
<p><b>F4</b>  Full Screen.  (<b>View</b> | <b>Full Screen</b>) 
<p><b>F6</b>  Fit Window.  (<b>View</b> | <b>Fit Window</b>) 
<p><b>Arrow Keys</b>  Scroll by 1/16 of a screen. 
<p><b>Ctrl + Arrow Keys</b>  Scroll by one screen. 
<p><b>Page Up</b>  Scroll up one screen (window height). 
<p><b>Page Down</b>  Scroll down one screen. 
<p><b>Home</b>  Scroll to top of page. 
<p><b>End</b>  Scroll to bottom of page. 
<p>
<p>
<hr>
<h1><a name="Command_line_options">Command line options</a></h1>
GSview ignores the case of options: 
-p is the same as -P.  On Windows or OS/2, you can also 
use /p or /P.  In the samples below, replace <b>gsview</b> with 
<b>gsview32</b> on Windows and <b>gvpm</b> on OS/2. 
<p>Usage: 
<pre>
 gsview [-d] [-t] [-f[DEVICE]] [-p[QUEUE]]
   [-mPAPERSIZE] [-oORIENTATION] [-rXDPIxYDPI]
   [-geometry WIDTHxHEIGHT[+XOFF+YOFF]] filename
</pre>
<p>Options: 
<p><b>filename</b> To start GSview and display filename.ps: 
<pre>
 gsview filename.ps
</pre>
<p><b>-p</b> prints filename.ps using Ghostscript. 
This is similar to <b>File</b> | <b>Print</b>, except that you will 
not be prompted for a printer (it will use the printer most 
recently used by GSview, or the printer name you provide) 
and GSview will exit after printing has finished: 
<pre>
 gsview -p filename.ps
</pre>
<p><b>-f</b> converts a PostScript file (not PDF) filename.ps 
to a file using Ghostscript (<b>File</b> | <a href="#Convert">Convert</a>): 
<pre>
 gsview -f filename.ps
</pre>
<p><b>-m</b>PAPERSIZE sets the paper size.  Any of the predefined 
sizes on the media menu are valid. 
<p><b>-o</b>ORIENTATION sets the orientation and may be one of 
<b>auto</b>, <b>portrait</b>, <b>landscape</b>, <b>upsidedown</b> or <b>seascape</b>. 
<p><b>-r</b>XDPIxYDPI sets the display, convert or print resolution. 
<p>To display a file with A4 paper, landscape orientation 
and 96dpi: 
<pre>
 gsview -ma4 -olandscape -r96x96 filename.ps
</pre>
<p><b>-d</b> Debug mode. 
In debug mode GSview will <b>not</b> remove its temporary files. 
This is to allow inspection of these files after GSview has finished. 
Debug mode also produces more verbose output for <b>File </b>| <a href="#Show_Messages">Show Messages</a>. 
To write debugging output to 
c:\gsview.txt 
use -d9 
<p><b>-t</b> Multi-threading.  GSview by default runs multi-threaded, 
except for Windows 3.1/Win32s. 
To change this, use <b>-t</b> to toggle the threading mode, use <b>-t0</b> to select 
single-thread mode and <b>-t1</b> to select multi-thread mode. 
<p>Windows supports a few additional command line options. 
<p><b>-s</b> spools a file directly to the printer, without using Ghostscript. 
GSview will exit when the file has been spooled. 
Some examples are: 
<pre>
 gsview -s filename.ps
 gsview -sLPT3: filename.ps
 gsview -s"HP DeskJet Portable" filename.ps
</pre>
<p><b>-e</b> uses DDE to open a file in an existing GSview, or if GSview 
is not already running, in a new window using. 
<pre>
 gsview -e filename
</pre>
<p><b>-x</b> uses DDE to tell an existing GSview to close. 
<pre>
 gsview -x
</pre>
<p>
<a href="#Dynamic_Data_Exchange">Dynamic Data Exchange</a><br>
<p>
<hr>
<h2><a name="Dynamic_Data_Exchange">Dynamic Data Exchange</a></h2>
GSview implements a DDE server, service="GSview and topic="GSview". 
The XTYP_EXECUTE commands that are recognised are: 
<pre>
 [FileOpen("filename")]
 [FileExit()]
 [NextPage()]
 [PrevPage()]
 [GoBack()]
 [GotoPage(5)]
 [ShowWindow(nCmdShow)]
 [Minimise()]
 [Maximise()]
 [Command("command line")]
</pre>
<p>The [Command()] command only understands "filename" or "/P filename". 
<p>Don't sent multiple commands together.  GSview won't complain, 
but the multithreaded asynchrononous execution within GSview 
means that the first command won't have been completed before 
the second command is received.  If you need to send multiple 
commands, send them separately with pauses inbetween. 
<p>There are two command line options to cause GSview to send a DDE 
command to another copy of GSview. 
The /E command line option uses [Command("command line")][ShowWindow(1)]. 
The /X command line option uses [FileExit()]. 
<p>
<p>
<hr>
<h1><a name="World_Wide_Web">World Wide Web</a></h1>
The World Wide Web home page for Ghostscript, Ghostview and GSview 
is at 
<pre>
 http://www.cs.wisc.edu/~ghost/
</pre>
<p>GSview can be registered on-line at 
<pre>
 http://www.ghostgum.com.au/
</pre>
<p>GSview can be used as a PostScript file viewer for several OS/2 
and MS-Windows Web browsers.  See the GSview home page for details. 
<p>Thomas Merz has written a Ghostscript manual, which is available 
in <a href="#Format_de_document_portàtil_(PDF)">PDF</a> from the above WWW site.  This manual is an extract from a 
book written by Thomas Merz titled <b>PostScript and Acrobat/PDF</b>, 
available in English and German. 
<p>
<p>
<hr>
<h1><a name="Copyright">Copyright</a></h1>
The <b>About</b> menu item shows the GSview copyright message 
and GSview version number. 
<p><pre>
 GSVIEW.EXE - A Ghostscript graphical interface
 Copyright (C) 1993-2002, Ghostgum Software Pty Ltd.  All rights reserved.
</pre>
<p>This file is part of GSview. 
<p>This program is distributed with NO WARRANTY OF ANY KIND.  No author 
or distributor accepts any responsibility for the consequences of using it, 
or for whether it serves any particular purpose or works at all, unless he 
or she says so in writing.  Refer to the GSview Free Public Licence 
(the "Licence") for full details. 
<p>Every copy of GSview must include a copy of the Licence, normally in a 
plain ASCII text file named LICENCE.  The Licence grants you the right 
to copy, modify and redistribute GSview, but only under certain conditions 
described in the Licence.  Among other things, the Licence requires that 
the copyright notice and this notice be preserved on all copies. 
<p><pre>
    Author: Russell Lang, Ghostgum Software Pty Ltd
  Internet: gsview@ghostgum.com.au
</pre>
<p>Please read the <a href="#Common_Problems">Common Problems</a> topic, the GSview Readme.htm and browse 
the <a href="#World_Wide_Web">WWW</a> page before sending mail to the author. 
<p>GSview uses pstotext in an external DLL. pstotext was written by 
Andrew Birrell and Paul McJones.  It is 
<pre>
  Copyright (C) 1995-1996, Digital Equipment Corporation.
</pre>
<p>See the licence in pstotext.txt or pstotext.zip for more details. 
If you do not agree to the pstotext licence, delete pstotext.zip, 
pstotxt2.dll and pstotxt3.dll. 
<p>
<p>
<hr>
<h1><a name="Common_Problems">Common Problems</a></h1>
<b>Problem:</b> Can't load Ghostscript DLL ... 
<p>GSview requires the Ghostscript DLL 
(gsdll2.dll for OS/2, gsdll32.dll for Win32). 
This error message usually occurs if you don't have Ghostscript, 
or if GSview can't find Ghostscript. 
<p>From the GSview menu select <a href="#Options">Options</a> | <a href="#Advanced_Configure">Advanced Configure</a> 
and enter the correct <a href="#Advanced_Configure">Ghostscript DLL</a> path. For example 
<pre>
 c:\gs\gsN.NN\bin\gsdll32.dll
</pre>
<p>This message also occurs if Ghostscript cannot find its 
initialisation files (e.g. gs_init.ps).  Set the 
<a href="#Advanced_Configure">Ghostscript Include Path</a> correctly. 
<p>If using Win32s, make sure you don't already have a copy of 
the Ghostscript DLL loaded by another copy of GSview. 
Only one copy of Ghostscript DLL can be loaded by Win32s at a time. 
<p>If you can't get GSview to run Ghostscript DLL correctly, make sure 
you can configure and run Ghostscript on its own. 
<p><b>Problem:</b> Ghostscript Messages window says 
<b>Can't find initialization file gs_init.ps</b>. 
<p>Set the <a href="#Advanced_Configure">Ghostscript Include Path</a> to point to the directory containing 
the correct gs_init.ps. 
<p><b>Problem:</b> Ghostscript Messages window says 
<b>gs: Interpreter revision (XXX) does not match gs_init.ps revision (YYY)</b>. 
<p>Set the <a href="#Advanced_Configure">Ghostscript Include Path</a> to point to the directory containing 
the correct gs_init.ps. 
Don't try to display a PostScript file in the directory of an old 
version of Ghostscript (which will cause the old gs_init.ps to be 
loaded irrespective of the <a href="#Advanced_Configure">Ghostscript Include Path</a>). 
<p><b>Problem:</b> Ghostscript Messages window says 
<b>Wrong version of DLL found.  Found version XXX  Need version YYY</b>. 
<p>GSview found the wrong Ghostscript DLL.  Install the required 
version of the Ghostscript DLL.  Make sure you have only one copy 
of the Ghostscript DLL on your system. 
<p><b>Problem:</b> GSview says that a multipage PostScript file produced 
by MS-Windows contains 0 pages and will only show the first page. 
<p>This is because the document does not have correct DSC comments. 
From the Control Panel, select <b>Printers</b>, <b>Options...</b>, then in the 
<b>Print to</b> group box click on the <b>Printer</b> radio button.  You cannot 
use the <b>Print To</b> <b>Encapsulated PostScript File</b> for printing 
multipage files.  The correct method is to connect the printer 
to <b>FILE:</b>. 
In addition, 
from the Control Panel select <b>Printers</b>, <b>Options...</b>, <b>Advanced</b> and 
then check <b>Conform to Adobe Document Structuring Convention</b>. 
<p>The DSC comment <b>%%Pages: 0</b> means that the document does not produce 
any pages.  That is, the PostScript <b>showpage</b> operator is not used. 
If you find a PostScript document that has multiple pages and contains 
the <b>%%Pages: 0</b> comment, change the first line from <b>%!PS-Adobe-</b> to <b>%!</b>. 
GSview will then ignore the DSC comments and allow you to view all 
pages, but only in the original order.  Complain to the author of the 
program that produced that PostScript file. 
<p>Some PostScript printer drivers include code that is specific to 
a particular printer.  The PostScript output from these drivers may 
be unportable and may not display in GSview.  If you are having this 
problem, try using a reasonably generic PostScript driver such as 
<b>Apple LaserWriter II NT</b> for PostScript level 2 printers, or 
<b>Apple LaserWriter Plus</b> for PostScript level 1 printers. 
<p>For Windows 95, open the printer properties then select the 
PostScript tab, then select PostScript Output Format = 
<b>PostScript (optimize for portability - ADSC)</b>. 
<p><b>Problem:</b> GSview says "Page ordering is Special..." 
<p>Your document used the DSC comment <b>%%PageOrder: Special</b> which means 
that pages can not be reliably reordered.  This may prevent GSview 
from displaying pages in any order other than the original order. 
If you continue and reorder the pages, PostScript errors may occur. 
The only way to fix this is to regenerate the PostScript without 
special page ordering. 
<p>By default, Windows 95 creates PostScript files which use special 
page ordering.  To disable this, open the printer properties then 
select the PostScript tab, then select PostScript Output Format = 
<b>PostScript (optimize for portability - ADSC)</b>. 
<p><b>Problem:</b> PostScript files produced by MS-Windows start with a Control-D. 
<p>For Windows 3.1: 
<p>Since this occurs even when the PostScript printer 
<b>Conform to Document Structuring Convention</b> 
checkbox is checked, this must be considered a 
bug in the MS-Windows PostScript printer driver. 
The bug fix is documented in the MS-Windows PRINTERS.WRI file. 
Edit the win.ini file and search for the PostScript printer section. 
There may be more than one.  In each of these sections add 
<b>CTRLD=0</b> as shown below. 
<p><pre>
 [Apple LaserWriter II NT,FILE]
 CTRLD=0
</pre>
<p>For Windows 95: 
<p>The PostScript printer driver setup has an option 
(Properties, PostScript, Advanced) for suppressing 
a ^D at the start of a document. 
Fortunately the default is do not send ^D before job. 
<p><b>Problem:</b> PostScript files produced by Word for Windows 6.0 
cause a "Missing %%Pages comment" message box. 
<p>Congratulations.  You have just found a mistake in the DSC comments 
when Word included an EPS file.  Word should have surrounded the 
included EPS file with the lines 
<pre>
 %%BeginDocument: filename.eps
 %%EndDocument
</pre>
<p>Because Word didn't do this, GSview can't tell how many pages 
are in the document and where they are located. 
<p>Please complain to Microsoft.  There is a problem in the EPSIMP.FLT 
filter version 2.01 which Microsoft needs to fix. 
<p>In the interim, you have two solutions: 
<p>1. Select <a href="#Options">Options</a> | <a href="#Ignore_DSC">Ignore DSC</a> 
<p>2. Edit the PostScript file to correct the DSC comments. 
Search the PostScript file for all lines containing 
<pre>
  %MSEPS Preamble
</pre>
<p>From each of these lines, search forward for the start of the 
included EPS file which should start with a line like 
<pre>
 %!PS-Adobe-3.0 EPSF-3.0
</pre>
<p>Above these lines add the line 
<pre>
 %%BeginDocument: AddedByHand
</pre>
<p>Then search for all lines containing 
<pre>
 %MSEPS Trailer
</pre>
<p>Above these lines add the line 
<pre>
 %%EndDocument
</pre>
<p>GSview should then be able to display the file correctly. 
<p><b>Problem:</b> GSview doesn't recognise the DSC comments in files 
produced using the Adobe PostScript driver 4.10 for Windows 32-bit. 
<p>Do not use Tagged binary communications protocol. 
Change this to "Printers | PostScript tab | Advanced... | 
Data format group box | ASCII data" 
<p><b>Problem:</b> Trying to open any file gives 
<pre>
 <b>Unrecoverable error: configurationerror in setpagedevice</b>
 Failed to open device or install ViewerPreProcess hook: returns -26
 Page size may have been too large or resolution too high.
 Resetting page size and resolution
</pre>
<p>Either the problem described in the error message has occurred, 
in which case you should reduce the page size, resolution, 
depth or a combination of all three. 
Alternatively, you may have used <b>-dFIXEDMEDIA</b> in the Ghostscript 
environment variable GS_OPTIONS.  When using GSview, it is safest 
not to use GS_OPTIONS at all and to use <a href="#Options">Options</a> | 
<a href="#Advanced_Configure">Advanced Configure</a> | <a href="#Advanced_Configure">Ghostscript Options</a> instead. 
<p><b>Problem:</b> GSview hangs or takes a very long time when displaying a file. 
<p>Resolution may have been set too high or page size too large. 
Reduce the resolution to the default 96dpi using 
<b>Media </b>| <a href="#Display_Settings">Display Settings</a>. 
Change the page size with the <a href="#Page_Size">Media</a> menu. 
<p>
<p>
<hr>
<h1><a name="Other_Useful_Programs">Other Useful Programs</a></h1>
<b>RedMon</b> is a Windows 95 and NT port monitor, which allows you 
to redirect a printer port to a program. 
RedMon can be used with Ghostscript and a non-PostScript printer 
to emulate a PostScript printer.  This emulated PostScript printer 
can be shared on a computer network and appears as a PostScript 
printer to network clients.   More details at: 
<pre>
 http://www.cs.wisc.edu/~ghost/redmon/
</pre>
<p>RedMon also includes a command line utility for writing a file 
to a Windows printer queue. 
<p><b>PrintFile</b> by Peter Lerup is a Windows GUI application for 
sending files to a printer.  It provides smart processing for 
text, PostScript and other files.  It is available from: 
<pre>
  http://hem1.passagen.se/ptlerup/
</pre>
<p>See the Ghostscript <a href="#World_Wide_Web">WWW</a> page for more useful programs. 
<p>
<p>
<hr>
<h1><a name="Other_Help_Topics">Other Help Topics</a></h1>
These topics are usually accessed by pressing the <b>Help</b> button 
on a dialog box. 
<p>
<a href="#Show_Messages">Show Messages</a><br>
<a href="#bzip2">bzip2</a><br>
<a href="#zlib">zlib</a><br>
<a href="#Internals">Internals</a><br>
<p>
<hr>
<h2><a name="Show_Messages">Show Messages</a></h2>
GSview uses Ghostscript to display or print PostScript files. 
<b>Show Messages</b> displays the console output from Ghostscript, 
and is most useful when a PostScript error occurs. 
You may need to scroll back to see the start of the error message. 
<p>The text in the <b>Show Messages</b> window can be copied to the clipboard. 
If no text is selected, the entire text will be copied to the clipboard. 
If some text is highlighted, only that text will be copied to the 
clipboard. 
<p>Explanations of some of the error message that may appear in the 
<b>Show Messages</b> are given in the <a href="#Common_Problems">Common Problems</a> topic. 
<p>
<p>
<hr>
<h2><a name="bzip2">bzip2</a></h2>
If you attempt to load a file that has been compressed by bzip2, 
GSview will attempt to load the bzip2 DLL, then uncompress it 
to a temporary file. 
<p>If you get an error message <b>Failed to load bzip2 DLL...</b> then 
you probably don't have the bzip2 DLL available. 
Obtain it from the same place you obtained GSview or from 
<pre>
 ftp://mirror.cs.wisc.edu/pub/mirrors/ghost/ghostgum/
</pre>
<p>Place the bzip2 DLL in the same directory as the GSview EXE. 
libbz2.dll is for Win32.  At this stage there is no bzip2 DLL 
for Win16 or OS/2. 
<p>bzip2 is Copyright 1996-2000 by Julian Seward 
The source code can be obtained from 
<pre>
 http://sourceware.cygnus.com/bzip2/index.html
</pre>
<p>
<p>
<hr>
<h2><a name="zlib">zlib</a></h2>
If you attempt to load a file that has been compressed by gzip, 
GSview will attempt to load the zlib DLL, then uncompress it 
to a temporary file. 
<p>If you get an error message <b>Failed to load zlib DLL...</b> then 
you probably don't have the zlib DLL available. 
Obtain it from the same place you obtained GSview or from 
<pre>
 ftp://mirror.cs.wisc.edu/pub/mirrors/ghost/ghostgum/
</pre>
<p>Place the zlib DLL in the same directory as the GSview EXE. 
zlib16.dll is for Win16.  zlib32.dll is for Win32. 
zlib2.dll is for OS/2. 
<p>zlib is Copyright 1995-1996 by Jean-loup Gailly and Mark Adler. 
The source code can be obtained from 
<pre>
 http://www.info-zip.org/pub/infozip/zlib/
</pre>
<p>
<p>
<hr>
<h2><a name="Internals">Internals</a></h2>
GSview uses the AFPL Ghostscript DLL to render PostScript files. 
<p>Under Win32s, the GS DLL can be used by only one application at a 
time.  Under Windows 95, Windows NT and OS/2, the GS DLL can be used 
by many applications at a time (provided you have enough memory). 
When using Win32s, GSview must unload the GS DLL while it is being 
used by gvwgs.exe for printing. 
<p>gsv16spl.exe is a 16 bit Windows application used by GSview to spool 
files from GSview Win32s.  gsv16spl can not be used on its own - it 
must be started by GSview.  It is not used by Windows 95 or NT. 
<p>gvwgs32.exe (Windows) and gvpgs.exe (OS/2) are GS DLL loaders for 
printing.  It would be possible to use them from the command line, 
but since they delete the files listed on the command line 
it would be safer to use gswin32.exe (Win32), gswin32c.exe 
(Win32 console) or gsos2.exe (OS/2). 

<p><hr>Created automatically by doc2html
</body>
</html>
