<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>GSview Hjälp</title>
</head>
<body>
<h1>GSview Hjälp</h1>
<hr>
<h1><a name="&#214;versikt">&#214;versikt</a></h1>
<b>GSview</b> &#228;r ett grafiskt interface f&#246;r Ghostscript under MS-Windows, 
OS/2 och GNU/Linux. 
Ghostscript &#228;r en tolk f&#246;r sidobeskrivningsspr&#229;ket PostScript 
som anv&#228;nds av laserskrivare. 
F&#246;r dokument som f&#246;ljer Adobe's PostScript Document Structuring Conventions, 
till&#229;ter GSview att valda sidor visas eller skrivs ut. 
GSview 4.3 kr&#228;ver Ghostscript 7.04 - 8.09. 
<p>
<a href="#Installation">Installation</a><br>
<a href="#Registrering">Registrering</a><br>
<a href="#Document_Structuring_Conventions">Document Structuring Conventions</a><br>
<a href="#Portabelt_Dokument_Format">Portabelt Dokument Format</a><br>
<a href="#&#214ppna_ett_Dokument">&#214ppna ett Dokument</a><br>
<a href="#Sid_Val">Sid Val</a><br>
<a href="#Dokument_Information">Dokument Information</a><br>
<a href="#Utskrift">Utskrift</a><br>
<a href="#Konverteringar">Konverteringar</a><br>
<a href="#M&#228ta">M&#228ta</a><br>
<a href="#Optioner">Optioner</a><br>
<a href="#Sidorientering">Sidorientering</a><br>
<a href="#Display_Inst&#228llningar">Display Inst&#228llningar</a><br>
<a href="#Sidstorlek">Sidstorlek</a><br>
<a href="#Tangenter">Tangenter</a><br>
<a href="#Kommandorads_optioner">Kommandorads optioner</a><br>
<a href="#World_Wide_Web">World Wide Web</a><br>
<a href="#Copyright">Copyright</a><br>
<a href="#Vanliga_Problem">Vanliga Problem</a><br>
<a href="#Andra_Anv&#228ndbara_Program">Andra Anv&#228ndbara Program</a><br>
<a href="#Andra_Hj&#228lp_&#196mnen">Andra Hj&#228lp &#196mnen</a><br>
<p>
<hr>
<h1><a name="Installation">Installation</a></h1>
Det rekommenderas att du anv&#228;nder installationsprogrammet <b>setup.exe</b> 
f&#246;r att installera GSview. 
Du m&#229;ste installera Ghostscript separat. 
<p>Om du vill installera GSview manuellt, titta i &#228;mnet <a href="#Manuell_Installation">Manuell Installation</a>. 
<p>Konfiguration kommer att dyka upp f&#246;rsta g&#229;ngen GSview k&#246;rs. 
Om du vill &#228;ndra konfigurationen senare, anv&#228;nd 
<a href="#Optioner">Optioner</a> | <a href="#Enkel_Konfiguration">Enkel Konfiguration</a> eller 
<a href="#Optioner">Optioner</a> | <a href="#Avancerad_Konfiguration">Avancerad Konfiguration</a>. 
<p>Se ocks&#229; <a href="#Optioner">Optioner</a> | <a href="#Språk">Spr&#229;k</a>. 
<p>
<a href="#H&#228mta_Ghostscript">H&#228mta Ghostscript</a><br>
<a href="#Ghostscript_Installation">Ghostscript Installation</a><br>
<a href="#Avinstallera_GSview">Avinstallera GSview</a><br>
<a href="#Manuell_Installation">Manuell Installation</a><br>
<a href="#Avancerad_Manuell_Installation">Avancerad Manuell Installation</a><br>
<a href="#N&#228tverk_Installation">N&#228tverk Installation</a><br>
<a href="#K&#246ra_GSview_fr&#229n_Filhanteraren_eller_Windows_Utforskaren">K&#246ra GSview fr&#229n Filhanteraren eller Windows Utforskaren</a><br>
<p>
<hr>
<h2><a name="H&#228;mta_Ghostscript">H&#228;mta Ghostscript</a></h2>
GSview kr&#228;ver AFPL Ghostscript.  GSview eller Ghostscript 
&#228;r tillg&#228;ngliga separat fr&#229;n 
<pre>
 http://www.cs.wisc.edu/~ghost/
</pre>
<p>F&#246;r att konfigurera GSview, h&#228;mta och installera b&#229;de Ghostscript 
och GSview, k&#246;r sedan GSview. 
<p>
<p>
<hr>
<h2><a name="Ghostscript_Installation">Ghostscript Installation</a></h2>
AFPL Ghostscript f&#246;r Win32 &#228;r tillg&#228;ngligt som ett sj&#228;lvuppackade 
arkiv som installerar sig sj&#228;lv. 
F&#246;r detaljer om hur du installerar Ghostscript manuellt, var v&#228;nlig l&#228;s 
Ghostscript dokumentationsfilerna Install.htm och Use.htm 
<p>
<p>
<hr>
<h2><a name="Avinstallera_GSview">Avinstallera GSview</a></h2>
F&#246;r att avinstallera GSview fr&#229;n Windows 95 eller NT 4.0, 
anv&#228;nd <b>L&#228;gg till/Ta bort Program</b> fr&#229;n Windows <b>Kontrollpanel</b>. 
<p>
<a href="#Manuell_avinstallation">Manuell avinstallation</a><br>
<p>
<hr>
<h3><a name="Manuell_avinstallation">Manuell avinstallation</a></h3>
F&#246;r att avinstallera GSview, ta bort filerna i <b>gsview </b> katalogen. 
Ta ocks&#229; bort 
<pre>
 c:\windows\gsview32.ini
</pre>
<p>fr&#229;n den aktuella systemkatalogen. 
<p>F&#246;r Windows NT kan det ocks&#229; bli n&#246;dv&#228;ndigt att ta bort gsview32.ini 
fr&#229;n anv&#228;ndarnas profilkataloger. 
<p>Ta bort gruppen <b>Ghostgum</b> fr&#229;n Programhanteraren eller Startmenyn 
<p>Om du vet hur man editerar registret, ta bort f&#246;ljande nycklar: 
<pre>
 HKEY_CLASSES_ROOT\psfile
 HKEY_CLASSES_ROOT\.eps
 HKEY_CLASSES_ROOT\.ps
 HKEY_CLASSES_ROOT\MIME\Database\Content Type\application/postscript
</pre>
<p>Om du associerade PDF med GSview m&#229;ste du ocks&#229; ta bort 
<pre>
 HKEY_CLASSES_ROOT\pdffile
 HKEY_CLASSES_ROOT\.pdf
 HKEY_CLASSES_ROOT\MIME\Database\Content Type\application/pdf
</pre>
<p>Den b&#228;sta metoden att avinstallera Ghostscript &#228;r att 
anv&#228;nda <b>L&#228;gg till/Ta bort Program</b> fr&#229;n Windows <b>Kontrollpanel</b>. 
<p>F&#246;r att avinstallera Ghostscript manuellt, ta bort filerna i <b>gsN.NN</b> 
katalogen d&#228;r N.NN &#228;r versionsnumret f&#246;r Ghostscript. 
<p>
<p>
<hr>
<h2><a name="Manuell_Installation">Manuell Installation</a></h2>
Det rekommenderas att du anv&#228;nder installationsprogrammet f&#246;r att installera 
GSview.  F&#246;ljande instruktioner beskriver hur du installerar GSview 
utan att anv&#228;nda installationsprogrammet. 
<p>S&#228;tt milj&#246;variabeln TEMP s&#229; att den pekar mot en katalog f&#246;r 
tempor&#228;ra filer.  Till exempel: 
<pre>
  SET TEMP=c:\temp
</pre>
<p>Katalogen m&#229;ste existera och f&#229;r inte vara skrivskyddad. 
<p>F&#246;rst m&#229;ste du installera Ghostscript, plus dess katalogfiler och fonter. 
Du beh&#246;ver en version av Ghostscript listad i <a href="#Översikt">&#214;versikt</a>. 
Den h&#228;r versionen av GSview kommer inte att fungera ihop med andra versioner av Ghostscript. 
Installera Ghostscript i en katalog c:\gs\gsN.NN 
(Byt ut N.NN med Ghostscript's versions nummer.) 
<p>G&#246;r en katalog c:\ghostgum\gsview 
<p>N&#228;sta installation av 
GSview f&#246;r Windows genom att kopiera gsview32.exe, gsv16spl.exe, gvwgs32.exe, 
gsvw32de.dll, gsvw32es.dll, gsvw32fr.dll, gsvw32it.dll, 
gsviewen.hlp, gsviewde.hlp, gsviewes.hlp, gsviewfr.hlp, gsviewit.hlp 
och printer.ini 
till katalogen <b>c:\ghostgum\gsview</b>. 
<p>Starta GSview och v&#228;lj till&#228;mplig version av Ghostscript 
(normalt den senaste).  F&#246;r att &#228;ndra detta senare, anv&#228;nd 
<a href="#Optioner">Optioner</a> | <a href="#Enkel_Konfiguration">Enkel Konfiguration</a>. 
<p>F&#246;r st&#246;rre kontroll &#246;ver konfigurationen, se <a href="#Avancerad_Manuell_Installation">Avancerad Manuell Installation</a>. 
<p>
<p>
<hr>
<h2><a name="Avancerad_Manuell_Installation">Avancerad Manuell Installation</a></h2>
Ist&#228;llet f&#246;r att anv&#228;nda <a href="#Optioner">Optioner</a> | <a href="#Enkel_Konfiguration">Enkel Konfiguration</a>, anv&#228;nd 
<a href="#Optioner">Optioner</a> | <a href="#Avancerad_Konfiguration">Avancerad Konfiguration</a>. 
<p>S&#228;tt f&#246;rst de tre textf&#228;lten korrekt (se <a href="#Avancerad_Konfiguration">Avancerad Konfiguration</a>). 
<p>I dialogen <a href="#Avancerad_Konfiguration">Avancerad Konfiguration</a>, v&#228;lj antingen checkboxarna 
<b>Kopiera skrivarstandard</b>, <b>Associera .ps filer med GSview</b> och 
<b>Skapa objekt p&#229; Startmenyn</b>, eller utf&#246;r f&#246;ljande tre steg. 
<p>1. Avsluta GSview, g&#246;r sedan en append av printer.ini till GSview INI filen 
(c:\windows\gsview32.ini) 
<p>2. L&#228;gg till .ps och .eps (och eventuellt .pdf) filtyperna till <a href="#Köra_GSview_från_Filhanteraren_eller_Windows_Utforskaren">Registret</a>. 
<p>3. Skapa ett Program Manager objekt eller l&#228;gg till GSview i Startmenyn. 
<p>Om du har n&#229;gra Typ 1 fonter i ditt system, &#228;r det m&#246;jligt att tala om f&#246;r 
Ghostscript att anv&#228;nda dom.  Se <b>Fontmap.os2</b> och <b>Fontmap.atm</b> 
som &#228;r bifogade med Ghostscript f&#246;r exempel.  Se &#228;mnet <b>Fonter</b>. 
<p>Om du har problem, f&#246;rs&#246;k l&#228;sa &#228;mnet <a href="#Vanliga_Problem">Vanliga Problem</a> i hj&#228;lpen. 
<p>
<p>
<hr>
<h2><a name="N&#228;tverk_Installation">N&#228;tverk Installation</a></h2>
Installera GSview till en n&#228;tverkskatalog. 
<p>N&#228;r en anv&#228;ndare startar GSview f&#246;r f&#246;rsta g&#229;ngen, eller startar GSview 
efter att versionsnumret har &#228;ndrats, kommer GSview att konfigurera 
den lokala datorn. 
<p>Att anv&#228;nda en UNC s&#246;kv&#228;g n&#228;r GSview installeras kommer inte att fungera 
f&#246;r Windows 3.1, men fungerar fr&#229;n och med Windows 95. 
<p>GSview f&#246;rs&#246;ker underh&#229;lla en konfigurationsfil f&#246;r varje anv&#228;ndare. 
Om anv&#228;ndarprofiler anv&#228;nds under Windows 95 eller NT, kommer 
GSview att spara INI filerna i anv&#228;ndarens profilkatalog, 
som specificerats i registret.  Om den inte kan hittas, 
och milj&#246;variabeln USERPROFILE &#228;r definierad och &#228;r en katalog, 
kommer GSview att spara INI filen i den katalogen. 
Om det skulle misslyckas, kommer GSview att spara INI filen p&#229; en standard 
plats, i Windows katalog. 
Om anv&#228;ndarens profilkatalog existerar, men &#228;r skrivskyddad, 
kommer GSview att f&#229; problem. 
<p>Om du &#246;nskar hindra GSview fr&#229;n att visa <a href="#Enkel_Konfiguration">Enkel Konfiguration</a> 
n&#228;r GSview startas f&#246;rsta g&#229;ngen, eller n&#228;r GSview uppgraderas, 
placera en INI fil i GSview katalogen. 
<b>Kom ih&#229;g att ta bort filen innan du uppgraderar GSview i framtiden.</b> 
Den skall endast inneh&#229;lla poster som du vill skall bytas ut i 
anv&#228;ndarnas konfigurationer. 
Den f&#246;rslagna tekniken &#228;r att installera GSview, och sedan konfigurera den. 
Kopiera gsview32.ini eller gvpm.ini fr&#229;n systemkatalogen eller din 
anv&#228;ndares profilkatalog till GSview katalogen, editera den sedan och ta bort 
alla poster utom f&#246;r: 
<pre>
 [Options]
 Version=4.3
 GSversion=704
 Configured=1
 GhostscriptDLL=e:\gs\gs7.04\bin\gsdll32.dll
 GhostscriptInclude=e:\gs\gs7.04\lib;e:\gs\fonts
 GhostscriptOther=-dNOPLATFONTS -sFONTPATH="c:\psfonts"
</pre>
<p>N&#228;r en anv&#228;ndare startar GSview, kommer deras INI fil normalt att anv&#228;ndas. 
Den f&#246;rsta g&#229;ngen GSview k&#246;rs, eller n&#228;r GSview versionen inte 
matchar INI filen, kommer f&#246;ljande att ske: 
<p>1. INI filen i GSview katalogen kommer att l&#228;sas, och k&#246;r &#246;ver 
anv&#228;ndarens INI fil. 
<p>2. Listan &#246;ver skrivare kommer att uppdateras fr&#229;n printer.ini i 
GSview katalogen. 
<p>3. Filassociationer (.ps, .eps, .pdf) kommer INTE att utf&#246;ras eller &#228;ndras. 
Om du vill &#228;ndra dessa m&#229;ste du anv&#228;nda <a href="#Optioner">Optioner</a> | <a href="#Avancerad_Konfiguration">Avancerad Konfiguration</a>. 
<p>4. Program Manager grupper / Startmeny objekt / Program objekt 
kommer INTE att &#228;ndras. 
Om du vill &#228;ndra dessa m&#229;ste du anv&#228;nda <a href="#Optioner">Optioner</a> | <a href="#Avancerad_Konfiguration">Avancerad Konfiguration</a>. 
<p>Om du installerar p&#229; Windows NT4/2000, och v&#228;ljer "Alla Anv&#228;ndare", 
kommer installationsprogrammet att skriva gsview32.ini till din GSview 
katalog.  Du m&#229;ste installera Ghostscript f&#246;rst. 
<p>Om en anv&#228;ndare f&#246;rs&#246;ker anv&#228;nda GSview's avinstallationsprogram, kommer det 
att f&#246;rs&#246;ka radera GSview och Ghostscript filer i n&#228;tverket. 
Se till att katalogerna f&#246;r GSview och Ghostscript inte &#228;r skrivbara 
f&#246;r anv&#228;ndarna. 
F&#246;r att vara extra s&#228;ker, kanske du vill ta ta bort filen <b>uninstal.txt</b> fr&#229;n 
GSview katalogen. 
<p>Alternativt, om du vill installera GSview p&#229; varje dator utan 
n&#229;gra fr&#229;gor, g&#246;r en unzip av det sj&#228;lvuppackande arkivet och k&#246;r sedan setup 
programmet p&#229; f&#246;ljande s&#228;tt: 
<pre>
 setup -namn "Ditt Namn" -nummer XXXXX-XXXXX "c:\ghostgum"
</pre>
<p>
<p>
<hr>
<h2><a name="K&#246;ra_GSview_fr&#229;n_Filhanteraren_eller_Windows_Utforskaren">K&#246;ra GSview fr&#229;n Filhanteraren eller Windows Utforskaren</a></h2>
Om du anv&#228;nde GSview's setup.exe program och svarade <b>ja</b> p&#229; 
alla fr&#229;gor, har f&#246;ljande konfiguration redan &#228;gt rum. 
Om du inte uppdaterade registret under GSview's installation, 
kommer f&#246;ljande information att f&#246;rklara hur du g&#246;r det manuellt. 
<p>F&#246;r att k&#246;ra GSview n&#228;r en PostScriptfil har dubbelklickats i 
Filhanteraren, m&#229;ste f&#246;ljande sekvens anv&#228;ndas f&#246;r att l&#228;ra 
Filhanteraren att anv&#228;nda PostScriptfiler. 
<p>Fr&#229;n <b>Program Manager</b>, k&#246;r Registrerings Info Editor genom att anv&#228;nda 
<b>Arkiv </b>| <b>K&#246;r...</b> skriv sedan <b>regedit</b>. 
Fr&#229;n <b>Registrerings Info Editor</b> v&#228;lj <b>Editera </b>| <b>L&#228;gg till Filtyp...</b> 
och l&#228;gg till v&#228;rden i f&#246;ljande f&#228;lt: 
<pre>
 Identifier = psfile
 Filetype = PostScript
 Action = Open
 Command = c:\ghostgum\gsview\gsview32 %1
 Uses DDE = unchecked
 Action = Print
 Command = c:\ghostgum\gsview\gsview32 /p %1
 Uses DDE = unchecked
</pre>
<p>Tryck sedan <b>OK</b>. 
<p>Fr&#229;n <b>Filhanteraren</b>, v&#228;lj <b>Arkiv </b>| <b>Associera</b> och 
ange v&#228;rden i f&#246;ljande f&#228;lt: 
<pre>
 Filer med &#228;ndelse = ps
 Associera med = PostScript (gsview)
</pre>
<p>Tryck sedan <b>OK</b>. 
<p>Det var allt!  Nu n&#228;r du kan dubbelklicka p&#229; en PostScriptfil, 
kan <b>Filhanteraren</b> k&#246;ra GSview.  N&#228;r du sl&#228;pper en PostScript 
fil p&#229; <b>Utskriftshanteraren</b>, kommer GSview att skriva ut filen. 
Om du har en PostScriptskrivare, &#228;r detta inte anv&#228;ndbart. 
I det fallet m&#229;ste du ta bort Utskriftshanteringen fr&#229;n registret. 
<p>F&#246;r Windows 95, utf&#246;rs konfigurationen ist&#228;llet genom att anv&#228;nda Windows 
Utforskaren. 
<p>Starta <b>Windows Utforskaren</b>.  V&#228;lj <b>Visa </b>| <b>Optioner </b>.  V&#228;lj 
tabben <b>Filtyper</b>.  V&#228;lj knappen <b>Ny Typ</b>. 
Ange v&#228;rden i f&#246;ljande f&#228;lt: 
<pre>
 Description of type = PostScript
 Associated Extension = PS EPS
</pre>
<p>Tryck knappen <b>Ny</b>, ange sedan 
<pre>
 Action = open
 Applikation som anv&#228;nds f&#246;r att utf&#246;ra = c:\ghostgum\gsview\gsview32.exe
</pre>
<p>Tryck p&#229; <b>OK</b> knappen 
<p>Tryck p&#229; knappen <b>Ny</b>, ange sedan 
<pre>
 Action = print
 Applikation som anv&#228;nds f&#246;r att utf&#246;ra = c:\ghostgum\gsview\gsview32.exe /p
</pre>
<p>Tryck p&#229; <b>OK</b> knappen 
<p>Tryck p&#229; knappen <b>Avsluta </b>. 
<p>Tryck p&#229; knappen <b>Avsluta </b>. 
<p>
<p>
<hr>
<h1><a name="Registrering">Registrering</a></h1>
Om du vill st&#246;dja utecklingen av GSview eller vill 
bli av med GSview's p&#229;minnelsesk&#228;rm, var v&#228;nlig &#246;verv&#228;g registrering 
av GSview.  Det &#228;r inte n&#246;dv&#228;ndigt f&#246;r dig att registrera GSview. 
GSview har gjorts tillg&#228;nglig med Aladdin Free Public Licence, 
som finns i filen <b>LICENCE</b>. 
Den medger fri anv&#228;ndning, men begr&#228;nsar kommersiell distribution. 
<p>Registreringsavgiften &#228;r f&#246;r n&#228;rvarande AUD$40. 
GSview kan registreras online p&#229; 
<pre>
 http://www.ghostgum.com.au/
</pre>
<p>eller via fax eller mail av 
registreringsblanketten vilken finns i filen <b>regorder.txt</b> 
i GSview's katalog. 
Ghostgum Software f&#246;redrar att du anv&#228;nder online registreringen. 
<p>
<p>
<hr>
<h1><a name="Document_Structuring_Conventions">Document Structuring Conventions</a></h1>
Adobe har definierat ett set av ut&#246;kade kommentars konventioner som medger 
ytterligare information om sidostruktur och resurskrav hos en PostScriptfil. 
Om filen inneh&#229;ller dessa Document Structuring Convention (DSC) kommentarer, 
kan GSview visa sidor i godtycklig ordning genom att anv&#228;nda <b>G&#229; till Sida</b> och visa sidor 
i omv&#228;nd ordning anv&#228;ndande <a href="#Sid_Val">F&#246;reg&#229;ende Sida</a>.  Valda sidor kan extraheras till en annan 
fil eller skrivas ut. 
<p>Om en fil inte inneh&#229;ller DSC kommentarer, kan GSview endast visa sidorna 
i originalordning. 
<p>DSC konforma filer startar med kommentarsraden: 
<pre>
 %!PS-Adobe-3.0
</pre>
<p>d&#228;r numret 3.0 kan &#228;ndras och &#228;r ett DSC versionsnummer. 
Vissa program skriver PostScriptfiler med ett control-D som f&#246;rsta 
tecken i filen, f&#246;ljt av en kommentarsrad som n&#228;mnts ovan. 
GSview kommer korrekt att rapportera att dessa filer inte &#228;r DSC konforma, 
men kommer fortfarande att presentera dom med sidovalsalternativen tillg&#228;ngliga. 
Klaga hos f&#246;rfattaren av programmet som producerade PostScriptfilen. 
F&#246;r att g&#246;ra filen DSC konform, editera den eller ta bort control-D tecknet. 
<p>DSC konforma filer inneh&#229;ller rader som: 
<pre>
 %%Pages: 24
 %%Page: 1 1
</pre>
<p>Dessa rader talar om f&#246;r GSview hur m&#229;nga sidor ett dokument inneh&#229;ller och var 
dom startar.  GSview anv&#228;nder informationen f&#246;r att v&#228;lja individuella sidor. 
<p>Encapsulated PostScriptfiler (EPSF) &#228;r enkelsidiga dokument 
som inneh&#229;ller ett subset av <b>DSC</b> kommentarer och PostScript kommandon. 
EPS filer startar med kommentarsraden: 
<pre>
 %!PS-Adobe-3.0 EPSF-3.0
</pre>
<p>EPS filer &#228;r vanligtvis anv&#228;nda inbakade i andra dokument och 
av det sk&#228;let beh&#246;ver de bounding box kommentarerna: 
<pre>
  %%BoundingBox: llx lly urx ury
</pre>
<p>d&#228;r llx, lly, urx och ury &#228;r heltal som ger x och y koordinater 
f&#246;r det l&#228;gre v&#228;nstra och &#246;vre h&#246;gra h&#246;rnet i en bounding box som inkluderar 
alla markeringar gjorda p&#229; sidan. 
<p>Vissa EPS filer inneh&#229;ller en f&#246;rhandsvisning av ett PostScript dokument. 
Denna f&#246;rhandsvisning kan vara en Windows Metafil, en TIFF fil, eller en Interchange 
f&#246;rhandsvisning (EPSI format). 
F&#246;r Windows Metafil eller TIFF fils f&#246;rhandsvisningen, inneh&#229;ller en EPS fil under DOS 
en bin&#228;r header vilken specificerar lokaliseringen och l&#228;ngden av f&#246;rhandsvisningen och 
PostScript spr&#229;ksektionen hos EPS filen. 
F&#246;r Interchange formatet, &#228;r f&#246;rhandsvisningen inkluderad i DSC kommentarerna 
startande med 
<pre>
 %%BeginPreview: bredd h&#246;jd djup rader
</pre>
<p>En EPS fil med f&#246;rhandsvisning kan skapas fr&#229;n en EPS fil utan f&#246;rhandsvisning 
med hj&#228;lp av <a href="#EPS_Förhandsvisning">L&#228;gg till EPS F&#246;rhandsvisning</a>. 
<p>GSview kan ge varningar n&#228;r dokument inneh&#229;ller felaktiga DSC 
kommentarer.  Detta kan &#228;ndras med <a href="#Optioner">Optioner</a> | <a href="#DSC_Varningar">DSC Varningar</a>. 
<p>
<p>
<hr>
<h1><a name="Portabelt_Dokument_Format">Portabelt Dokument Format</a></h1>
GSview kan visa och skriva ut PDF filer, d&#228;remot finns det ett antal 
begr&#228;nsningar med den nuvarande metoden. 
<p>Under visningen, ignorerar GSview sidstorleken p&#229; Media menyn, 
och anv&#228;nder ist&#228;llet /MediaBox fr&#229;n PDF filen. 
Om <a href="#Optioner">Optioner</a> | <a href="#EPS_Klipp">EPS Klipp</a> &#228;r aktiverat, kommer GSview att anv&#228;nda /CropBox 
fr&#229;n PDF filen. 
<p>GSview beh&#246;ver <a href="#Öppna_ett_Dokument">&#214;ppna</a> en PDF fil f&#246;r att r&#228;kna sidorna.  Om du 
<b>V&#228;ljer</b> filen, kommer GSview inte att kunna g&#246;ra <b>Text Extrahering</b>, 
<a href="#Text_Extrahera_och_Finn">Finn</a>, <b>G&#229; till Sida</b> eller n&#229;gra andra operationen som beh&#246;vs f&#246;r att 
veta hur m&#229;nga sidor som finns i dokumentet. 
<p>pdfmark l&#228;nk support &#228;r primitiv. 
<p>F&#246;r att konvertera en PostScriptfil till en PDF fil, anv&#228;nd <a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Konvertera">Konvertera</a>, 
och v&#228;lj sedan <b>pdfwrite</b> device. 
<p>F&#246;r att konvertera en PDF fil till en PostScriptfil, anv&#228;nd <a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Konvertera">Konvertera</a>, 
och v&#228;lj sedan <b>pswrite</b> device. 
<p><a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Extrahera">Extrahera</a> fungerar inte med PDF filer. 
Extraktion av PDF sidor extraherar PostScript snarare &#228;n PDF. 
<p><p>F&#246;r att batchkonvertera multipla filer, se i 
ps2pdf.bat och pdf2ps.bat 
i Ghostscript's katalog. 
Du kommer att beh&#246;va anv&#228;nda 
gswin32c.exe 
ist&#228;llet f&#246;r gs.exe.  Du kanske ocks&#229; beh&#246;ver s&#228;tta Ghostscript's 
include s&#246;kv&#228;g med <b>-I</b> eller milj&#246;variabeln <b>GS_LIB</b>. 
<p>
<p>
<hr>
<h1><a name="&#214;ppna_ett_Dokument">&#214;ppna ett Dokument</a></h1>
<b>&#214;ppna</b> kommandot i <b>Arkiv</b> menyn &#246;ppnar en fil och visar 
f&#246;rsta sidan. 
<p>Om filen inneh&#229;ller <a href="#Document_Structuring_Conventions">DSC</a> kommentarer, kan sidor v&#228;ljas genom att anv&#228;nda 
<a href="#Sid_Val">N&#228;sta Sida</a>, <a href="#Sid_Val">F&#246;reg&#229;ende Sida</a> och <b>G&#229; till Sida</b>. 
<p>Om filen inte inneh&#229;ller <a href="#Document_Structuring_Conventions">DSC</a> kommentarer, kommer <a href="#Sid_Val">F&#246;reg&#229;ende Sida</a> och <b>G&#229; till Sida</b> 
inte att fungera.  Ingen annan fil skall v&#228;ljas innan sista sidan p&#229; 
filen har visats. 
<p>N&#228;r en fil &#228;r &#246;ppen, kommer GSview att visa dokumentets filnamn, 
den aktuella sidan (om tillg&#228;ngligt) och n&#228;r muspekaren f&#246;rs &#246;ver 
bilden, visas placeringen av muspekaren i koordinater specificerade 
med <a href="#Optioner">Optioner</a> | <a href="#Enheter">Enheter</a>.  Koordinaterna kan vara PostScript punkter 
(1/72"), millimeter eller inches. 
Positionen hos muspekaren &#228;r anv&#228;ndbar f&#246;r ber&#228;kning av bounding boxes. 
<p><b>V&#228;lj fil</b> kommandot &#228;r liknande <b>&#214;ppna</b> men visar inte dokumentet. 
Kommandot &#228;r anv&#228;ndbart f&#246;r att &#246;ppna ett dokument innan det skrivs ut. 
<p><b>Spara Som</b> kommandot sparar en kopia av den aktuella dokumentet. 
Detta &#228;r anv&#228;ndbart om GSview anv&#228;nds som en PostScript visare av 
n&#229;gon annan applikation och om du vill spara den aktuella visade filen. 
<p><b>St&#228;ng</b> kommandot st&#228;nger det aktuella &#246;ppnade dokumentet. 
Detta skall g&#246;ras innan den aktuella fillen &#246;ppnas med ett annat 
program. 
Om du inte g&#246;r det och GSview uppt&#228;cker att fill&#228;ngden eller datumet 
har &#228;ndrats, kommer den att st&#228;nga Ghostscript och scanna om dokumentet. 
<p>Se ocks&#229; <a href="#Utskrift">Skriv ut</a>. 
<p>
<p>
<hr>
<h1><a name="Sid_Val">Sid Val</a></h1>
<b>Visa</b> | <b>N&#228;sta Sida</b> eller <b>+</b> knappen flyttar till n&#228;sta sida hos ett 
dokument. 
Detta fungerar &#228;ven om ett dokument inte inneh&#229;ller n&#229;gra <a href="#Document_Structuring_Conventions">DSC</a> kommentarer. 
<p><b>Visa</b> | <b>F&#246;reg&#229;ende Sida</b> eller <b>-</b> knappen flyttar till den f&#246;reg&#229;ende sidan. 
<p><b>Visa</b> | <b>Uppdatera</b> eller <b>F5</b> tangenten uppdaterar den aktuella sidan. 
<p><b>Visa</b> | <b>G&#229; till Sidan</b> eller <b>pekande hand</b> knappen visar en dialog box 
som till&#229;ter val av n&#228;sta sidonummer f&#246;r visning. 
<b>Vald Sida</b> dialogen visar sidoetiketteten eftersom den troligtvis 
&#228;r mer anv&#228;ndbar &#228;n sekvensiellt numrerade sidor. 
<p><b>Visa</b> | <b>N&#228;sta Sida och Hem</b> eller mellanslagstangenten flyttar till toppen av 
n&#228;sta sida av dokumentet. 
<p><b>Visa</b> | <b>F&#246;reg&#229;ende Sida och Hem</b> eller BackSpace tangenten flyttar till 
toppen av f&#246;reg&#229;ende sida. 
<p><b>F&#246;reg&#229;ende Sida</b>, <b>Uppdatera</b> och <b>G&#229; till Sida</b> kommandona fungerar endast om 
dokumenten inneh&#229;ller <a href="#Document_Structuring_Conventions">DSC</a> kommentarer. 
<p><b>Visa</b> | <b>Anpassa F&#246;nster</b> eller <b>F6</b> tangenten &#228;ndrar display uppl&#246;sningen 
att anpassar hela sidan inom aktuellt f&#246;nster.  Upprepad anv&#228;ndning 
orskar att antingen bredden eller h&#246;jden p&#229; sidan kommer att anpassas till det aktuella 
f&#246;nstret. 
<p><b>Visa</b> | <b>Full Sk&#228;rm</b> eller <b>F4</b> tangenten visar full sk&#228;rm 
(utan titelrad, scrollningslister etc.). 
F&#246;r att &#229;terg&#229; till normal visning, tryck Escape tangenten. 
<p>
<p>
<hr>
<h1><a name="Dokument_Information">Dokument Information</a></h1>
En informationsarea i toppen av f&#246;nstret anv&#228;nds av GSview f&#246;r att 
visa dokumentets filnamn, det aktuella sidnumret och etikett 
(om tillg&#228;ngligt) och n&#228;r muspekaren f&#246;rs &#246;ver bilden, visas 
placeringen av muspekaren (relativt till det nedre v&#228;nstra h&#246;rnet av 
papperet) i koordinater specificerade med <a href="#Optioner">Optioner</a> | <a href="#Enheter">Enheter</a>. 
Positionen hos muspekaren &#228;r anv&#228;ndbar f&#246;r ber&#228;kning av bounding boxes. 
<p><b>Info</b> kommandet i <b>Arkiv </b>menyn visar en dialog box med f&#246;ljande 
information om <a href="#Document_Structuring_Conventions">DSC</a> kommentarer i det aktuella dokumentet. 
<p><b>Arkiv </b>&#228;r den fulla s&#246;kv&#228;gen till dokumentet. 
<p><b>Typ</b> &#228;r<b> DSC</b>,<b> EPS</b>, <b>Inga DSC kommentarer</b> eller <b>Ignorera DSC Kommentarer</b>. 
<a href="#Document_Structuring_Conventions">EPS</a> &#228;r en Encapsulated PostScriptfil - ett enkelsidigt dokument 
som inneh&#229;ller ett subset av <a href="#Document_Structuring_Conventions">DSC</a> kommentarer och PostScript kommandon. 
<b>EPS </b>filer &#228;r vanligtvis inkluderade i andra dokument. 
<b>Ignorera DSC Kommentar</b> visas om <a href="#Optioner">Optioner</a> | <a href="#Ignorera_DSC">Ignorera DSC</a> 
&#228;r valt. 
Detta kan f&#246;rmarkeras med <b>Ctrl-D f&#246;ljt av</b> eller <b>PJL f&#246;ljt av</b>. 
B&#229;da dessa indikerar att dokumentet inte &#246;verensst&#228;mmer med 
DSC p&#229; grund av att det finns skr&#228;p i b&#246;rjan av dokumentet.  F&#246;r att &#229;tg&#228;rda det f&#246;reg&#229;ende, 
se <a href="#Vanliga_Problem">Vanliga Problem</a>. 
F&#246;r att l&#246;sa det senare, anv&#228;nd ingen HP LaserJet skrivare n&#228;r du skapar 
PostScript dokument f&#246;r distribution till andra. 
<p><b>Titel</b> &#228;r en texttitel som kan anv&#228;ndas f&#246;r att skriva ut banner 
sidor och f&#246;r routing eller f&#246;r igenk&#228;nning av dokument. 
<p><b>Datum</b> &#228;r tiden n&#228;r dokumentet skapades. 
<p><b>Bounding Box</b> specificerar en box som st&#228;nger ner alla markeringar som 
gjorts p&#229; sidan.  Den fyra heltalsv&#228;rdena &#228;r koordinater av de undre 
v&#228;nstra och &#246;vre h&#246;gra h&#246;rnen i bounding box i standard anv&#228;ndarkoordinater (1/72 inch). 
<p><a href="#Sidorientering">Orientering</a> &#228;r standard sidorientering och &#228;r antingen 
<b>Portr&#228;tt </b>eller <a href="#Sidorientering">Landskap</a>.  Se menyn <a href="#Sidorientering">Orientering</a>. 
<p><b>Sidordning</b> &#228;r antingen <b>Stigande</b>, <b>Fallande</b> eller <b>Special</b>. 
Om <b>Sidordning</b> &#228;r <b>Fallande</b>, kommer GSview automatiskt att reversera 
sidorna n&#228;r de visas eller skrivs ut s&#229; att de f&#246;rekommer i stigande ordning. 
Under extrahering eller utskrift, kan GSview instrueras att skriva ut sidorna i fallande (omv&#228;nd) ordning. 
<b>Special</b> betyder att sidorna inte skall ordnas om. 
<p><b>Standard Media</b> ges media namnet f&#246;ljt av bredden och 
h&#246;jden i standard anv&#228;ndar koordinater (1/72 inch). 
<p><b>Sidor</b> &#228;r det totala antalet sidor i ett dokument. 
<p><b>Sida</b> ger sidoetikett och sidonummer. 
<p><b>Bitmap </b>&#228;r storleken p&#229; visad bitmap i pixels vilket kan vara 
anv&#228;ndbart om du kopierar den visade bilden till klippbordet. 
<p>
<p>
<hr>
<h1><a name="Utskrift">Utskrift</a></h1>
<b>Skriv ut</b> kommandot i <b>Arkiv </b>menyn m&#246;jligg&#246;r utskrift av dokumentet 
genom att anv&#228;nda Ghostscript.  Det finns metoder som anv&#228;nds av GSview f&#246;r 
utskrifter: <a href="#Windows_GDI_skrivare">Windows GDI skrivare</a>, <a href="#Ghostscript_device">Ghostscript device</a> 
eller <a href="#PostScript_skrivare">PostScript skrivare</a>. 
<p><a href="#Windows_GDI_skrivare">Windows GDI skrivare</a> anv&#228;nder Ghostscript f&#246;r att skapa bitmappar f&#246;r 
varje sida, och skriver ut dessa genom att anv&#228;nda drivrutinen f&#246;r Windows 
standardskrivare. Detta &#228;r den l&#229;ngsammaste utskriftsmetoden, men b&#246;r fungera med 
de flesta skrivarna. 
<p><a href="#Ghostscript_device">Ghostscript device</a> anv&#228;nder Ghostscript's skrivardrivrutiner. 
Detta &#228;r snabbare, men Ghostscript m&#229;ste ha drivrutiner f&#246;r din skrivare 
och du m&#229;ste veta vad den kallas.  Till exempel, anv&#228;nder HP LaserJet 4 ljet4. 
Se i dokumentationen till Ghostscript f&#246;r fler detaljer. 
<p><a href="#PostScript_skrivare">PostScript skrivare</a> anv&#228;nder inte Ghostscript f&#246;r utskrift av 
PostScriptfiler.  Ist&#228;llet skickas filen direkt till skrivaren. 
<p>Det finns ett betydande samband mellan inst&#228;llningarna 
i utskriftsdialogen.  Till exempel, val av <a href="#Ghostscript_device">Ghostscript device</a> 
avaktiverar knappen med <b>Inst&#228;llningar </b>eftersom detta inte &#228;r relevant. 
Mer detaljer ges i f&#246;ljande &#228;mnen. 
<p>Se ocks&#229; <a href="#Konverteringar">Konverteringar</a> och <a href="#Konvertera">Konvertera</a>. 
<p>
<a href="#V&#228lj_Sidor">V&#228lj Sidor</a><br>
<a href="#Windows_GDI_skrivare">Windows GDI skrivare</a><br>
<a href="#Ghostscript_device">Ghostscript device</a><br>
<a href="#PostScript_skrivare">PostScript skrivare</a><br>
<a href="#Skriv_ut_Fil">Skriv ut Fil</a><br>
<a href="#Inst&#228llningar">Inst&#228llningar</a><br>
<a href="#Sidstorlek_Matchning">Sidstorlek Matchning</a><br>
<p>
<hr>
<h2><a name="V&#228;lj_Sidor">V&#228;lj Sidor</a></h2>
Vid utskrift, kan ett omr&#229;de av sidor v&#228;ljas. 
Inom detta omr&#229;de, kan du v&#228;lja alla sidor, udda eller j&#228;mna sidor. 
Om du v&#228;ljer udda sidor i omr&#229;det 10 till 20, kommer den f&#246;rsta som skrivs ut 
att bli nummer 11. 
<p>Knappen <b>V&#228;lj Sidor</b> kan avaktiveras om den inte st&#246;ds av 
utskriftsmetoden. 
<p>Checkboxen <b>Omv&#228;nt</b> g&#246;r att sidorna skrivs ut i sjunkande 
ordning.  Detta &#228;r aktiverat endast om dokumentet 
inneh&#229;ller <a href="#Document_Structuring_Conventions">DSC</a> kommentarer. 
<p>Om du vill skriva ut valda sidor fr&#229;n ett <a href="#Document_Structuring_Conventions">DSC</a> dokument som 
har en speciell sidordning (t.ex. sidorna kan inte ordnas om), 
v&#228;lj <a href="#Windows_GDI_skrivare">Windows GDI skrivare</a> och<a href="#Ignorera_DSC">Ignorera DSC</a>. 
<p>
<p>
<hr>
<h2><a name="Windows_GDI_skrivare">Windows GDI skrivare</a></h2>
Den anv&#228;nder Ghostscript f&#246;r att skapa en bitmap f&#246;r varje sida, och 
dessa skrivs ut med anv&#228;ndning av Windows skrivardrivrutin. 
Detta b&#246;r fungerar med alla skrivare som st&#246;der rastrerad grafik. 
<p>Som standard, anv&#228;nds en monochrome bitmap f&#246;r maximal hastighet. 
Om du &#246;nskar f&#228;rg, m&#229;ste du aktivera detta med anv&#228;ndning 
av knappen <a href="#Inställningar">Inst&#228;llningar</a>. 
<p>F&#246;r att kontrollera hur GSview hanterar beg&#228;ran fr&#229;n PostScript eller 
PDF dokument att &#228;ndra sidstorleken, se &#228;mnet <b>Sidstorlek Matching</b>. 
<p><b>Optioner </b>&#228;r vanligtvis tomt, men kan inneh&#229;lla Ghostscript kommandoradsoptioner. 
Anv&#228;nds med f&#246;rsiktighet! 
<p>Denna utskriftsmetod till&#229;ter att valda sidor skrivs ut, &#228;ven om 
ett PostScript dokument inte inneh&#229;ller n&#229;gra <a href="#Document_Structuring_Conventions">DSC</a> kommentarer.  Den g&#246;r 
det genom att rendera alla sidor, men s&#228;nder endast de beg&#228;rda till 
skrivaren.  Detta kan vara mycket l&#229;ngsamt. 
<p>
<p>
<hr>
<h2><a name="Ghostscript_device">Ghostscript device</a></h2>
Dialogboxen <b>V&#228;lj Ghostscript Device</b> till&#229;ter val av ett 
Ghostscript skrivardevice och uppl&#246;sning. 
Standardlistan &#246;ver tillg&#228;ngliga devicer och uppl&#246;sningar &#228;r lagrad 
i [Devices] sektionen hos gsview32.ini och tas ifr&#229;n standard 
distributionsversionen av Ghostscript 6.0. 
Du kan anv&#228;nda andra devicer eller uppl&#246;sningar. 
<p>F&#246;r att kontrollera hur GSview hanterar beg&#228;ran fr&#229;n PostScript eller 
PDF dokuments f&#246;r att &#228;ndra sidstorlekarna, se &#228;mnet <a href="#Sidstorlek_Matchning">Sidstorlek Matchning</a>. 
<p>Vissa Ghostscript optioner kan l&#228;ggas till antingen fr&#229;n<b> Optioner</b> 
f&#228;ltet eller knappen <a href="#Inställningar">Inst&#228;llningar</a>. 
<p>Knappen <b>uniprint</b> v&#228;ljer uniprintdevice och visar en lista p&#229; 
tillg&#228;ngliga konfigurationsfiler (*.upp) f&#246;r uniprintdevicet. 
Om du v&#228;ljer en av dessa konfigurationsfiler, kommer konfigurationfilnamnet 
att placeras i f&#228;ltet <b>Optioner </b>f&#246;r Skrivarinst&#228;llningar. 
Se Ghostscript filen <b>Devices.htm</b> f&#246;r detaljer om hur ett uniprintdevice 
skall konfigureras. 
<p>
<p>
<hr>
<h2><a name="PostScript_skrivare">PostScript skrivare</a></h2>
Om <b>PostScript Skrivare</b> &#228;r vald, kommer de valda sidorna att 
skickas direkt till skrivark&#246;n, utan att anv&#228;nda Ghostscript. 
Detta &#228;r liknande <b>Arkiv </b>| <a href="#Skriv_ut_Fil">Skriv ut Fil</a>, undantaget att du kan specificera 
vilka sidor som skall skrivas ut. 
<p>N&#228;r en PostScript skrivare &#228;r ansluten via en seriell port, kr&#228;ver den ibland 
att ett Ctrl+D tecken skall s&#228;ndas efter PostScriptfilen, och beroende p&#229; 
hur v&#228;luppfostrade andra program &#228;r, ibland f&#246;re. 
Detta &#228;r en del av det seriella kommunikationsprotokoll som anv&#228;nds av dessa 
skrivare - det &#228;r inte en del av PostScript. 
Dialogen <b>Inst&#228;llningar </b>till&#229;ter dig att v&#228;lja att skicka Ctrl+D 
f&#246;re och/eller efter PostScriptfilen. 
<p>Vissa PostScript skrivare f&#246;rst&#229;r multipla spr&#229;k, och 
fordrar en prolog f&#246;r att aktivera PostScript l&#228;ge. 
till exempel, HP LaserJet skrivare (med PostScript option) 
erfordrar f&#246;ljande prolog 
<pre>
 ^[%-12345X@PJL JOB
 @PJL ENTER LANGUAGE = POSTSCRIPT
</pre>
<p>och den f&#246;ljande epilogen 
<pre>
 ^[%-12345X@PJL EOJ
 ^[%12345X
</pre>
<p>Prolog och epilog filer till&#229;ter dig att skicka filer till en 
skrivare f&#246;re och efter PostScriptfiler. 
<p>Ett annat anv&#228;ndningsomr&#229;de f&#246;r prolog kan vara att blanda in duplexutskrift 
&lt;&lt; /Duplex true /Tumble false &gt;&gt; setpagedevice 
<p>Om dokumentet &#228;r ett <a href="#Portabelt_Dokument_Format">PDF</a>, kommer Ghostscript att anv&#228;ndas f&#246;r att konvertera 
dokumentet till PostScript vilket sedan kommer att skickas &#246;ver till skrivaren. 
<p>
<p>
<hr>
<h2><a name="Skriv_ut_Fil">Skriv ut Fil</a></h2>
<b>Arkiv | Skriv ut Fil</b> skickar en fil till en lokal port, och blandar inte in 
Windows skrivardrivrutin. 
Detta &#228;r anv&#228;ndbart f&#246;r att skicka ett dokument till en PostScript skrivare, 
eller f&#246;r att skicka en utfil producerad av Ghostscript till en skrivare. 
<p>Alla sidor, individuella sidor eller n&#229;gon kombination kan skrivas ut. 
Knapparna <b>Alla</b>, <b>Udda</b> och <b>J&#228;mna</b> erbjuder snabbval av sidor. 
Om ett enstaka intilliggande block av sidor &#228;r markerat, kommer <b>Udda</b> och <b>J&#228;mna</b> 
knapparna att v&#228;lja udda eller j&#228;mna sidor inom det omr&#229;det. 
Checkboxen <b>Omv&#228;nt</b> g&#246;r att sidorna skrivs ut i sjunkande ordning. 
<p><p>
<p>
<hr>
<h2><a name="Inst&#228;llningar">Inst&#228;llningar</a></h2>
Knappen <b>Inst&#228;llningar</b> till&#229;ter vissa Ghostcript devicer att konfigurera 
extra inst&#228;llningar och en sido offset kan specificeras. 
<p>En sidooffset kan specificeras f&#246;r varje device. 
Sidooffset &#228;r anv&#228;ndbar f&#246;r att korrigera en missanpassning mellan sidoursprung 
hos ett Ghostscript skrivardevice och en speciell skrivare. 
&#214;kning av X v&#228;rdet kommer att &#246;vers&#228;tta bilden mot h&#246;ger. 
&#214;kning av Y v&#228;rdet kommer normalt att &#246;vers&#228;tta bilden ner&#229;t. 
<p><b>Inst&#228;llningar</b> anv&#228;nds vanligtvis f&#246;r att s&#228;tta BitsPerPixel f&#246;r en f&#228;rgskrivare, 
eller andra typer av f&#228;rg och t&#228;thetskorrektion, eller PDF distiller parametrar. 
<p><b>Inst&#228;llningar</b> &#228;r specifika f&#246;r ett speciellt device.  &#196;ndring 
av v&#228;rdet f&#246;r <b>BitsPerPixel</b> egenskapen hos ett device &#228;ndrar den 
inte f&#246;r n&#229;gra andra devicer. 
<p>N&#228;r du trycker <b>OK</b> knappen i dialogenboxen <b>Inst&#228;llningar</b>, 
skrivs de aktuella inst&#228;llningarna till 
gsview32.ini 
<p>filen. 
<p>Vissa <b>Inst&#228;llningar</b> &#228;r f&#246;rdefinierade i GSview, men dessa kanske inte 
matchar de som &#228;r tillg&#228;ngliga i Ghostscript.  Knapparna <b>Editera</b> och <b>Ny</b> 
till&#229;ter dig att modifiera tillg&#228;ngliga <b>Inst&#228;llningar</b> f&#246;r devicet. 
Se &#228;mnet <a href="#Editera_Inställningar">Editera Inst&#228;llningar</a> f&#246;r fler detaljer. 
<p>
<a href="#Editera_Inst&#228llningar">Editera Inst&#228llningar</a><br>
<p>
<hr>
<h3><a name="Editera_Inst&#228;llningar">Editera Inst&#228;llningar</a></h3>
Alla device st&#246;der inte anv&#228;ndningen av ytterligare <a href="#Inställningar">Inst&#228;llningar</a>.  F&#246;r att ta 
reda p&#229; vilka devicer som st&#246;der <a href="#Inställningar">Inst&#228;llningar</a> och vilka <b>Egenskaper</b> k&#228;nns 
igen av varje device, l&#228;s Ghostscript filen Devices.htm eller titta i 
Ghostscript's k&#228;llkod. 
<p>Det finns tv&#229; s&#228;tt att l&#228;gga till eller editera <a href="#Inställningar">Inst&#228;llningar</a>. 
<p>Den f&#246;rsta metoden anv&#228;nder knapparna <b>Editera</b> eller <b>Ny</b> i dialogboxen 
<a href="#Inställningar">Inst&#228;llningar</a>. 
<p>Varje egenskap m&#229;ste vara antingen ett nummer eller en str&#228;ng.  Nummeregenskaper 
&#228;r ekvivalenta med Ghostscript <b>-d</b> kommandoradsoptionen.  Str&#228;ngegenskaper &#228;r ekvivalenta 
med Ghostscript <b>-s</b> kommandoradsoption. 
Varje egenskap best&#229;r av ett <b>Namn</b> och <b>V&#228;rde</b>.  Dessa anv&#228;nds som 
<b>-dNAME=VALUE</b> eller <b>-sNAME=VALUE</b>. 
<b>V&#228;rdet</b> tas fr&#229;n en kommaseparerad lista av <b>V&#228;rden</b> 
angiven i dialogboxen <b>Editera Egenskaper</b>.  Mellanslag f&#229;r inte 
b&#228;ddas in i <b>Namn</b> eller <b>V&#228;rden</b>. 
<p>F&#246;r att radera en egenskap, v&#228;lj den i dialogboxen <a href="#Inställningar">Inst&#228;llningar</a>, 
tryck <b>Editera</b>, och tryck sedan knappen <b>Radera</b> i dialogboxen <b>Editera Egenskaper</b>. 
<p>Den andra metoden &#228;r att manuellt editera GSview's INI fil. 
<p>F&#246;r varje device, m&#229;ste du l&#228;gga till tv&#229; sektioner till 
gsview32.ini 
filen. 
F&#246;ljande exempel visar hur egenskapsinformation l&#228;ggs till 
f&#246;r cdjcolor drivrutinen. 
L&#228;gg f&#246;rst till en sektion vilken ger de nuvarande v&#228;rdena. 
Den sektionen, efter att det f&#246;rsta tecknet &#228;r avl&#228;gsnat, ger de optioner 
som kommer att upptr&#228;da i listboxen <b>Egenskaper</b>. 
Det f&#246;rsta tecknet &#228;r <b>s</b> f&#246;r str&#228;ng eller <b>d</b> f&#246;r nummer. 
<pre>
 [cdjcolor]
 dBitsPerPixel=24
 dDepletion=1
 dShingling=2
 dBlackCorrect=4
</pre>
<p>L&#228;gg sedan till en sektion vilken ger v&#228;rdena som skall visas i 
listboxen <b>V&#228;rden</b>. 
<pre>
 [cdjcolor values]
 dBitsPerPixel=1,3,8,16,24
 dDepletion=1,2,3
 dShingling=0,1,2
 dBlackCorrect=0,1,2,3,4,5,6,7,8,9
</pre>
<p>GSview kommer ocks&#229; att l&#228;gga till v&#228;rdet <b>[Not defined]</b> till listboxen. 
<p>N&#228;r GSview skriver ut en fil, kommer den att ge Ghostscript inneh&#229;llet 
f&#246;r [cdjcolor] sektionen av 
gsview32.ini 
som f&#246;ljer: 
<pre>
 -dBitsPerPixel=24 -dDepletion=1 -dShingling=2 -dBlackCorrect=4
</pre>
<p>Om v&#228;rdet av egenskapen &#228;r <b>[Not defined]</b>, kommer egenskapen inte 
att s&#228;ndas till Ghostscript. 
<p>
<p>
<hr>
<h2><a name="Sidstorlek_Matchning">Sidstorlek Matchning</a></h2>
Om <b>Fast Sidstorlek</b> &#228;r vald (standard), kommer GSview att anv&#228;nda 
sidstorleken p&#229; Mediamenyn och kommer att ignorera f&#246;rs&#246;k fr&#229;n PostScript 
eller PDF dokument att &#228;ndra sidstorlek. 
Detta &#228;r anv&#228;ndbart f&#246;r PDF filer som inneh&#229;ller en mix av portr&#228;tt och 
landskapssidor. 
<p>Om <b>Krymp f&#246;r att passa Sidstorlek</b> &#228;r vald, kommer vilken sidstorlek som 
helst som &#228;r vald av dokumentet, och &#228;r st&#246;rre &#228;n det valda mediat, att bli 
krympt f&#246;r att passa till sidstorleken i Mediamenyn. 
Detta &#228;r anv&#228;ndbart om du vill skriva ut en A4 sida p&#229; 
letter papper (det &#228;r dock en b&#228;ttre id&#233; att k&#246;pa A4 papper). 
<p>Om <b>Variabel Sidstorlek</b> anv&#228;nds kommer GSview att s&#228;tta standardstorleken 
fr&#229;n Mediamenyn, men till&#229;ter sidan att &#228;ndras. 
<p>
<p>
<hr>
<h1><a name="Konverteringar">Konverteringar</a></h1>
Det finns &#229;tskilliga s&#228;tt att konvertera PostScript och PDF filer. 
<p><b>Arkiv </b>| <a href="#Konvertera">Konvertera</a> anv&#228;nder Ghostscript f&#246;r att konvertera PostScript eller 
PDF till bitmappar, PostScript eller PDF. 
<p><b>Arkiv </b>| <a href="#Extrahera">Extrahera</a> till&#229;ter att omr&#229;de av sidor att kopieras fr&#229;n 
ett PostScript dokument. 
<p><b>Arkiv </b>| <a href="#PS_till_EPS">PS till EPS</a> g&#246;r att bounding boxen blir uppdaterad 
och till&#229;ter att headern blir &#228;ndrad fr&#229;n PS till EPS. 
L&#228;s dokumentationen ordentligt innan du anv&#228;nder det. 
<p><b>Editera </b>| <a href="#EPS_Förhandsvisning">L&#228;gg till EPS F&#246;rhandsvisning</a> l&#228;gger till bitmap f&#246;rhandsvisning hos en EPS fil. 
<p><b>Editera </b>| <a href="#EPS_Förhandsvisning">Extrahera EPS</a> extraherar PostScript eller F&#246;rhandsvisning 
fr&#229;n en DOS EPS fil. 
<p><b>Editera </b>| <a href="#Konvertera_till_vektorformat">Konvertera till vektorformat</a> anv&#228;nder pstoedit f&#246;r att konvertera 
PostScript eller PDF till ett editerbart vektorformat. 
<p><b>Editera </b>| <a href="#Text_Extrahera_och_Finn">Text Extrahera</a> anv&#228;nder pstotext f&#246;r att extrahera text fr&#229;n 
ett PostScript eller PDF dokument. 
<p><b>Editera </b>| <a href="#Klippbord">Kopiera</a> kopierar den visade bitmappen till klippbordet. 
<b>Editera </b>| <a href="#Klippbord">Klistra in Till</a> kopierar en klippbord DIB bitmap till en fil. 
<b>Editera </b>| <a href="#Klippbord">Konvertera Bitmap</a> konverterar en klippbords DIB bitmap 
till en klippbords deviceberoende bitmap. 
<p>
<a href="#Filkonvertering_och_tricks">Filkonvertering och tricks</a><br>
<a href="#Konvertera">Konvertera</a><br>
<a href="#Extrahera">Extrahera</a><br>
<a href="#PS_till_EPS">PS till EPS</a><br>
<a href="#EPS_F&#246rhandsvisning">EPS F&#246rhandsvisning</a><br>
<a href="#Anv&#228ndardefinierad_F&#246rhandsvisning">Anv&#228ndardefinierad F&#246rhandsvisning</a><br>
<a href="#Konvertera_till_vektorformat">Konvertera till vektorformat</a><br>
<a href="#Text_Extrahera_och_Finn">Text Extrahera och Finn</a><br>
<a href="#Klippbord">Klippbord</a><br>
<p>
<hr>
<h2><a name="Filkonvertering_och_tricks">Filkonvertering och tricks</a></h2>
N&#229;gra vanliga filkonverteringar som kan utf&#246;ras genom att 
anv&#228;nda GSview och Ghostscript &#228;r: 
<p>Konvertera PostScript till PDF. 
Arkiv | <a href="#Konvertera">Konvertera</a>, v&#228;lj pdfwrite, 300dpi, 
Med Ghostscript 5.50, kommer fonter med icke-standard encoding 
att inkluderas som bitmappar.  Om du v&#228;ljer 72dpi, kommer fonterna 
att verka r&#229;a.  Ghostscript 6.0 kommer att b&#228;dda in fonterna. 
<p>Konvertera PDF till PostScript. 
Arkiv | <a href="#Konvertera">Konvertera</a>, v&#228;lj pswrite, 300dpi. 
<p>Konvertera Niv&#229; 2 PostScript till Niv&#229; 1 PostScript. 
Arkiv | <a href="#Konvertera">Konvertera</a>, v&#228;lj psmono, 300dpi, 
Ist&#228;llet f&#246;r 300dpi, b&#246;r du anv&#228;nda uppl&#246;sningen hos din 
skrivare. 
<p>Konvertera till en bitmap. 
Arkiv | <a href="#Konvertera">Konvertera</a>, v&#228;lj bmp16m, 72dpi. 
<p>Konvertera till ett editerbart vektorformat (pstoedit). 
Editera | <a href="#Konvertera_till_vektorformat">Konvertera till vektorformat</a> ELLER konvertera till PDF 
med metoden ovanf&#246;r. 
<p>Extrahera text (pstotext). 
Editera | <a href="#Text_Extrahera_och_Finn">Text Extrahera</a> 
<p>L&#228;gg f&#246;rhandsvisning till en EPS fil. 
Editera | <a href="#EPS_Förhandsvisning">L&#228;gg till EPS F&#246;rhandsvisning</a>.   Se <a href="#EPS_Förhandsvisning">L&#228;gg till EPS F&#246;rhandsvisning</a> f&#246;r 
fler detaljer. 
<p>Ta bort f&#246;rhandsvisning fr&#229;n en EPS fil. 
Editera | <a href="#EPS_Förhandsvisning">Extrahera EPS</a> | PostScript 
<p>Visa med j&#228;mna kanter. 
Media | <a href="#Display_Inställningar">Display Inst&#228;llningar</a>.  S&#228;tt <b>Text Alpha</b> och 
<b>Grafik Alpha</b> till 4.  Du beh&#246;ver en display med 
&#229;tminstone 8 bitar per pixel. 
<p>Spara den visade bitmappen. 
Editera | <a href="#Klippbord">Kopiera</a> till kopia i klippbordet. 
F&#246;r att spara till en BMP fil, anv&#228;nd Editera | <a href="#Klippbord">Kopiera</a> sedan <a href="#Klippbord">Klistra in Till</a>... 
<p>Skapa en bitmap med j&#228;mna kanter (anti-aliasing). 
1. Visa med j&#228;mna kanter och spara den visade bitmappen. 
ELLER 
2. 
<a href="#Konvertera">Konvertera</a> med ett bitmapdevice och s&#228;tt f&#246;ljande i inst&#228;llningar. 
<pre>
   -dTextAlphaBits=4 -dGraphicsAlphaBits=4
</pre>
<p>
<p>
<hr>
<h2><a name="Konvertera">Konvertera</a></h2>
<b>Arkiv </b>| <b>Konvertera</b> anv&#228;nder Ghostscript f&#246;r att konvertera PostScript eller PDF 
till bitmappar, PostScript eller PDF. 
<p>Du beh&#246;ver v&#228;lja ett Ghostscript tillverkningsdevice och uppl&#246;sning. 
Standardlistan &#246;ver tillg&#228;ngliga devicer och uppl&#246;sningar &#228;r lagrad 
i [Convert] sektionen av 
gsview32.ini 
och &#228;r tagen fr&#229;n standard distributionsversionen av Ghostscript 6.01. 
Du kan anv&#228;nda andra devicer eller uppl&#246;sningar. 
<p>Vissa Ghostscript optioner kan l&#228;ggas till antingen via 
f&#228;ltet <b>Optioner </b>eller knappen <a href="#Inställningar">Inst&#228;llningar</a>. 
<p>Alla sidor, individuella sidor eller n&#229;gon kombination kan konverteras. 
Knapparna <b>Alla</b>, <b>Udda</b> och <b>J&#228;mna</b> erbjuder snabbval av sidor. 
Om ett enstaka sammanh&#228;ngande block av sidor &#228;r markerat, kommer knapparna <b>Udda</b> och <b>J&#228;mna</b> 
att v&#228;lja udda eller j&#228;mna sidor inom det omr&#229;det. 
Checkboxen <b>Omv&#228;nt</b> g&#246;r att sidorna konverteras i sjunkande ordning. 
<p>F&#246;r att kontrollera hur GSview hanterar beg&#228;ran fr&#229;n PostScript eller 
PDF dokument att &#228;ndra sidstorlek, se &#228;mnet <a href="#Sidstorlek_Matchning">Sidstorlek Matchning</a>. 
<p>Se ocks&#229; <a href="#Konverteringar">Konverteringar</a>. 
<p>
<p>
<hr>
<h2><a name="Extrahera">Extrahera</a></h2>
<b>Extrahera</b> till&#229;ter att ett omr&#229;de av sidor kopieras fr&#229;n ett aktuell 
dokument till ett nytt dokument.  Till exempel, tio sidor kan extraheras 
fr&#229;n mitten av ett aktuellt dokument och skrivas till en annan fil, 
vilken senare kan skickas till en skrivare. 
Om du v&#228;ljer <b>Omv&#228;nt</b>, kommer de extraherade sidorna i sjunkande ordning. 
<p>Se ocks&#229; <a href="#Konverteringar">Konverteringar</a>. 
<p>
<p>
<hr>
<h2><a name="PS_till_EPS">PS till EPS</a></h2>
I allm&#228;nhet, &#228;r det inte m&#246;jligt att konvertera en PostScriptfil till <a href="#Document_Structuring_Conventions">EPS</a>. 
Emellertid, kan m&#229;nga enkelsidiga PostScriptfiler konverteras till <a href="#Document_Structuring_Conventions">EPS</a> 
genom att &#228;ndra den f&#246;rsta raden hos filen till 
%!PS-Adobe-3.0 EPSF-3.0 
och sedan l&#228;gga till eller fixa <b>%%BoundingBox</b> kommentaren. 
<p>EPS filer anv&#228;nds vanligtvis f&#246;r inkludering i andra dokument och 
av det sk&#228;let beh&#246;ver bounding boxen kommentarer: 
<pre>
  %%BoundingBox: llx lly urx ury
</pre>
<p>d&#228;r llx, lly, urx och ury &#228;r heltal som ger x och y koordinater 
f&#246;r nedre v&#228;nstra och &#246;vre h&#246;gra h&#246;rnen hos bounding box som omfattar 
alla markeringar som gjorts p&#229; sidan. 
<p><b>N&#228;r det anv&#228;nds felaktigt, kan PS till EPS kommandot producera PostScript 
filer med felaktiga DSC kommentarer.  Ett s&#229;dant dokument kommer att orsaka problem 
n&#228;r du f&#246;rs&#246;ker inkludera det inom ett annat dokument.</b> 
<p>F&#246;r att konvertera en PostScriptfil till <a href="#Document_Structuring_Conventions">EPS</a>, <b>m&#229;ste</b> orginalfilen vara 
ett <b>enkelsidigt</b> dokument.  Om dokumentet inneh&#229;ller <a href="#Document_Structuring_Conventions">DSC</a> kommentarer 
och &#228;r ett m&#229;ngsidigt, extrahera den &#246;nskade sidan med <a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Extrahera">Extrahera</a>. 
Om dokumentet inte inneh&#229;ller <a href="#Document_Structuring_Conventions">DSC</a> kommentarer, kommer du att beh&#246;va 
editera filen f&#246;r hand f&#246;r att extrahera den &#246;nskade sidan. 
<p><a href="#Document_Structuring_Conventions">EPS</a> dokument <b>f&#229;r inte</b> anv&#228;nda n&#229;gon av f&#246;ljade operatorer: 
<pre>
 banddevice   clear         cleardictstack  copypage
 erasepage    exitserver    framedevice     grestoreall
 initclip     initgraphics  initmatrix      quit
 renderbands  setglobal     setpagedevice   setpageparams
 setshared    startjob      letter          note
 legal        a3            a4              a5
</pre>
<p>F&#246;ljande operatorer skall anv&#228;ndas med f&#246;rsiktighet: 
<pre>
 nulldevice   setgstate     sethalftone    setmatrix
 setscreen    settransfer   setcolortransfer
</pre>
<p>Det &#228;r <b>ditt</b> ansvar att se till att ovanst&#229;ende krav &#228;r uppfyllda. 
<p>F&#246;r att testa om ett dokument inneh&#229;ller n&#229;gon av ovanst&#229;ende operatorer, v&#228;lj 
<a href="#Optioner">Optioner</a> | <b>EPS Varningar</b> och <a href="#Öppna_ett_Dokument">&#214;ppna</a> sedan det &#246;nskade dokumentet. 
Efter att sidan har visats, <a href="#Öppna_ett_Dokument">St&#228;ng</a> dokumentet och visa sedan 
Ghostscript meddelandena med <a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Visa_Meddelanden">Visa Meddelanden</a>. 
Om n&#229;gon av ovanst&#229;ende operatorer har anv&#228;nts b&#246;r du se rader som: 
<pre>
 Warning: EPS files must not use ...
</pre>
<p>Om du hittar dessa varningar, anv&#228;nd <b>inte</b> <b>PS till EPS</b>. 
Kom ih&#229;g att st&#228;nga av <b>EPS Varningar</b> efter&#229;t. 
<p>Ett dokument m&#229;ste visas innan <b>PS till EPS</b> anv&#228;nds. 
<p>F&#246;r dokument utan <a href="#Document_Structuring_Conventions">DSC</a> kommentarer, till&#229;ter <b>PS till EPS</b> att en bounding 
box specificeras, och sedan skriver ut en <a href="#Document_Structuring_Conventions">EPS</a> fil best&#229;ende av 
en <a href="#Document_Structuring_Conventions">EPS</a> inkapsling runt originaldokumentet. 
<p>F&#246;r dokument med <a href="#Document_Structuring_Conventions">DSC</a> kommentarer, kommer <b>PS till EPS</b> att &#228;ndra den 
f&#246;rsta raden i en fil till 
%!PS-Adobe-3.0 EPSF-3.0 
och till&#229;ter sedan att <b>%%BoundingBox</b> kommentaren &#228;ndras eller l&#228;ggs till. 
<p>F&#246;r <a href="#Document_Structuring_Conventions">EPS</a> dokument, till&#229;ter <b>PS till EPS</b> att <b>%%BoundingBox</b> kommentarer &#228;ndras. 
<p><b>PS till EPS</b> klipper inte dokumentet in till <b>%%BoundingBox</b>. 
Att g&#246;ra s&#229; skulle kr&#228;va en &#228;ndring av sj&#228;lva PostScriptkoden. 
<b>PS till EPS</b> &#228;ndrar endast <a href="#Document_Structuring_Conventions">DSC</a> kommentarerna. 
<p>Om <b>Automatisk ber&#228;kning av Bounding Box</b> &#228;r f&#246;rkryssad, kommer GSview 
att ber&#228;kna bounding box fr&#229;n de icke-vita pixlarna. 
Om den inte &#228;r f&#246;rkryssad, kan du v&#228;lja bounding box genom att klicka till 
v&#228;nster, botten, h&#246;ger eller toppen. 
<p><b>PS till EPS</b> l&#228;gger inte till n&#229;gon f&#246;rhandsvisning till ett dokument. 
Om du vill ha f&#246;rhandsvisning l&#228;gger du till den med <b>Editera </b>| <b>L&#228;gg till EPS F&#246;rhandvisning</b> efter 
f&#246;rst han skapat  en <a href="#Document_Structuring_Conventions">EPS</a> fil med en korrekt <b>%%BoundingBox</b>. 
<p>Se ocks&#229; <a href="#EPS_Förhandsvisning">L&#228;gg till EPS F&#246;rhandsvisning</a>, <a href="#Extrahera">Extrahera</a>, <a href="#EPS_Varning">EPS Varning</a> och <a href="#Konverteringar">Konverteringar</a>. 
<p>
<p>
<hr>
<h2><a name="EPS_F&#246;rhandsvisning">EPS F&#246;rhandsvisning</a></h2>
<b>L&#228;gg till EPS F&#246;rhandsvisning</b> tar en bitmap fr&#229;n 
displayen och anv&#228;nder den f&#246;r att l&#228;gga till f&#246;rhandsvisning till en EPS fil. 
<b>L&#228;gg till EPS F&#246;rhandsvisning</b> kan skapa en DOS EPS fil med en 
Windows Metafil eller TIFF f&#246;rhandsvisning, eller en EPSI fil med en Interchange f&#246;rhandsvisning. 
F&#246;r att anv&#228;nda <b>L&#228;gg till EPS F&#246;rhandsvisning</b> kommandot m&#229;ste f&#246;ljande steg f&#246;ljas. 
<p>1. Avmarkera <b>Optioner | Ignorera DSC</b> 
<p>2. Se till att dokumentet har en korrekt bounding box. 
<a href="#Optioner">Optioner</a> | <a href="#Visa_Bounding_Box">Visa Bounding Box</a> &#228;r anv&#228;ndbart f&#246;r att kontrollera en 
bounding box. 
En bounding box kan l&#228;ggas till eller &#228;ndras med <a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#PS_till_EPS">PS till EPS</a>. 
<p>3. V&#228;lj <a href="#Sidorientering">Orientering</a> | <a href="#Sidorientering">Portr&#228;tt</a>. 
<p>4. V&#228;lj <b>Media </b>| <a href="#Display_Inställningar">Display Inst&#228;llningar</a> och st&#228;ll in en l&#228;mplig uppl&#246;sning 
f&#246;r f&#246;rhandsvisningen.  Om uppl&#246;sningen &#228;r f&#246;r h&#246;g 
kommer den att g&#246;ra EPS filen orimligt stor. 
<p>5. <a href="#Öppna_ett_Dokument">&#214;ppna</a> en EPS fil som inte inneh&#229;ller n&#229;gon f&#246;rhandsvisning. 
<p>6.  V&#228;lj <b>Editera </b>| <b>L&#228;gg till EPS F&#246;rhandsvisning</b>, sedan f&#246;rhandsvisningsformatet, 
och det nya EPS filnamnet.  GSview kommer att skriva en ny fil inneh&#229;llande 
original PostScript EPS filen och en f&#246;rhandsvisning skapad fr&#229;n den 
visade bitmappen. 
De tillg&#228;ngliga f&#246;rhandsvisningsformaten &#228;r <b>Interchange</b>, 
<b>TIFF 4</b>, <b>TIFF 6 okomprimerad</b>, <b>TIFF 6 packbitar</b> och <b>Windows Metafil</b>. 
Om du l&#228;gger till en Interchange f&#246;rhandsvisning, m&#229;ste dokumentet ha en <b>%%EndComments</b> 
rad, annars kanske GSview l&#228;gger f&#246;rhandsvisningen p&#229; fel st&#228;lle. 
En interchange f&#246;rhandsvisning &#228;r alltid monochrome. 
En TIFF 4 f&#246;rhandsvisning &#228;r en Baseline Bilevel Image (1 bit/pixel) utan 
komprimering som &#228;r beskrivet i TIFF 6.0 memorandum, men undviker 
taggar som inte &#228;r beskrivna i TIFF 4 specifikationen. 
WordPerfect 5.1 erfordrar en TIFF 4 f&#246;rhandsvisning. 
En TIFF 6 f&#246;rhandsvisning &#228;r en Baseline Bilevel Image, 
eller en Baseline Palette-colour Image (4 eller 8 bits/pixel) 
eller en Baseline RGB Full Colour Image (24 bits/pixel) 
i &#246;verenst&#228;mmelse med TIFF 6.0 specifikationen. 
TIFF 6 f&#246;rhandsvisning &#228;r antingen okomprimerad eller komprimerad med packbitar. 
En Windows Metafil f&#246;rhandsvisning inneh&#229;ller en okomprimerad bitmap. 
<p>7. 
&#197;terst&#228;ll <a href="#Sidorientering">Orientering</a> | <a href="#Sidorientering">Portr&#228;tt</a>, och 
<b>Media </b>| <a href="#Display_Inställningar">Display Inst&#228;llningar</a> till sina f&#246;reg&#229;ende v&#228;rden. 
<p>F&#246;r att extrahera PostScript eller F&#246;rhandsvisningssektionen fr&#229;n en DOS EPS 
fil, anv&#228;nd <a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Öppna_ett_Dokument">V&#228;lj Fil</a> f&#246;ljt av <b>Editera </b>| <b>Extrahera EPS</b> 
och sedan <b>PostScript</b> eller <b>F&#246;rhandsvisning</b>. 
<p>Se ocks&#229; <a href="#PS_till_EPS">PS till EPS</a>. 
<p>
<p>
<hr>
<h2><a name="Anv&#228;ndardefinierad_F&#246;rhandsvisning">Anv&#228;ndardefinierad F&#246;rhandsvisning</a></h2>
Kommandot <b>Editera </b>| <a href="#EPS_Förhandsvisning">L&#228;gg till EPS F&#246;rhandsvisning</a> | <b>Anv&#228;ndardefinierad F&#246;rhandsvisning</b> till&#229;ter 
en existerande TIFF eller WMF fil att adderas till en EPS fil 
f&#246;r att skapa en DOS EPS fil. 
Detta &#228;r anv&#228;ndbart om en applikation kan exportera till en EPS fil och till en 
WMF fil, men kan inte skapa en DOS EPS fil med WMF f&#246;rhandsvisning. 
EPS filen <b>m&#229;ste</b> inneh&#229;lla en bounding box som &#246;verensst&#228;mmer med 
TIFF eller WMF f&#246;rhandsvisningsfilen. 
Det &#228;r inte n&#246;dv&#228;ndigt att visa EPS filen. <b>Anv&#228;ndardefinierad F&#246;rhandsvisning</b> 
kan anv&#228;ndas efter att en EPS fil har &#246;ppnats med <a href="#Öppna_ett_Dokument">V&#228;lj Fil</a>. 
<p>Du kan ocks&#229; l&#228;gga till f&#246;rhandsvisning som inte har n&#229;got gemensamt med PostScript, 
vilket &#228;r mycket ov&#228;lkommet. 
<p>
<p>
<hr>
<h2><a name="Konvertera_till_vektorformat">Konvertera till vektorformat</a></h2>
Du kan konvertera en PostScript eller PDF fil till ett editerbart vektorformat 
med anv&#228;ndning av <b>pstoedit</b> av Wolfgang Glunz. 
<b>pstoedit</b> &#228;r licensierad med GNU Public Licensen och &#228;r inte 
inkluderad med GSview.  Du m&#229;ste ladda ner den separat 
fr&#229;n pstoedit's hemsida 
<pre>
 http://www.pstoedit.net/pstoedit
</pre>
<p>eller fr&#229;n 
<pre>
 http://www.cs.wisc.edu/~ghost/gsview/pstoedit.htm
</pre>
<p>F&#246;r att anv&#228;nda <b>pstoedit</b> infr&#229;n GSview, anv&#228;nd 
<b>Editera | Konvertera till vektorformat</b>. 
Tre dialogboxar kommer att visas. 
<p>Den f&#246;rsta dialogen &#228;r f&#246;r pstoedit inst&#228;llningar. 
<p>V&#228;lj ett output <b>Format</b>. 
<p><b>Rita text som polygoner</b> skall v&#228;ljas om PostScriptfilen 
inneh&#229;ller text och utformatet inte st&#246;der det, t.ex. gnuplot. 
Den kanske producerar en stor utfil. 
<p>N&#228;r <b>Mappa till ISO-Latin1</b> &#228;r valt, mappar pstoedit alla teckenkoder 
till de som definierats av ISO-Latin1 encoding, vilken anv&#228;nds av 
HTML och MS-Windows.  Detta &#228;r standard. 
Om du avmarkerad valet, kommer encoding fr&#229;n informatet PostScript 
att passera of&#246;r&#228;ndrat till utformatet. 
<p>Om utformatet inte st&#246;der kurvor p&#229; det s&#228;tt som PostScript g&#246;r, 
kommer alla kurvor att approximeras av linjer. Optionen <b>Flathet</b> 
anv&#228;nds f&#246;r att kontrollera approximeringen. Den parametern &#228;r direkt 
konverterad till ett PostScript setflat kommando. Sm&#229; v&#228;rden producerar 
en mer noggrann approximering, men med fler linjesegment. 
<p>Ibland har fonter som &#228;r inb&#228;ddade i ett PostScript program inte n&#229;got 
fontnamn. Till exempel, h&#228;nder det i en PostScriptfil genererad 
med dvips. I ett s&#229;dant fall anv&#228;nder pstoedit en ers&#228;ttningsfont. 
Standarden f&#246;r detta &#228;r Courier.  En annan font kan specificeras 
med <b>Standard Font</b> optionen. 
Vissa alternativa fontnamn &#228;r Courier, Helvetica och Times-Roman. 
<p>Vissa av utformaten st&#246;der extra optioner.  Se pstoedit 
manualen f&#246;r fler detaljer.  Till exempel, java utformatet 
anv&#228;nder <b>Drivrutiner Optioner</b> f&#246;r att specificera namnet p&#229; java classes. 
<p>Den andra dialogen (utesluten ifall ingen sidonumrering &#228;r tillg&#228;nglig) 
specificerar att sidan kan konverteras, eller om det st&#246;ds av utformatet, 
ett omr&#229;de av sidor som kan konverteras. 
<p>Den tredje dialogen specificerar utfilnamet. 
<p>Inte alla <b>pstoedit</b> format st&#246;der bitmappsgrafik. 
Om du beh&#246;ver bitmapp utformat, se <b>Filkonverteringar och tricks</b>. 
<p>F&#246;r fler detaljer var v&#228;nlig l&#228;s pstoedit manualen. 
<p>Se ocks&#229; <a href="#Konverteringar">Konverteringar</a>. 
<p>
<p>
<hr>
<h2><a name="Text_Extrahera_och_Finn">Text Extrahera och Finn</a></h2>
I allm&#228;nhet, &#228;r extrahering av text fr&#229;n ett PostScript dokument inte n&#229;gon 
trivial operation.  Ord kan bli brutna.  Text kan vara kodad. 
Ligaturer kan ha anv&#228;nts (t.ex. utbyte av 'fi' med ett enstaka tecken). 
Det kan vara brist p&#229; sl&#228;ktskap mellan placeringen av ett ord i 
PostScriptfilen och dess placering p&#229; sidan. 
Succ&#233; i fr&#229;ga om extrahering av text fr&#229;n ett PostScriptdokument beror v&#228;ldigt 
mycket p&#229; sj&#228;lva dokumentet. 
<p>GSview har tv&#229; metoder f&#246;r extrahering av text fr&#229;n en PostScriptfil. 
<p>Den snabba metoden extraherar all text fr&#229;n PostScriptstr&#228;ngar. 
<p>Den andra metoden anv&#228;nder pstotext och Ghostscript f&#246;r att mera exakt 
extrahera text fr&#229;n ett PostScriptdokument. 
<p>De anv&#228;nda metoden v&#228;ljs fr&#229;n <a href="#Optioner">Optioner</a> | <a href="#PStillText">PStillText</a>. 
Se till&#228;mpligt &#228;mne nedanf&#246;r: 
<p>Se ocks&#229; <a href="#Konverteringar">Konverteringar</a>. 
<p>
<a href="#Snabb_Text_Extrahering_och_Finn">Snabb Text Extrahering och Finn</a><br>
<a href="#PStillText_Text_Extrahera_och_Finn">PStillText Text Extrahera och Finn</a><br>
<p>
<hr>
<h3><a name="Snabb_Text_Extrahering_och_Finn">Snabb Text Extrahering och Finn</a></h3>
Det &#228;r vanligt f&#246;r PostScriptdokument att inneh&#229;lla text i samma 
ordning som den f&#246;rekommer p&#229; sidan, och f&#246;r att anges i 
PostScriptstr&#228;ngar, omgivna av parenteser.  Kompletta rader 
kan ges i en str&#228;ng, eller ett ord per str&#228;ng.  F&#246;r den sortens 
dokument, kan extrahering av text utf&#246;ras med ett rimligt resultat. 
<p><b>Editera </b>| <a href="#Text_Extrahera_och_Finn">Text Extrahera</a> kommer att extrahera text inom str&#228;ngar fr&#229;n 
specificerade sidor och skriva dom till en textfil. 
Radbrytningar i textfilen &#246;verensst&#228;mmer med de i dokumentet. 
Mellanslag i textfilen &#246;verensst&#228;mmer med mellanslag inom str&#228;ngar, eller till 
separata str&#228;ngar.  En mera effektiv metod att extrahera text &#228;r att 
anv&#228;nda ps2ascii.ps levererad med Ghostscript, eller att anv&#228;nda <a href="#PStillText">PStillText</a> 
program listade p&#229; Ghostscript's <a href="#World_Wide_Web">WWW</a> sida.  <a href="#PStillText">PStillText</a> kan anv&#228;ndas 
fr&#229;n GSview genom att anv&#228;nda <a href="#Optioner">Optioner</a> | <a href="#PStillText">PStillText</a>. 
<p><b>Editera </b>| <a href="#Text_Extrahera_och_Finn">Finn</a> kommer att s&#246;ka efter text och visa den f&#246;rsta 
sida som inneh&#229;ller texten.  <a href="#Text_Extrahera_och_Finn">Finn</a> fr&#229;gar efter en s&#246;ktext och ett 
omr&#229;de av sidor inom vilket s&#246;kningen skall ske. 
De f&#246;reg&#229;ende kommentarerna om extrahering av text fr&#229;n ett PostScriptdokument 
skall noteras.  <a href="#Text_Extrahera_och_Finn">Finn</a> extraherar f&#246;rst text fr&#229;n dokumentet, 
s&#246;ker sedan igenom den ignorerande alla mellanrum b&#229;de i dokumentet 
och i den s&#246;kta texten.  Stor eller liten bokstav ignoreras under s&#246;kning. 
Konsekvent nog skulle den s&#246;kta texten <b>these</b> matcha b&#229;de <b>These</b> 
och <b>The serial</b>.  Ingen information ges om var ordet &#228;r placerat 
p&#229; en given sida d&#228;rf&#246;r att denna information &#228;r inte tillg&#228;nglig 
utan en komplett PostScripttolk. 
<a href="#Text_Extrahera_och_Finn">Finn</a> kommer inte att fungera f&#246;r icke DSC dokument eller DSC dokument med 
special sidordning. 
<p><b>Editera </b>| <a href="#Text_Extrahera_och_Finn">Finn N&#228;sta</a> kommer att forts&#228;tta s&#246;kningen fr&#229;n n&#228;sta sida. 
<p>
<p>
<hr>
<h3><a name="PStillText_Text_Extrahera_och_Finn">PStillText Text Extrahera och Finn</a></h3>
Den h&#228;r metod anv&#228;nder pstotext och Ghostscript f&#246;r att extrahera text fr&#229;n 
ett PostScript dokument.  Innan n&#229;gon text extrahering eller s&#246;kning utf&#246;rs, 
kommer hela PostScript dokumentet att processas av 
Ghostscript och pstotext f&#246;r att producera en textindexfil. 
Detta kan ta l&#229;ng tid.  N&#228;r det v&#228;l &#228;r f&#228;rdigt, b&#246;r extraheringen 
och s&#246;kningen vara snabb. 
<p>pstotext anv&#228;nder teckenupps&#228;ttningen ISO-Latin1.  Se pstotext 
dokumentationen f&#246;r fler detaljer. 
<pre>
 http://www.research.digital.com/SRC/virtualpaper/pstotext.html
</pre>
<p><a href="#Sidorientering">Orientering</a> m&#229;ste vara satt att matcha textordningen hos 
dokumentet. 
<p><b>Editera </b>| <a href="#Text_Extrahera_och_Finn">Text Extrahera</a> kommer att extrahera text fr&#229;n specificerade sidor 
och skriva den till en textfil. 
<p>Ord kan kopieras till klippbordet med anv&#228;ndning av<b> Editera</b> | <a href="#Klippbord">Kopiera</a>. 
<p><b>Editera </b>| <a href="#Text_Extrahera_och_Finn">Finn</a> kommer att s&#246;ka efter text och visa den f&#246;rsta sida 
som inneh&#229;ller texten.  <a href="#Text_Extrahera_och_Finn">Finn</a> fr&#229;gar efter en s&#246;ktext och ett 
omr&#229;de av sidor inom vilken s&#246;kningen skall ske. 
S&#246;ktexten bryts f&#246;rst upp i ord.  F&#246;r varje s&#246;kord, 
g&#246;rs en s&#246;kning f&#246;r att finna n&#229;gon matchning n&#229;gonstans inom ett dokumentord. 
S&#246;kning efter<b> frog</b> skulle finna<b> frog</b>,<b> frogs</b> och<b> bullfrogs</b>. 
Jokrarna '*' (inget eller flera tecken) och '?' (vilket tecken som helst) 
st&#246;ds, men det &#228;r inte f&#246;rnuftigt att anv&#228;nda dem i b&#246;rjan eller 
i slutet p&#229; ett ord. 
Jokrar r&#228;cker inte l&#228;ngre &#228;n f&#246;r det ord som s&#246;ks. 
Multipla kompletta ord kan specificeras, t.ex.  <b>GSview &#228;r en</b>. 
Om den s&#246;kta texten fanns, kommer den f&#246;rsta sidan som inneh&#229;ller texten 
att visas och det f&#246;rsta ordet blir markerat. 
<a href="#Text_Extrahera_och_Finn">Finn</a> kommer inte att fungera f&#246;r icke-DSC dokument eller DSC dokument med 
special sidordning. 
<p><b>Editera </b>| <a href="#Text_Extrahera_och_Finn">Finn N&#228;sta</a> kommer att forts&#228;tta s&#246;kningen. 
<p>F&#246;r de flesta PostScriptfilerna skall du anv&#228;nda 
<a href="#Optioner">Optioner</a> | <a href="#PStillText">PStillText</a> | <b>Normal</b>. 
<p><a href="#Optioner">Optioner</a> | <a href="#PStillText">PStillText</a> | <b>Dvips Cork Encoding</b> 
&#228;r endast relevant f&#246;r PostScriptfiler producerade av 
dvips fr&#229;n TeX eller LaTeX dokument; det talar om f&#246;r <b>pstotext</b> att anv&#228;nda 
Cork encoding snarare &#228;n den gamla TeX text encodingen. Olyckligtvis 
skiljer sig inte filer producerade av dvips vad g&#228;ller vilka font encodings som har 
anv&#228;nts. 
<p>
<p>
<hr>
<h2><a name="Klippbord">Klippbord</a></h2>
GSview f&#246;nstret kan kopieras till Klippbordet som en bitmap 
genom att v&#228;lja <b>Kopiera</b> fr&#229;n menyn <b>Editera</b>. 
Bitmappen kommer att vara en Device Independent Bitmap (DIB/BMP format). 
<p>Ett alternativt s&#228;tt att f&#229; ut en bitmap fr&#229;n Ghostscript &#228;r 
att anv&#228;nda en av dess BMP drivrutiner.  Se <a href="#Utskrift">Skriv ut</a>. 
<p><b>Klistra in Till</b> kopierar en Device Independent Bitmap fr&#229;n Klippbordet 
(om tillg&#228;ngligt) till en BMP fil. 
<p><b>Konvertera Bitmap</b> konverterar mellan en Device Independent Bitmap och en 
Device Dependent Bitmap. 
Om klippbordet inneh&#229;ller en Device Independent Bitmap (BMP format), 
kommer den att konverteras till en Device Dependent Bitmap och l&#228;ggas till klippbordet. 
Om klippbordet inte inneh&#229;ller n&#229;gon f&#228;rgpalett, kommer en att skapas 
fr&#229;n Device Independent Bitmap och l&#228;ggas till klippbordet. 
Optionen finns f&#246;r att vissa applikationer (speciellt Windows 
Paintbrush) inte k&#228;nner igen en Device Independent Bitmap i klippbordet. 
<p>Om <a href="#Text_Extrahera_och_Finn">Text Extrahera</a> eller <a href="#Text_Extrahera_och_Finn">Finn</a> anv&#228;nds p&#229; ett dokument med <a href="#PStillText">PStillText</a> aktiverad, 
skapar GSview ett index av orden i dokumentet.  Om n&#229;gra ord &#228;r 
markerade med musen, 
kommer <b>Kopiera</b> att kopiera orden till klippbordet ist&#228;llet 
f&#246;r att kopiera en bitmap. 
Text kan inte markeras f&#246;rr&#228;n <a href="#Text_Extrahera_och_Finn">Text Extrahera</a> 
eller <a href="#Text_Extrahera_och_Finn">Finn</a> har anv&#228;nts med <a href="#Optioner">Optioner</a> | <a href="#PStillText">PStillText</a> aktiverad. 
<p>
<p>
<hr>
<h1><a name="M&#228;ta">M&#228;ta</a></h1>
L&#228;ngden kan m&#228;tas genom att anv&#228;nda musmark&#246;rens placering visad p&#229; 
statusraden, eller med dialogboxen <b>Editera |</b> <b>M&#228;ta</b>. 
<p>Dialogboxen visar b&#246;rjan av placeringen, avslutningen p&#229; placeringen, 
skillnaden mellan dessa placeringar och l&#228;ngden och vinkeln 
mellan placeringarna. 
Startplaceringen s&#228;tts n&#228;r du klickar p&#229; v&#228;nster musknapp. 
Standardpunkten f&#246;r placering &#228;r det nedre v&#228;nstra h&#246;rnet p&#229; sidan. 
Enheterna kan vara pt, mm, inch, eller anpassad. 
<p>Anpassade enheter till&#229;ter dig att visa koordinater som de upptr&#228;der 
i en PostScriptfil. 
Anpassade enheter specificeras vanligtvis genom att starta med en identitets 
matrix och sedan utf&#246;ra en serie av transformationer. 
Om en PostScriptfil anropar landskapsorientering anv&#228;ndande 
90 rotate 
<pre>
 0 -595 translate
</pre>
<p>f&#246;r att d&#229; visa anv&#228;ndarkoordinaterna kan du ange 
f&#246;ljande i Calculate Transformation dialogen: 
<pre>
 Custom
 initmatrix
 90 rotate
 0 -595 translate
 invertmatrix
 Ok
</pre>
<p>Current Transformation Matrix (CTM) visas i &#246;vre delen av dialogen. 
Du kan ange en CTM direkt om du tycker om matematik. 
Det &#228;r enklare att ange v&#228;rden i Custom edit f&#228;lten nedanf&#246;r detta, 
men de har ingen effekt innan en av transformeringsknapparna 
(&#246;vers&#228;tt, rotera, skala) har valts. 
<p>Se ocks&#229; <a href="#Enheter">Enheter</a>. 
<p>
<p>
<hr>
<h1><a name="Optioner">Optioner</a></h1>
Menyn <b>Optioner</b> har f&#246;ljande val: 
<p>
<a href="#Enkel_Konfiguration">Enkel Konfiguration</a><br>
<a href="#Avancerad_Konfiguration">Avancerad Konfiguration</a><br>
<a href="#Ljud">Ljud</a><br>
<a href="#Enheter">Enheter</a><br>
<a href="#Spr&#229k">Spr&#229k</a><br>
<a href="#PStillText">PStillText</a><br>
<a href="#DSC_Varningar">DSC Varningar</a><br>
<a href="#Spara_Inst&#228llningar">Spara Inst&#228llningar</a><br>
<a href="#S&#228krare">S&#228krare</a><br>
<a href="#Spara_Senaste_Kalalog">Spara Senaste Kalalog</a><br>
<a href="#Knapprad">Knapprad</a><br>
<a href="#Anpassa_F&#246nster_till_Sida">Anpassa F&#246nster till Sida</a><br>
<a href="#Automatisk_Uppdatering">Automatisk Uppdatering</a><br>
<a href="#EPS_Klipp">EPS Klipp</a><br>
<a href="#EPS_Varning">EPS Varning</a><br>
<a href="#Ignorera_DSC">Ignorera DSC</a><br>
<a href="#Visa_Bounding_Box">Visa Bounding Box</a><br>
<p>
<hr>
<h2><a name="Enkel_Konfiguration">Enkel Konfiguration</a></h2>
Enkel konfiguration till&#229;ter dig att v&#228;lja vilken version av Ghostscript 
som anv&#228;nds.  Det antas att du redan har installerat 
AFPL Ghostscript 7.04 eller senare. 
Om du inte har Ghostscript installerad, se &#228;mnet 
<a href="#Hämta_Ghostscript">H&#228;mta Ghostscript</a>. 
F&#246;r st&#246;rre kontroll &#246;ver konfigurationen av GSview, se 
<a href="#Avancerad_Konfiguration">Avancerad Konfiguration</a>. 
<p>Enkel konfiguration kommer att s&#228;tta korrekta s&#246;kv&#228;gar f&#246;r Ghostscript 
och kopiera vissa skrivarstandarder till INI filen. 
Den p&#229;verkar inte registret eller startmenyn. 
<p>
<p>
<hr>
<h2><a name="Avancerad_Konfiguration">Avancerad Konfiguration</a></h2>
<b>Ghostscript DLL</b> talar om f&#246;r GSview var Ghostscript finns. 
Standard f&#246;r Win32 &#228;r 
c:\gs\gsN.NN\bin\gsdll32.dll 
<p>Ange den korrekta Ghostscript include s&#246;kv&#228;gen i 
<b>Ghostscript Include Path</b> f&#228;ltet. 
Include s&#246;kv&#228;gen m&#229;ste inneh&#229;lla katalogerna d&#228;r Ghostscript's 
katalogfiler (gs_*.ps och Fontmap) och Ghostscript's fonter (*.pfb) 
finns. Till exempel: 
<pre>
  c:\gs\gsN.NN\lib;c:\gs\fonts
</pre>
<p>L&#228;gg INTE n&#229;got <b>-I</b> f&#246;re include s&#246;kv&#228;gen. 
<p>F&#228;ltet <b>Ghostscript Options</b> kan vara tomt. 
Om du vill st&#228;nga av <b>Platform Fonts</b> alternativet under MS-Windows, 
skriv in <b>-dNOPLATFONTS</b> i f&#228;ltet <b>Ghostscript Options</b>. 
Om du vill s&#246;ka efter fonter som inte &#228;r listade i Fontmap, 
l&#228;gg till -sFONTPATH i f&#228;ltet.  Till exempel 
<pre>
  -dNOPLATFONTS -sFONTPATH="c:\psfonts"
</pre>
<p>Om du inte lyckas f&#229; <b>Ghostscript DLL</b> f&#228;ltet korrekt, kommer GSview inte 
att kunna ladda Ghostscript. 
Om du inte f&#229;r till <b>Ghostscript Include Path</b> korrekt, kommer Ghostscript 
inte att initialiseras och kommer sedan att laddas ur. 
<p>Val av <b>Kopiera skrivarstandard</b> kommer att uppdatera gsview32.ini fr&#229;n 
filen printer.ini. 
<p>Val av <b>Associera .ps filer med GSview</b> kommer att uppdatera registret 
f&#246;r att associera PostScriptfiler med GSview. 
<p>Val av <b>Associate .pdf filer med GSview</b> kommer att uppdatera registret 
f&#246;r att associera Portabelt Dokument Format filer med GSview. 
<p>Val av <b>Skapa Startmenyobjekt</b> kommera att l&#228;gga till GSview p&#229; startmenyn. 
<p>Det finns ingen &#229;ngrafunktion f&#246;r dessa fyra checkboxar med h&#228;ndelser. 
Alternativen Associera och Startmeny utf&#246;rs normalt 
(med en &#229;ngrafunktion) av GSview's setupprogram. 
<p>Se &#228;mnet <a href="#Installation">Installation</a>. 
<p>
<p>
<hr>
<h2><a name="Ljud">Ljud</a></h2>
Optionen <b>Ljud</b> tilldelar ljud till olika h&#228;ndelser. 
F&#246;r varje h&#228;ndelse kan ljudet s&#228;ttas till <b>Inget</b>, ett <b>H&#246;gtalarljud</b> eller 
en <b>Wave</b> fil. 
<p>Du m&#229;ste ha en ljuddrivrutin laddad innan du kan anv&#228;nda Wave filer. 
Wave filljud &#228;r inte tillg&#228;ngliga under MS-Windows 3.0. 
<p>H&#228;ndelserna &#228;r: 
<p><b>Utsida</b>: PostScript's showpage operator exekverades. 
<p><b>Ingen Sida</b>: en ogiltig sida valdes. 
Till exempel, tryck av <b>F&#246;rhandsvisning</b> p&#229; f&#246;rsta sidan hos ett dokument 
med <a href="#Document_Structuring_Conventions">DSC</a> kommentarer. 
<p><b>Inget Nummer</b>: ett kommando som beh&#246;ver sidnumrering och ett dokument som 
inte har sidnumrering. 
Till exempel, tryck p&#229; <a href="#Sid_Val">G&#229; till Sidan</a> n&#228;r du tittar p&#229; ett dokument utan 
<a href="#Document_Structuring_Conventions">DSC</a> kommentarer. 
<p><b>Inte &#214;ppen</b>:  ett kommando beh&#246;vde ett dokument som var &#246;ppet och det var 
inte fallet. 
Till exempel, tryck p&#229; <b>G&#229; till Sida</b> n&#228;r inget dokument &#228;r &#246;ppet. 
<p><b>Fel</b>: m&#229;nga typer av fel. 
<p><b>Start</b>: GSview &#246;ppnat. 
<p><b>Avsluta</b>: GSview st&#228;ngt. 
<p><b>Upptagen</b>: upptagen f&#246;r &#246;gonblicket, kan inte utf&#246;ra vad du fr&#229;gar efter. 
<p>Standard &#228;r <b>Ingen Sida</b>, <b>Fel</b> och <b>Upptagen</b> som ger ett 
<b>H&#246;gtalarljud</b> och alla andra h&#228;ndelser &#228;r <b>Inget</b>. 
<p>
<p>
<hr>
<h2><a name="Enheter">Enheter</a></h2>
Optionen <b>Enheter</b> s&#228;tter vilken enhet som skall anv&#228;ndas f&#246;r att visa 
muspekarens placering p&#229; statusraden.  Tillg&#228;ngliga enheter &#228;r PostScriptpunkter (<b>pt</b> = 1/72"), 
millimeter (<b>mm</b>) och inches (<b>in</b>). 
Standard &#228;r <b>pt</b>. 
<p>Uppl&#246;sningen p&#229; enheter kan &#246;kas genom att v&#228;lja 
<b>Enheter </b>| <b>H&#246;g Uppl&#246;sning</b>. 
<p>Se ocks&#229; <a href="#Mäta">M&#228;ta</a>. 
<p>
<p>
<hr>
<h2><a name="Spr&#229;k">Spr&#229;k</a></h2>
GSview &#228;r tillg&#228;ngligt p&#229; Engelska, Franska, Grekiska, Holl&#228;ndska, Italienska, 
Spanska, Svenska och Tyska. 
F&#246;r att &#228;ndra spr&#229;k anv&#228;nd <a href="#Optioner">Optioner</a> | <b>Spr&#229;k</b>. 
<p>P&#229; Windows NT, &#228;r alla existerande spr&#229;k tillg&#228;ngliga f&#246;r att 
v&#228;ljas, oberoende av regionala inst&#228;llningar, 
p&#229; andra system, beror tillg&#228;ngligheten p&#229; valda regionala 
inst&#228;llningar, i synnerhet vald lokal eller 
system code page. 
<p>
<p>
<hr>
<h2><a name="PStillText">PStillText</a></h2>
GSview har tv&#229; metoder f&#246;r att extrahera och s&#246;ka text. 
<p>Metoden <a href="#Snabb_Text_Extrahering_och_Finn">Snabb Text Extrahering och Finn</a> g&#246;r en enkel extrahering 
av PostScriptstr&#228;ngar.  Den metoden &#228;r enkel att f&#246;rvirra. 
Den v&#228;ljs fr&#229;n menyn <b>PStillText</b> | <b>Avaktiverad</b>. 
<p><a href="#PStillText_Text_Extrahera_och_Finn">PStillText Text Extrahera och Finn</a> metoden anv&#228;nder det externa pstotext 
verktyget och Ghostscript f&#246;r att extrahera ord och deras koordinater. 
Metoden &#228;r mera exakt, men det kan bli en l&#229;ng paus innan 
pstotext och Ghostscript initialiserar processen. 
Efter det, skall extraheringen och s&#246;kningen vara snabb. 
Det finns tv&#229; l&#228;gen p&#229; operationen.  <b>Normal</b> skall anv&#228;ndas 
f&#246;r de flesta PostScriptfilerna.  <b>Dvips Cork Encoding</b> skall anv&#228;ndas 
om du har en PostScriptfil som producerats av dvips vilken 
anv&#228;nder Cork Encoding. 
<p>Standard &#228;r <b>Normal</b>. 
<p>
<p>
<hr>
<h2><a name="DSC_Varningar">DSC Varningar</a></h2>
Vissa dokument inneh&#229;ller fel i Document Structuring Conventions. 
Niv&#229;n f&#246;r varningar fr&#229;n GSview kan st&#228;llas in med anv&#228;ndning av 
<a href="#Optioner">Optioner</a> | <b>DSC Varningar</b>. 
Om du anger<b> Av</b>, kommer GSview att anta att DSC kommentarerna &#228;r korrekta. 
<b>Fel</b> kommer att meddela dig ifall n&#229;gra fel finns i DSC kommentarerna . 
<b>Varningar</b> meddelar dig om varningar och fel i DSC kommentarerna. 
<b>Alla</b> kommer att meddela dig om n&#229;gra konstigheter, varningar eller fel i 
DSC kommentarerna.  Standard &#228;r <b>Varningar</b>. 
<p>Om du ber om att bli meddelad om fel och varningar, kommer dialogboxen 
DSC varningar att till&#229;ta dig att g&#246;ra f&#246;ljande val: 
<b>OK</b> talar om f&#246;r GSview att g&#246;ra en gissning om vad som troligtvis menades 
(snarare &#228;n vad DSC kommentaren verkligen talade om), 
<b>&#197;ngra</b> talar om f&#246;r GSview att behandla DSC som om den vore korrekt, 
<b>Ignorera DSC </b> talar om f&#246;r GSview att ignorera alla DSC kommentarer. 
<p>Om <b>DSC Varningar</b> &#228;r <b>Av</b>, kommer GSview att anta att <b>&#197;ngra</b> g&#228;ller. 
Dokument med felaktiga DSC kommentarer kommer troligtvis att orsaka problem. 
<p>
<p>
<hr>
<h2><a name="Spara_Inst&#228;llningar">Spara Inst&#228;llningar</a></h2>
Optionen <b>Spara Inst&#228;llningar Nu</b> sparar GSview's f&#246;nsterposition, 
f&#246;nsterstorlek, senast anv&#228;nda skrivare, senaste katalog, 
alla val i menyn <a href="#Optioner">Optioner</a> och alla val i menyn <a href="#Sidstorlek">Media</a> 
till initialiseringsfilen 
gsview32.ini i Windows systemkatalog (eller f&#246;r Windows 
95 eller NT 4 i anv&#228;ndarens profilkatalog om anv&#228;ndarprofiler 
anv&#228;nds). 
GSview l&#228;ser filen vid starten. 
<p>N&#228;r optionen <b>Spara Inst&#228;llningar vid Avslutning</b> &#228;r <b>markerad</b>, kommer GSview att 
spara ovanst&#229;ende inst&#228;llningar automatiskt n&#228;r du avslutar GSview. 
<p>
<p>
<hr>
<h2><a name="S&#228;krare">S&#228;krare</a></h2>
N&#228;r optionen <b>S&#228;krare</b> &#228;r <b>markerad</b>, kommer GSview att ge Ghostscript 
flaggan <b>-dSAFER</b>, vilken avaktiverar deletefile och renamefile operatorerna, 
och m&#246;jligheten att &#246;ppna filer i n&#229;got annat l&#228;ge &#228;n read-only. 
Detta &#228;r standard. 
<p>N&#228;r optionen <b>S&#228;krare</b> &#228;r <b>ej markerad</b> kan Ghostscript &#228;ndra filer. 
<p>
<p>
<hr>
<h2><a name="Spara_Senaste_Kalalog">Spara Senaste Kalalog</a></h2>
N&#228;r optionen <b>Spara Senaste Katalog</b> &#228;r <b>markerad</b>, kommer GSview 
att spara den aktuella katalogen n&#228;r du avslutar GSview. 
N&#228;r GSview startas n&#228;sta g&#229;ng, kommer det att ske i aktuell katalog. 
Detta &#228;r standard. 
<p>N&#228;r optionen <b>Spara Senaste Katalog</b> &#228;r <b>ej markerad</b>, kommer den aktuella 
katalogen n&#228;r GSview startas att bli den aktuella katalogen hos programmet 
som startade GSview. 
<p>
<p>
<hr>
<h2><a name="Knapprad">Knapprad</a></h2>
N&#228;r optionen <b>Knapprad</b> &#228;r <b>markerad</b>, kommer GSview att visa 
en Knapprad 
i toppen 
i f&#246;nstret.  Detta &#228;r standard. 
Knappraden inneh&#229;ller f&#246;ljande objekt i ordning fr&#229;n 
v&#228;nster till h&#246;ger: 
<p>
<img src="gvwopen.gif">
<a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Öppna_ett_Dokument">&#214;ppna</a> 
<p>
<img src="gvwprint.gif">
<a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Utskrift">Skriv ut</a> 
<p>
<img src="gvwinfo.gif">
<a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Dokument_Information">Info</a> 
<p>
<img src="gvwhelp.gif">
<b>Hj&#228;lp</b> | <b>Inneh&#229;ll</b> 
<p>
<img src="gvwgoto.gif">
<a href="#Sid_Val">Visa</a> | <b>G&#229; till Sida</b> 
<p>
<img src="gvwprevs.gif">
<b>G&#229; tillbaka 5 sidor</b> 
<p>
<img src="gvwprev.gif">
<a href="#Sid_Val">Visa</a> | <a href="#Sid_Val">F&#246;reg&#229;ende Sida</a> 
<p>
<img src="gvwnext.gif">
<a href="#Sid_Val">Visa</a> | <a href="#Sid_Val">N&#228;sta Sida</a> 
<p>
<img src="gvwnexts.gif">
<b>G&#229; fram&#229;t 5 sidor</b> 
<p>
<img src="gvwback.gif">
<a href="#Sid_Val">Visa</a> | <b>G&#229; Tillbaka</b> 
<p>
<img src="gvwfwd.gif">
<a href="#Sid_Val">Visa</a> | <b>G&#229; Fram&#229;t</b> 
<p>
<img src="gvwmagp.gif">
<b>&#214;ka uppl&#246;sning med 1.2</b> 
<p>
<img src="gvwmagm.gif">
<b>Minska uppl&#246;sning med 1/1.2</b> 
<p>
<img src="gvwfind.gif">
<b>Editera </b>| <a href="#Text_Extrahera_och_Finn">Finn</a> 
<p>
<img src="gvwfindn.gif">
<b>Editera </b>| <a href="#Text_Extrahera_och_Finn">Finn N&#228;sta</a> 
<p>Om du anv&#228;nder knapparna &#246;ka/minska f&#246;r uppl&#246;sning, skall <a href="#Automatisk_Uppdatering">Automatisk Uppdatering</a> 
anv&#228;ndas.  Ist&#228;llet f&#246;r att anv&#228;nda dessa knappar kan 
<b>Media </b>| <a href="#Display_Inställningar">Display Inst&#228;llningar</a> kommandon anv&#228;ndas. 
N&#228;r optionen <b>Knapprad</b> &#228;r <b>ej markerad</b>, kommer GSview inte att 
visa n&#229;gon Knapprad. 
<p>
<p>
<hr>
<h2><a name="Anpassa_F&#246;nster_till_Sida">Anpassa F&#246;nster till Sida</a></h2>
N&#228;r optionen <b>Anpassa F&#246;nster till Sida</b> &#228;r <b>markerad</b>, kommer &#228;ndingar av sidstorlek 
eller orientering att orsaka att f&#246;nstret blir f&#246;rstorat eller f&#246;rminskat 
f&#246;r att passa sidstorleken. 
N&#228;r f&#246;nstret ritas om, kommer GSview att tvinga det till att inte bli st&#246;rre 
&#228;n den sida som visas. 
<p>&#196;ndringar av f&#246;nsterstorleken kommer endast att upptr&#228;da n&#228;r f&#246;nstret 
ritas om eller n&#228;r sidstorleken &#228;ndras; den kommer inte att utf&#246;ras omedelbart efter att 
optionen &#228;r &#228;ndrad. 
Anpassa F&#246;nster till Sida ignoreras f&#246;r ett maximerat f&#246;nster. 
<p>Om optionen <b>Anpassa F&#246;nster till Sida</b> &#228;r <b>ej markerad</b>, kommer GSview inte att rita om 
f&#246;nstret och ytorna utanf&#246;r f&#246;nstret kommer att ritas i ljusgr&#229; nyans. 
Detta &#228;r anv&#228;ndbart om du inte vill att f&#246;nstret skall krympas n&#228;r du ser p&#229; 
sidor med l&#229;g uppl&#246;sning.  Detta &#228;r standard. 
<p>Se ocks&#229; <a href="#Sid_Val">Visa</a> | <a href="#Sid_Val">Anpassa F&#246;nster</a>. 
<p>
<p>
<hr>
<h2><a name="Automatisk_Uppdatering">Automatisk Uppdatering</a></h2>
N&#228;r optionen <b>Automatisk Uppdatering</b> &#228;r <b>markerad</b>, kommer GSview att 
uppdatera <a href="#Document_Structuring_Conventions">DSC</a> dokument n&#228;r <a href="#Sidorientering">Orientering</a>, <a href="#Display_Inställningar">Uppl&#246;sning</a>, 
<a href="#Display_Inställningar">Djup</a> eller <a href="#Sidstorlek">Media</a> &#228;r &#228;ndrat. 
Detta &#228;r standard. 
<p>F&#246;r <b>icke-DSC dokument</b>, kommer GSview om <b>Automatisk Uppdatering</b> &#228;r 
<b>markerad</b>, att <b>starta med f&#246;rsta sidan</b>. 
<p>Om <b>Automatisk Uppdatering</b> &#228;r <b>ej markerad</b>, m&#229;ste <a href="#Sid_Val">Visa</a> | <a href="#Sid_Val">Uppdatera</a> kommandot 
anv&#228;ndas f&#246;r att updatera ett dokument efter &#228;ndring av 
<a href="#Sidorientering">Orientering</a>, <a href="#Display_Inställningar">Uppl&#246;sning</a>, <a href="#Display_Inställningar">Djup</a> eller <a href="#Sidstorlek">Media</a>. 
<p>
<p>
<hr>
<h2><a name="EPS_Klipp">EPS Klipp</a></h2>
N&#228;r optionen <b>EPS Klipp</b> &#228;r <b>markerad</b>, kommer GSview att klippa 
den visade bitmappen till en bounding box hos en EPS fil ist&#228;llet f&#246;r att anv&#228;nda 
den sidstorlek som specificerats i <a href="#Sidstorlek">Media</a> menyn.  Det kan vara anv&#228;ndbart n&#228;r en 
bitmap f&#246;rhandsvisning l&#228;ggs till en EPS fil. 
Om en PDF fil visas, kommer <b>EPS Klipp</b> att orsaka att displayen blir klippt 
till en PDF crop box. 
<p>Om <b>EPS Klipp</b> &#228;r <b>ej markerad</b>, kommer GSview att anv&#228;nda sidstorleken som 
specificerades i <a href="#Sidstorlek">Media</a> menyn f&#246;r EPS filer.  Detta &#228;r standard. 
<p><b>EPS Klipp</b> &#228;ndrar inte originaldokumentet, det p&#229;verkar bara 
hur stor del av dokumentet som visas av GSview. 
Det p&#229;verkar inte utskrifter. 
<p>Se ocks&#229; <b>Editera </b>| <a href="#EPS_Förhandsvisning">L&#228;gg till EPS F&#246;rhandsvisning</a> 
<p>
<p>
<hr>
<h2><a name="EPS_Varning">EPS Varning</a></h2>
N&#228;r optionen <b>EPS Varning</b> &#228;r <b>markerad</b>, kommer GSview att skriva en 
prolog till Ghostscript n&#228;r varje fil &#246;ppnas.  Prologen kommer att 
producera varningsmeddelanden i <b>Arkiv </b>| <a href="#Visa_Meddelanden">Visa Meddelanden</a> 
f&#246;nstret om n&#229;gra PostScript operatorer som inte skulle anv&#228;ndas i <a href="#Document_Structuring_Conventions">EPS</a> 
&#228;r anv&#228;nda.  Ett exempel p&#229; varningsmeddelanden &#228;r: 
<pre>
 Varning: EPS filer f&#229;r inte anv&#228;nda /initgraphics
</pre>
<p><b>EPS Varning</b> &#228;r inte ofelbar.  Det &#228;r m&#246;jligt att accessa operatorer 
med restriktioner utan att <b>EPS Varning</b> producerar en varning. 
Om du f&#229;r en varning, anv&#228;nd INTE <a href="#PS_till_EPS">PS till EPS</a>. 
<p>Som standard &#228;r <b>EPS Varning</b> inte <b>markerad</b>. 
<p>Se ocks&#229; <a href="#PS_till_EPS">PS till EPS</a>. 
<p>
<p>
<hr>
<h2><a name="Ignorera_DSC">Ignorera DSC</a></h2>
Vissa dokument p&#229;st&#229;r felaktigt att de &#228;r anpassade till Adobe Document 
Structuring Conventions.  F&#246;rs&#246;k att visa ett av dessa o&#228;kta 
dokument kommer troligtvis att l&#228;mna GSview oerh&#246;rt f&#246;rvirrat och of&#246;rm&#246;get 
att visa dokumentet.  Om <b>Ignorera DSC</b> &#228;r <b>markerad</b>, kommer GSview 
att behandla dokumentet som om det inte inneh&#246;ll DSC kommentarer 
och visar dokumentets sidor endast i originalordningen. 
<p>Standard f&#246;r <b>Ignorera DSC</b> &#228;r <b>ej markerad</b>. 
<p>
<p>
<hr>
<h2><a name="Visa_Bounding_Box">Visa Bounding Box</a></h2>
Val av optionen g&#246;r att en rektangel l&#228;ggs &#246;ver bilden, 
visande placeringen av bounding box. Bounding box ritas endast p&#229; displayen, 
och har ingen effekt p&#229; utskriften. 
Bounding box visas endast f&#246;r <a href="#Document_Structuring_Conventions">DSC</a> dokument (icke-konforma 
dokument har ingen bounding box). 
<p>Standard f&#246;r <b>Visa Bounding Box</b> &#228;r <b>ej markerad</b>. 
<p>
<p>
<hr>
<h1><a name="Sidorientering">Sidorientering</a></h1>
<b>Portr&#228;tt</b>, <b>Landskap</b>, <b>Upp-och-ner</b> och <b>Omv&#228;nt Landskap</b> 
(spegelv&#228;nt Landskap) kommandona p&#229; <b>Orientering </b>Menyn v&#228;ljer 
den sidorientering som anv&#228;nds av displayen. 
<b>Landskap</b> utf&#246;r en klockvis rotering av papperet med 90 grader. 
<b>Omv&#228;nt Landskap</b> utf&#246;r en anti-klockvis rotering av ett papper med 90 grader. 
Dessa orientingsoptioner p&#229;verkar endast displayen och har ingen effect 
p&#229; utskriftskommandona. 
<p>Om <b>Auto</b> kommandot p&#229; orienteringsmenyn &#228;r markerad och en 
<a href="#Document_Structuring_Conventions">DSC</a> sido-orienteringskommando &#228;r funnet (%%Orientation or 
%%PageOrientation), kommer orienteringen att v&#228;ljas automatiskt. 
<p>N&#228;r optionen <b>Skifta Landskap</b> &#228;r <b>markerad</b>, kommer GSview att skifta 
betydelsen av Landskap och Omv&#228;nt Landskap. 
De flesta Landskapsdokument som jag har kommit i kontakt med har erfordrat en 
90 graders klockvis rotation av papperet f&#246;r att visas. 
Emellertid, det finns ingen standard och vissa dokument m&#229;ste roteras tv&#228;rtemot. 
<b>Skifta Landskap</b> knappen till&#229;ter GSview att automatiskt rotera dokumentet 
p&#229; r&#228;tt s&#228;tt i &#246;verenst&#228;mmelse med <b>%%Orientation</b> kommentaren i 
PostScriptfilen. 
<p>Se ocks&#229; <a href="#Sidstorlek">Sidstorlek</a> och <a href="#Display_Inställningar">Display Inst&#228;llningar</a>. 
<p>
<p>
<hr>
<h1><a name="Display_Inst&#228;llningar">Display Inst&#228;llningar</a></h1>
Vissa inst&#228;llningar f&#246;r display kan endast s&#228;ttas med <a href="#Sidstorlek">Media</a> | <b>Display Inst&#228;llningar</b>. 
<p>F&#228;ltet <b>Uppl&#246;sning</b> s&#228;tter displayuppl&#246;sningen i punkter per inch. 
Standard f&#246;r en VGA display &#228;r 96 punkter per inch. 
Det kan ocks&#229; &#228;ndras med &#228;ndringsknapparna f&#246;r uppl&#246;sning p&#229; 
knappraden. 
<p>F&#246;r DSC konforma filer, kommer ett tryck p&#229; h&#246;ger musknapp att 
<b>Zooma</b> in sidan med vad som &#228;r vanlig skrivaruppl&#246;sning. 
Ett nytt tryck p&#229; h&#246;ger musknapp kommer att zooma tillbaka mot 
normal displayuppl&#246;sning. 
F&#228;ltet <b>Zoom Uppl&#246;sning</b> s&#228;tter zoomuppl&#246;sningen i punkter per inch. 
<p>F&#228;ltet <b>Djup</b> s&#228;tter sidans bitmapsdjup i bits per pixels 
f&#246;r displayen. 
Standard kommer att v&#228;lja det h&#246;gsta djupet som st&#246;ds av din displaydrivrutin. 
I allm&#228;nhet, skall du inte st&#228;lla in den h&#246;gre &#228;n ditt aktuella 
displaydjup eftersom det leder till att du anv&#228;nder extra minne f&#246;r sidans 
bitmap men det kommer inte att f&#246;rb&#228;ttra din display. 
<p>F&#228;ltet <b>Text Alpha</b> s&#228;tter anti-aliasing f&#246;r fonter.  Standard 
(anv&#228;nd anti-aliasing) &#228;r 4 bits.  F&#246;r att avaktivera anti-aliasing f&#246;r fonter, 
anv&#228;nd 1 bit. 
<p><b>VIKTIGT</b>: Om du anv&#228;nder <b>Text Alpha</b>, kommer GSview att avaktivera 
<b>Platform Fonts</b> genom att g&#246;ra samma sak via till&#228;gget 
<pre>
  -dNOPLATFONTS
</pre>
<p>till <b>Optioner </b>| <a href="#Avancerad_Konfiguration">Avancerad Konfiguration</a> i Ghostscript's Optionsf&#228;lt. 
<p>F&#228;ltet <b>Graphics Alpha</b> s&#228;tter anti-aliasing f&#246;r grafik och ocks&#229; 
f&#246;r text som &#228;r f&#246;r stor f&#246;r att passa i fontcachen. 
<p>Anv&#228;ndning av anti-aliasing sl&#246;ar ner omritning. 
Text och Graphics Alpha kan endast anv&#228;ndas om ditt displaydjup &#228;r satt 
till 8bits/pixel eller h&#246;gre. 
<p>
<a href="#Zoom">Zoom</a><br>
<p>
<hr>
<h2><a name="Zoom">Zoom</a></h2>
F&#246;r att f&#246;rstora en visat parti, positionera kors-h&#229;rs muspekaren 
&#246;ver partiet och tryck sedan p&#229; h&#246;ger musknapp. 
F&#246;nstret kommer att skifta fr&#229;n normal visningsuppl&#246;sning till 
zoom uppl&#246;sning och statusraden kommer att f&#229; <b>Zoomad</b> tillagd. 
Det zoomade partiet kommer att bli i centrum p&#229; f&#246;nstret. 
F&#246;r att &#229;ngra <b>Zoom</b>, tryck h&#246;ger musknapp igen eller v&#228;lj 
n&#229;got kommando som ritar om sidan (t.ex. <a href="#Sid_Val">Uppdatera</a>, <a href="#Sid_Val">N&#228;sta Sida</a>). 
Som standard &#228;r zoomuppl&#246;sningen 300 punkter per inch men den kan 
&#228;ndras med dialogboxen <a href="#Sidstorlek">Media</a> | <a href="#Display_Inställningar">Display Inst&#228;llningar</a>. 
<p><b>Zoom</b> kommer endast att fungera f&#246;r <a href="#Document_Structuring_Conventions">DSC</a> konforma dokument. 
<p>F&#246;r att f&#246;rstora eller krympa hela sidan, anv&#228;nd <a href="#Display_Inställningar">Uppl&#246;sning</a> 
p&#229; dialoboxen <a href="#Sidstorlek">Media</a> | <a href="#Display_Inställningar">Display Inst&#228;llningar</a>, eller anv&#228;nd knapparna 
med f&#246;rstoringsglas p&#229; knappraden. 
<p>
<p>
<hr>
<h1><a name="Sidstorlek">Sidstorlek</a></h1>
<b>Media</b> menyn till&#229;ter ocks&#229; val av sidstorlek. 
Tillg&#228;ngliga sidor &#228;r: 
<pre>
 11x17          11   x 17   inch
 A0              840 x 1189 mm
 A1              594 x 840  mm
 A2              420 x 594  mm
 A3              297 x 420  mm
 A4              210 x 297  mm
 A5              148 x 210  mm
 B4              257 x 364  mm
 B5              182 x 257  mm
 Ledger         17   x 11   inch
 Letter          8.5 x 11   inch
 Legal           8.5 x 14   inch
 Note            8.5 x 11   inch
</pre>
<p>En anv&#228;ndardefinerad storlek kan specificeras i PostScript punkter (1/72 inch) 
med kommandot <b>Anv&#228;ndardefinierad</b>.  En storlek av 480x360 punkter vid 96 dpi 
kommer att ge en bildstorlek p&#229; 640x480 pixels. 
<p>Om en <a href="#Document_Structuring_Conventions">DSC</a> media kommentar hittas, som 
<pre>
 %%DocumentPaperSizes: a4
 %%DocumentMedia: a4 595 842 80 white ( )
</pre>
<p>kommer sidtypen att v&#228;ljas automatiskt. 
Om media specificationen inte &#228;r n&#229;gon av de ovanst&#229;ende typerna, 
kommer <b>Anv&#228;ndardefinierad</b> storlek att s&#228;ttas. 
<p>Om <b>Rotera Media</b> &#228;r markerad, kommer bredden och h&#246;jden p&#229; sidan 
att byta plats.  Den ritade bilden p&#229; sidan kommer inte att roteras. 
Detta p&#229;verkar b&#229;de display och utskrift. 
Val av <b>A4</b> och <b>Rotera Media</b> &#228;r lika som att v&#228;lja 
<b>Anv&#228;ndardefinierad</b> med en storlek p&#229; 842 x 595 pt. 
Det &#228;r mera vanligt att anv&#228;nda inst&#228;llningarna p&#229; menyn <a href="#Sidorientering">Orientering</a> &#228;n 
<b>Rotera Media</b>. 
<p>
<p>
<hr>
<h1><a name="Tangenter">Tangenter</a></h1>
F&#246;ljande &#228;r de tilldelade tangentkombinationerna f&#246;r GSview. 
<p><b>&#214;</b>, <b>&#246;</b>  &#214;ppna och visa en fil.  (<a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Öppna_ett_Dokument">&#214;ppna</a>) 
<p><b>T</b>, <b>t</b>  St&#228;ng fil.  (<a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Öppna_ett_Dokument">St&#228;ng</a>) 
<p><b>N</b>, <b>n</b>, <b>+</b>  N&#228;sta Sida.  (<a href="#Sid_Val">Visa</a> | <a href="#Sid_Val">N&#228;sta Sida</a>) 
<p>Space     N&#228;sta Sida och Hem.  (<a href="#Sid_Val">Visa</a> | <b>N&#228;sta Sida och Hem</b>) 
<p><b>V</b>, <b>v</b>, <b>-</b>  F&#246;reg&#229;ende Sida.  (<a href="#Sid_Val">Visa</a> | <a href="#Sid_Val">F&#246;reg&#229;ende Sida</a>) 
<p>BackSpace  F&#246;reg&#229;ende Sida och Hem.  (<a href="#Sid_Val">Visa</a> | <b>F&#246;reg&#229;ende Sida och Hem</b>) 
<p><b>G</b>, <b>g</b>  G&#229; till Sida.  (<a href="#Sid_Val">Visa</a> | <b>G&#229; till Sida</b>) 
<p><b>I</b>, <b>i</b>  Filinformation.  (<a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Dokument_Information">Info</a>) 
<p><b>U</b>, <b>u</b>, <b>F5</b>  Uppdatera sida.  (<a href="#Sid_Val">Visa</a> | <a href="#Sid_Val">Uppdatera</a>) 
<p><b>F</b>, <b>f</b>  V&#228;lj fil: &#246;ppna men visa inte.  (<a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Öppna_ett_Dokument">V&#228;lj Fil</a>) 
<p><b>P</b>, <b>p</b>  Spara Som. (<a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Öppna_ett_Dokument">Spara Som</a>) 
<p><b>S</b>, <b>s</b>  Skriv ut alla eller n&#229;gra sidor till en skrivare.  (<a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Utskrift">Skriv ut</a>) 
<p><b>K</b>, <b>k</b>  Konvertera alla eller n&#229;gra sidor till en PDF eller bitmapsfil. 
(<a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Konvertera">Konvertera</a>). 
<p><b>E</b>, <b>e</b> Vissa sidor till en annan Fil.  (<a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Extrahera">Extrahera</a>) 
<p><b>M</b>, <b>m</b>  Visa Ghostscript Meddelanden.  (<a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Visa_Meddelanden">Visa Meddelanden</a>) 
<p><b>&lt;</b> Minska uppl&#246;sning med 1/1.2 
<p><b>&gt;</b> &#214;ka uppl&#246;sning med 1.2 
<p><b>F1</b>  Hj&#228;lp.  (<b>Hj&#228;lp</b> | <b>Inneh&#229;ll</b>) 
<p><b>Ctrl+C</b>, <b>Ctrl+Insert</b>  Kopiera visad bitmap till klippbordet.  (<b>Editera</b> | <a href="#Klippbord">Kopiera</a>) 
<p><b>Ctrl+F</b>, Finn Text. (<b>Edit</b> | <b>Find</b>) 
<p><b>F3</b>, Finn N&#228;sta. (<b>Editera</b> | <a href="#Text_Extrahera_och_Finn">Finn N&#228;sta</a>) 
<p><b>F4</b>  Full Sk&#228;rm.  (<a href="#Sid_Val">Visa</a> | <a href="#Sid_Val">Full Sk&#228;rm</a>) 
<p><b>F6</b>  Anpassa F&#246;nster.  (<a href="#Sid_Val">Visa</a> | <a href="#Sid_Val">Anpassa F&#246;nster</a>) 
<p><b>Piltangenter</b>  Scrolla en 1/16 av sk&#228;rmen. 
<p><b>Ctrl + Piltangenter</b>  Scrolla en sk&#228;rmsida. 
<p><b>Page Up</b>  Scrolla upp en sk&#228;rm (f&#246;nsterh&#246;jd). 
<p><b>Page Down</b>  Scrolla ner en sk&#228;rm. 
<p><b>Home</b>  Scrolla till h&#246;gst upp p&#229; sidan. 
<p><b>End</b>  Scrolla till l&#228;ngst ner p&#229; sidan. 
<p>
<p>
<hr>
<h1><a name="Kommandorads_optioner">Kommandorads optioner</a></h1>
GSview ignorerar f&#246;ljande fall av optioner: 
-p &#228;r samma som -P.  P&#229; Windows eller OS/2, kan du ocks&#229; 
anv&#228;nda /p eller /P.  I exemplen ovanf&#246;r, byt ut <b>gsview</b> med 
<b>gsview32</b> f&#246;r Windows och <b>gvpm</b> f&#246;r OS/2. 
<p>Anv&#228;ndning: 
<pre>
 gsview [-d] [-t] [-f[DEVICE]] [-p[QUEUE]]
   [-mPAPERSIZE] [-oORIENTATION] [-rXDPIxYDPI]
   [-geometry WIDTHxHEIGHT[+XOFF+YOFF]] filnamn
</pre>
<p>Optioner: 
<p><b>filnamn</b> F&#246;r att starta GSview och visa filnamn.ps: 
<pre>
 gsview filnamn.ps
</pre>
<p><b>-p</b> skriver ut filnamn.ps med anv&#228;ndning av Ghostscript. 
Detta &#228;r liknande <a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Utskrift">Skriv ut</a>, undantaget att du inte 
kommer att bli tillfr&#229;gad om n&#229;gon skrivare (kommer att anv&#228;nda den skrivare som 
nyligen anv&#228;nts av GSview, eller det skrivarnamn som du anger) 
och GSview kommer att avslutas efter att utskriften &#228;r klar: 
<pre>
 gsview -p filnamn.ps
</pre>
<p><b>-f</b> konverterar en PostScriptfil (inte PDF) filnamn.ps 
till en fil anv&#228;ndande Ghostscript (<a href="#Öppna_ett_Dokument">Arkiv</a> | <a href="#Konvertera">Konvertera</a>): 
<pre>
 gsview -f filnamn.ps
</pre>
<p><b>-m</b>PAPERSIZE s&#228;tter pappersstorlek.  Vilket som helst av de f&#246;rdefinierade 
storlekarna p&#229; mediamenyn &#228;r giltiga. 
<p><b>-o</b>ORIENTATION s&#228;tter orienteringen och kan vara en av 
<b>auto</b>, <b>portr&#228;tt</b>, <b>landskap</b>, <b>upp-och-ner</b> eller <b>omv&#228;nt landskap</b>. 
<p><b>-r</b>XDPIxYDPI s&#228;tter display, konverterings eller utskriftsuppl&#246;sning. 
<p>F&#246;r att visa en fil med A4 papper, landskapsorientering 
och 96dpi: 
<pre>
 gsview -ma4 -olandscape -r96x96 filnamn.ps
</pre>
<p><b>-d</b> Debugl&#228;ge. 
I debugl&#228;ge kommer GSview <b>inte</b> att ta bort sina tempor&#228;ra filer. 
Det &#228;r f&#246;r att till&#229;ta inspektion av filerna efter att GSview avslutats. 
Debugl&#228;ge producerar ocks&#229; en mera utf&#246;rlig output f&#246;r <b>Arkiv </b>| <a href="#Visa_Meddelanden">Visa Meddelanden</a>. 
F&#246;r att skriva en debug output till 
c:\gsview.txt 
anv&#228;nd -d9 
<p><b>-t</b> Multi-tr&#229;dning.  GSview k&#246;rs som standard multi-tr&#229;dad, 
undantaget f&#246;r Windows 3.1/Win32s. 
F&#246;r att &#228;ndra detta, anv&#228;nd <b>-t</b> f&#246;r att v&#228;xla tr&#229;dningss&#228;tt, anv&#228;nd <b>-t0</b> f&#246;r att v&#228;lja 
enkel-tr&#229;dat alternativ och <b>-t1</b> f&#246;r att v&#228;lja multi-tr&#229;dat alternativ. 
<p>Windows st&#246;der ett f&#229;tal ytterligare kommandoradsoptioner. 
<p><b>-s</b> spoolar en fil direkt till skrivaren, utan att anv&#228;nda Ghostscript. 
GSview kommer att avslutas n&#228;r filen har skickats till spoolern. 
N&#229;gra exempel &#228;r: 
<pre>
 gsview -s filnamn.ps
 gsview -sLPT3: filnamn.ps
 gsview -s"HP DeskJet Portable" filnamn.ps
</pre>
<p><b>-e</b> anv&#228;nder DDE f&#246;r att &#246;ppna en fil i en existerande GSview, eller om GSview 
inte redan k&#246;rs, i ett nytt f&#246;nster anv&#228;ndande. 
<pre>
 gsview -e filnamn
</pre>
<p><b>-x</b> anv&#228;nder DDE f&#246;r att tala om f&#246;r ett existerande GSview att avslutas. 
<pre>
 gsview -x
</pre>
<p>
<a href="#Dynamic_Data_Exchange">Dynamic Data Exchange</a><br>
<p>
<hr>
<h2><a name="Dynamic_Data_Exchange">Dynamic Data Exchange</a></h2>
GSview implementerar en DDE server, service="GSview och &#228;mne="GSview". 
XTYP_EXECUTE kommandona som k&#228;nns igen &#228;r: 
<pre>
 [FileOpen("filnamn")]
 [FileExit()]
 [NextPage()]
 [PrevPage()]
 [GoBack()]
 [GotoPage(5)]
 [ShowWindow(nCmdShow)]
 [Minimise()]
 [Maximise()]
 [Command("kommandorad")]
 [Command()] kommandot f&#246;rst&#229;r bara "filnamn" eller "/P filnamn".
</pre>
<p>Skicka inte multipla kommandon tillsammans.  GSview kommer inte att klaga, 
men den multitr&#229;dade asynkrona exekveringen inom GSview anser att det 
f&#246;rsta kommandot inte har utf&#246;rts klart innan det andra kommandot 
togs emot.  Om du beh&#246;ver skicka multipla kommandon, skicka dom 
separat med pauser mellan. 
<p>Det finns tv&#229; kommandoradsoptioner som f&#246;rorsakar GSview att skicka ett DDE 
kommando till en annan kopia av GSview. 
/E kommandoradsoptionen anv&#228;nder [Command("kommandorad")][ShowWindow(1)]. 
/X kommandoradsoptionen anv&#228;nder [FileExit()]. 
<p>
<p>
<hr>
<h1><a name="World_Wide_Web">World Wide Web</a></h1>
World Wide Web hemsidan f&#246;r Ghostscript, Ghostview och GSview 
finns p&#229; 
<pre>
 http://www.cs.wisc.edu/~ghost/
</pre>
<p>GSview kan registeras on-line p&#229; 
<pre>
 http://www.ghostgum.com.au/
</pre>
<p>GSview kan anv&#228;ndas som en PostScriptfilvisare f&#246;r &#229;tskilliga OS/2 
och MS-Windows Webl&#228;sare.  Se GSview's hemsida f&#246;r detaljer. 
<p>Thomas Merz har skrivit en Ghostscript manual, vilken &#228;r tillg&#228;nglig 
i <a href="#Portabelt_Dokument_Format">PDF</a> fr&#229;n ovanst&#229;ende WWW site.  Denna manual &#228;r ett utdrag fr&#229;n en 
bok skriven av Thomas Merz med titeln <b>PostScript och Acrobat/PDF</b>, 
tillg&#228;nglig p&#229; Engelska och Tyska. 
<p>
<p>
<hr>
<h1><a name="Copyright">Copyright</a></h1>
Menyn <b>Om</b> visar GSview's copyright meddelande 
och GSview's versionsnummer. 
<p><pre>
 GSVIEW.EXE - Ett grafiskt Ghostscript interface
 Copyright (C) 1993-2002, Ghostgum Software Pty Ltd.  Alla r&#228;ttigheter reserverade.
</pre>
<p>Denna fil &#228;r en del av GSview. 
<p>Programmet distributeras UTAN GARANTI AV N&#197;GOT SLAG.  Ingen f&#246;rfattare 
eller distribut&#246;r accepterar n&#229;got ansvar f&#246;r konsekvenserna av att anv&#228;nda den, 
f&#246;r n&#229;got som helst arbete eller &#228;ndam&#229;l, undantaget att han 
eller hon uttryckligen sagt s&#229; i skrift.  Referera till GSview Free Public Licence 
("Licence") f&#246;r alla detaljer. 
<p>Varje kopia av GSview m&#229;ste inkludera en kopia av Licensen, normalt i en 
ren ASCII textfil kallad LICENCE.  Licensen ger dig r&#228;ttigheter att kopiera, 
modifiera och &#229;terdistribuera GSview, men endast under vissa villkor 
som beskrivs i Licensen.  Bland annat, kr&#228;ver Licensen att copyright notisen 
och den h&#228;r notisen skall finnas med hos varje kopia. 
<p>F&#246;rfattare: Russell Lang, Ghostgum Software Pty Ltd 
<pre>
  Internet: gsview@ghostgum.com.au
</pre>
<p>Var v&#228;nlig l&#228;s &#228;mnet <a href="#Vanliga_Problem">Vanliga Problem</a>, GSview Readme.htm och s&#246;k igenom 
<a href="#World_Wide_Web">WWW</a> sidan innan ni skickar mail till f&#246;rfattaren. 
<p>GSview anv&#228;nder pstotext i en extern DLL. pstotext skrevs av 
Andrew Birrell och Paul McJones.  Den &#228;r 
Copyright (C) 1995-1996, f&#246;r Digital Equipment Corporation. 
Se licensen i pstotext.txt i pstotext.zip f&#246;r fler detaljer. 
Om du inte accepterar pstotext licensen, radera pstotext.zip, 
pstotxt2.dll och pstotxt3.dll. 
<p>
<p>
<hr>
<h1><a name="Vanliga_Problem">Vanliga Problem</a></h1>
<b>Problem:</b> Kan inte ladda Ghostscript DLL ... 
<p>GSview kr&#228;ver Ghostscript DLL 
(gsdll2.dll f&#246;r OS/2, gsdll32.dll f&#246;r Win32). 
Detta felmeddelande upptr&#228;der vanligtvis om du inte har Ghostscript, 
eller om GSview inte kan hitta Ghostscript. 
<p>Fr&#229;n GSview menyn v&#228;lj <a href="#Optioner">Optioner</a> | <a href="#Avancerad_Konfiguration">Avancerad Konfiguration</a> 
och ange korrekt <a href="#Avancerad_Konfiguration">Ghostscript DLL</a> s&#246;kv&#228;g. Till exempel 
<pre>
 c:\gs\gsN.NN\bin\gsdll32.dll
</pre>
<p>Detta meddelande upptr&#228;der ocks&#229; om Ghostscript inte kan hitta sina 
initialiseringsfiler (t.ex. gs_init.ps).  St&#228;ll in <a href="#Avancerad_Konfiguration">Ghostscript Include Path</a> korrekt. 
<p>Om du anv&#228;nder Win32s, f&#246;rs&#228;kra dig om att du inte redan har en kopia av 
Ghostscript DLL laddad av en annan kopia av GSview. 
Endast en kopia av Ghostscript DLL kan vara laddad av Win32s vid varje tillf&#228;lle. 
<p>Om du inte kan f&#229; GSview att k&#246;ra Ghostscript's DLL korrekt, se till att 
du kan konfigurera och k&#246;ra Ghostscript p&#229; egen hand. 
<p><b>Problem:</b> Ghostscript's Meddelandef&#246;nster s&#228;ger 
<b>Can't find initialization file gs_init.ps</b>. 
<p>S&#228;tt <a href="#Avancerad_Konfiguration">Ghostscript Include Path</a> s&#229; att den pekar p&#229; katalogen som inneh&#229;ller 
den riktiga gs_init.ps. 
<p><b>Problem:</b> Ghostscript's Meddelandef&#246;nster s&#228;ger 
<b>gs: Interpreter revision (XXX) does not match gs_init.ps revision (YYY)</b>. 
<p>S&#228;tt <a href="#Avancerad_Konfiguration">Ghostscript Include Path</a> s&#229; att den pekar p&#229; katalogen som inneh&#229;ller 
den riktiga gs_init.ps. 
F&#246;rs&#246;k inte visa en PostScriptfil i en katalog med en gammal 
version av Ghostscript (vilket kommer att f&#246;rorsaka att den gamla gs_init.ps laddas 
utan h&#228;nsyn till <a href="#Avancerad_Konfiguration">Ghostscript Include Path</a>). 
<p><b>Problem:</b> Ghostscript's Meddelandef&#246;nster s&#228;ger 
<b>Wrong version of DLL found.  Found version XXX  Need version YYY</b>. 
<p>GSview hittade fel version av Ghostscript DLL.  Installera den n&#246;dv&#228;ndiga 
versionen av Ghostscript DLL.  Se till att du endast har en kopia 
av Ghostscript DLL p&#229; ditt system. 
<p><b>Problem:</b> GSview p&#229;st&#229;r att en flerasidors PostScriptfil producerad 
p&#229; MS-Windows inneh&#229;ller 0 sidor och vill endast visa f&#246;rsta sidan. 
<p>Det beror p&#229; att dokumentet inte har r&#228;tt DSC kommentarer. 
Fr&#229;n Kontrollpanelen, v&#228;lj <b>Skrivare</b>, <b>Optioner...</b>, klicka sedan i 
gruppboxen <b>Skriv ut till</b> p&#229; radioknappen <b>Skrivare</b>.  Du kan inte 
anv&#228;nda <b>Skriv ut till</b> <b>Encapsulated PostScriptfil</b> f&#246;r utskrift 
av flersidiga filer.  Den korrekta metoden &#228;r att ansluta skrivaren 
till <b>FILE:</b>. 
Som till&#228;gg, 
v&#228;lj sedan fr&#229;n Kontrollpanelen <b>Skrivare</b>, <b>Optioner...</b>, <b>Avancerad</b> och 
kryssa sedan f&#246;r <b>Conform to Adobe Document Structuring Convention</b>. 
<p>DSC kommentaren <b>%%Pages: 0</b> betyder att dokumentet inte producerar 
n&#229;gra sidor.  Det betyder, att PostScript's <b>showpage</b> operator inte anv&#228;nds. 
Om du hittar ett PostScript dokument som har multipla sidor och inneh&#229;ller 
kommentaren <b>%%Pages: 0</b>, &#228;ndra den f&#246;rsta raden fr&#229;n <b>%!PS-Adobe-</b> till <b>%!</b>. 
GSview kommer sedan att ignorera DSC kommentarerna och till&#229;ta dig att visa alla 
sidor, men endast i originalordning.  Klaga hos f&#246;rfattaren till 
programmet som har producerat PostScriptfilen. 
<p>Vissa PostScript skrivardrivrutiner inkluderar kod som &#228;r specifik f&#246;r 
en speciell skrivare.  PostScript resultatet fr&#229;n dessa drivrutiner kan 
vara om&#246;jligt att flytta och kanske inte visas i GSview.  Om du har det 
problemet, f&#246;rs&#246;k att anv&#228;nda en n&#229;got s&#229; n&#228;r generisk PostScriptdrivrutin som t.ex. 
<b>Apple LaserWriter II NT</b> f&#246;r PostScript niv&#229; 2 skrivare, eller 
<b>Apple LaserWriter Plus</b> f&#246;r PostScript niv&#229; 1 skrivare. 
<p>F&#246;r Windows 95, &#246;ppna skrivarinst&#228;llningar och v&#228;lj sedan 
PostScript tabben, ange sedan PostScript Output Format = 
<b>PostScript (optimera f&#246;r portabilitet - ADSC)</b>. 
<p><b>Problem:</b> GSview p&#229;st&#229;r att "Sidordning &#228;r Special..." 
<p>Ditt dokument anv&#228;nder DSC kommentaren <b>%%PageOrder: Special</b> vilket betyder 
att sidorna inte kan ordnas om tillf&#246;rlitligt.  Det kan f&#246;rhindra GSview 
att visa sidor i n&#229;gon annan ordning &#228;n originalordningen. 
Om du forts&#228;tter och ordnar om sidorna, kan PostScriptfel uppst&#229;. 
Det enda s&#228;ttet att ordna detta &#228;r att regenerera PostScript utan 
special sidordning. 
<p>Som standard, skapar Windows 95 PostScriptfiler som anv&#228;nder special 
sidordning.  F&#246;r att avaktivera detta, &#246;ppna skrivarinst&#228;llningar och 
v&#228;lj PostScript tabben, ange sedan PostScript Output Format = 
<b>PostScript (optimera f&#246;r portabilitet - ADSC)</b>. 
<p><b>Problem:</b> PostScriptfiler producerade p&#229; MS-Windows startar med Control-D. 
<p>F&#246;r Windows 3.1: 
<p>D&#229; detta upptr&#228;der &#228;ven n&#228;r PostScriptskrivarens checkbox 
<b>Anpassa till Document Structuring Convention</b> &#228;r markerad, m&#229;ste detta 
anses vara en bug MS-Windows PostScript skrivardrivrutin. 
Bugfixen &#228;r dokumenterad i MS-Windows PRINTERS.WRI fil. 
Editera win.ini filen och s&#246;k efter PostScript skrivarsektion. 
Det kan finnas mer &#228;n en.  I var och en av dessa sektioner l&#228;ggs 
<b>CTRLD=0</b> som visas nedanf&#246;r. 
<p><pre>
 [Apple LaserWriter II NT,FILE]
 CTRLD=0
</pre>
<p>F&#246;r Windows 95: 
<p>PostScript skrivardrivrutinssetup har en option 
(Inst&#228;llningar, PostScript, Avancerad) f&#246;r undertryckande av 
ett ^D vid starten av ett dokument. 
Lyckligtvis &#228;r det standard att inte skicka n&#229;got ^D f&#246;re jobbet. 
<p><b>Problem:</b> PostScriptfiler producerade med Word f&#246;r Windows 6.0 
ger en meddelandebox med "Saknade %%Pages kommentar". 
<p>Gratulerar.  Du har just hittat ett misstag i DSC kommentarerna 
n&#228;r Word inkluderade en EPS fil.  Word skulle ha kapslat in den 
inkluderade EPS filen med raderna 
<pre>
 %%BeginDocument: filename.eps
 %%EndDocument
</pre>
<p>P&#229; grund av att Word inte g&#246;r detta, kan inte GSview tala om hur m&#229;nga sidor 
som finns i dokumentet och var dom &#228;r placerade. 
<p>Var v&#228;nlig klaga hos Microsoft.  Det finns ett problem i EPSIMP.FLT 
filter version 2.01 vilket Microsoft beh&#246;ver &#229;tg&#228;rda. 
<p>I det h&#228;r l&#228;get, har du tv&#229; l&#246;sningar: 
<p>1. V&#228;lj <a href="#Optioner">Optioner</a> | <a href="#Ignorera_DSC">Ignorera DSC</a> 
<p>2. Editera PostScriptfilen f&#246;r att korrigera DSC kommentarerna. 
S&#246;k i PostScriptfilen efter alla rader inneh&#229;llande 
<pre>
 %MSEPS Preamble
</pre>
<p>Fr&#229;n varje s&#229;dan rad, s&#246;k fram&#229;t efter starten p&#229; den 
inkluderade EPS filen vilken b&#246;r starta med en rad som 
<pre>
 %!PS-Adobe-3.0 EPSF-3.0
</pre>
<p>L&#228;gg ovanf&#246;r dessa rader till raden 
<pre>
 %%BeginDocument: AddedByHand
</pre>
<p>S&#246;k sedan efter att rader som inneh&#229;ller 
<pre>
 %MSEPS Trailer
</pre>
<p>L&#228;gg ovanf&#246;r dessa rader till raden 
<pre>
 %%EndDocument
</pre>
<p>GSview b&#246;r sedan kunna visa filen korrekt. 
<p><b>Problem:</b> GSview k&#228;nner inte igen DSC kommentarer i filer 
producerade med Adobe PostScript drivrutin 4.10 f&#246;r Windows 32-bit. 
<p>Anv&#228;nd inte n&#229;got Taggat bin&#228;rt kommunikationsprotokoll. 
&#196;ndra detta till "Skrivare | PostScript tab | Avancerad... | 
Data format grupp box | ASCII data" 
<p><b>Problem:</b> F&#246;rs&#246;k att &#246;ppna n&#229;gon fil ger ett 
<pre>
 <b>Unrecoverable error: configurationerror in setpagedevice</b>
 Failed to open device or install ViewerPreProcess hook: returns -26
 Sidstorleken kan ha blivit f&#246;r stor eller uppl&#246;sningen f&#246;r h&#246;g.
 St&#228;ll om sidstorlek och uppl&#246;sning
</pre>
<p>Antingen har problemet beskrivet i felmeddelandet intr&#228;ffat, 
i vilket fall du skall reducera sidstorleken, uppl&#246;sningen, 
djupet eller en kombination av alla tre. 
Alternativt, kan du ha anv&#228;nt <b>-dFIXEDMEDIA</b> i Ghostscript's 
milj&#246;variabel GS_OPTIONS.  N&#228;r du anv&#228;nder GSview, &#228;r det s&#228;krast 
att inte anv&#228;nda GS_OPTIONS alls och att anv&#228;nda <a href="#Optioner">Optioner</a> | 
<a href="#Avancerad_Konfiguration">Avancerad Konfiguration</a> | <a href="#Avancerad_Konfiguration">Ghostscript Optioner</a> ist&#228;llet. 
<p><b>Problem:</b> GSview h&#228;nger eller tar v&#228;ldigt l&#229;ng tid p&#229; sig f&#246;r att visa en fil. 
<p>Uppl&#246;sningen kan ha satts f&#246;r h&#246;gt eller sidan &#228;r f&#246;r stor. 
Reducera uppl&#246;sningen till standard 96dpi genom att anv&#228;nda 
<b>Media </b>| <a href="#Display_Inställningar">Display Inst&#228;llningar</a>. 
&#196;ndra storleken p&#229; sidan via <a href="#Sidstorlek">Media</a> menyn. 
<p>
<p>
<hr>
<h1><a name="Andra_Anv&#228;ndbara_Program">Andra Anv&#228;ndbara Program</a></h1>
<b>RedMon</b> &#228;r en Windows 95 och NT port monitor, som l&#229;ter dig 
styra om en printerport till ett program.  RedMon kan anv&#228;ndas med Ghostscript 
och en icke-PostScript skrivare f&#246;r att emulera en PostScript skrivare. 
Den emulerade PostScript skrivare kan delas i ett datan&#228;tverk och uppptr&#228;der 
som en PostScript skrivare f&#246;r n&#228;tverksklienterna.   Fler detaljer finns p&#229;: 
<pre>
 http://www.cs.wisc.edu/~ghost/redmon/
</pre>
<p>RedMon inkluderar ocks&#229; ett kommandoradsverktyg f&#246;r att skriva en fil till 
en Windows skrivark&#246;. 
<p><b>PrintFile</b> av Peter Lerup &#228;r en Windows GUI applikation f&#246;r 
att skicka filer till en skrivare.  Den erbjuder smart hantering av 
text, PostScript och andra filer.  Den &#228;r tillg&#228;nglig fr&#229;n: 
<pre>
  http://hem1.passagen.se/ptlerup/
</pre>
<p>Se Ghostscript's <a href="#World_Wide_Web">WWW</a> sida f&#246;r fler anv&#228;ndbara program. 
<p>
<p>
<hr>
<h1><a name="Andra_Hj&#228;lp_&#196;mnen">Andra Hj&#228;lp &#196;mnen</a></h1>
Dessa &#228;mnen n&#229;s vanligtvis genom att trycka p&#229; <b>Hj&#228;lp</b> knappen 
i en dialogbox. 
<p>
<a href="#Visa_Meddelanden">Visa Meddelanden</a><br>
<a href="#bzip2">bzip2</a><br>
<a href="#zlib">zlib</a><br>
<a href="#Internt">Internt</a><br>
<p>
<hr>
<h2><a name="Visa_Meddelanden">Visa Meddelanden</a></h2>
GSview anv&#228;nder Ghostscript f&#246;r att visa eller skriva ut PostScriptfiler. 
<b>Visa Meddelanden</b> visar konsollutmatningen fr&#229;n Ghostscript, 
och &#228;r mycket anv&#228;ndbar n&#228;r ett PostScriptfel uppst&#229;r. 
Du kanske m&#229;ste scrolla bak&#229;t f&#246;r att se starten p&#229; felmeddelandet. 
<p>Texten i <b>Visa Meddelanden</b> f&#246;nstret kan kopieras till klippbordet. 
Om ingen text har valts, kommer hela texten att kopieras till klippbordet. 
Om n&#229;gon del av texten markerats, kommer endast den delen att bli kopierad till 
klippbordet. 
<p>F&#246;rklaringar till vissa felmeddelanden som inte visas i <b>Visa Meddelande</b> 
ges i <b>Allm&#228;nna Problem</b> &#228;mnet. 
<p>
<p>
<hr>
<h2><a name="bzip2">bzip2</a></h2>
Om du f&#246;rs&#246;ker ladda en fil som har komprimerats av bzip2, 
kommer GSview att f&#246;rs&#246;ka ladda bzip2 DLL, och sedan packa upp den 
till en tempor&#228;r fil. 
<p>Om du f&#229;r ett felmeddelande <b>Failed to load bzip2 DLL...</b> har 
du troligtvis inte bzip2 DLL tillg&#228;ngligt. 
H&#228;mta den fr&#229;n samma st&#228;lle som du h&#228;mtade GSview eller fr&#229;n 
<pre>
 ftp://mirror.cs.wisc.edu/pub/mirrors/ghost/ghostgum/
</pre>
<p>Placera bzip2 DLL i samma katalog som GSview EXE. 
libbz2.dll &#228;r f&#246;r Win32.  F&#246;r n&#228;rvarande finns ingen bzip2 DLL 
f&#246;r Win16 eller OS/2. 
<p>bzip2 &#228;r Copyright 1996-2000 f&#246;r Julian Seward 
K&#228;llkoden kan h&#228;mtas fr&#229;n 
http://sourceware.cygnus.com/bzip2/index.html 
<p>
<p>
<hr>
<h2><a name="zlib">zlib</a></h2>
Om du f&#246;rs&#246;ker ladda en fil som blivit komprimerad med gzip, 
kommer GSview att f&#246;rs&#246;ka ladda zlib DLL, och sedan packa upp den 
till en tempor&#228;r fil. 
<p>Om du f&#229;r ett felmeddelande <b>Failed to load zlib DLL...</b> har 
du troligtvis inte zlib DLL tillg&#228;ngligt. 
H&#228;mta den p&#229; samma plats som du h&#228;mtade GSview eller fr&#229;n 
<pre>
 ftp://mirror.cs.wisc.edu/pub/mirrors/ghost/ghostgum/
</pre>
<p>Placera zlib DLL i samma katalog som GSview EXE. 
zlib16.dll &#228;r f&#246;r Win16.  zlib32.dll &#228;r f&#246;r Win32. 
zlib2.dll &#228;r f&#246;r OS/2. 
<p>zlib &#228;r Copyright 1995-1996 f&#246;r Jean-loup Gailly och Mark Adler. 
K&#228;llkoden kan tas hem fr&#229;n 
<pre>
 http://www.info-zip.org/pub/infozip/zlib/
</pre>
<p>
<p>
<hr>
<h2><a name="Internt">Internt</a></h2>
GSview anv&#228;nder AFPL Ghostscript DLL f&#246;r att rendera PostScriptfiler. 
<p>Under Win32s, kan GS DLL anv&#228;ndas av endast en applikation i taget. 
Under Windows 95, Windows NT och OS/2, kan GS DLL anv&#228;ndas av m&#229;nga 
applikationer i taget (under f&#246;ruts&#228;ttning att du tillr&#228;ckligt med minne). 
N&#228;r du anv&#228;nder Win32s, m&#229;ste GSview f&#246;rst ladda ur GS DLL medan den 
anv&#228;nds av gvwgs.exe f&#246;r utskrifter. 
<p>gsv16spl.exe &#228;r en 16 bitars Windows applikation som anv&#228;nds av GSview f&#246;r att spoola 
filer fr&#229;n GSview Win32s.  gsv16spl kan inte anv&#228;ndas sj&#228;lvst&#228;ndigt - den 
m&#229;ste startas av GSview.  Den anv&#228;nds inte av Windows 95 eller NT. 
<p>gvwgs32.exe (Windows) och gvpgs.exe (OS/2) &#228;r GS DLL laddare f&#246;r 
utskrifter.  Det skulle vara m&#246;jligt att anv&#228;nda dom i en kommandosession, 
men eftersom dom raderar de filer som listas fr&#229;n kommandoraden 
&#228;r det s&#228;krare att anv&#228;nda gswin32.exe (Win32), gswin32c.exe 
(Win32 konsoll) eller gsos2.exe (OS/2). 

<p><hr>Created automatically by doc2html
</body>
</html>
