<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title> GSview Hilfe</title>
</head>
<body>
<h1> GSview Hilfe</h1>
<hr>
<h1><a name="Inhalts&#252;bersicht">Inhalts&#252;bersicht</a></h1>
<p>Das Programm <b>GSview</b> stellt eine grafische Schnittstelle f&#252;r Ghostscript 
unter MS-Windows, OS/2 und GNU/Linux dar. 
<p>Das Programm Ghostscript ist ein Interpreter f&#252;r die 
Seitenbeschreibungssprache PostScript, die vor allem Laserdrucker nutzen. 
<p>Mit GSview k&#246;nnen ausgew&#228;hlte Seiten von Dokumenten, die den von Adobe 
entwickelten PostScript Document Structuring Conventions 
(DSC-Konventionen) entsprechen, auf dem Bildschirm dargestellt und auf 
einen Drucker ausgegeben werden. 
Die Version GSview 4.4 erfordert Ghostscript in der Version 7.04 - 8.99. 
<p>
<a href="#Installation">Installation</a><br>
<a href="#Registrierung">Registrierung</a><br>
<a href="#Document_Structuring_Conventions_(DSC-Kommentare)">Document Structuring Conventions (DSC-Kommentare)</a><br>
<a href="#PDF-Format_(Portable_Document_Format)">PDF-Format (Portable Document Format)</a><br>
<a href="#Datei_&#246ffnen">Datei &#246ffnen</a><br>
<a href="#Seiten_ausw&#228hlen">Seiten ausw&#228hlen</a><br>
<a href="#Datei-Informationen">Datei-Informationen</a><br>
<a href="#Drucken">Drucken</a><br>
<a href="#Konvertierungen">Konvertierungen</a><br>
<a href="#Dateikonvertierungen_und_Tricks">Dateikonvertierungen und Tricks</a><br>
<a href="#Messen">Messen</a><br>
<a href="#Optionen">Optionen</a><br>
<a href="#Seitenausrichtung">Seitenausrichtung</a><br>
<a href="#Anzeige_Einstellungen">Anzeige Einstellungen</a><br>
<a href="#Seitenformat">Seitenformat</a><br>
<a href="#Tastenkombinationen">Tastenkombinationen</a><br>
<a href="#Aufruf-Optionen">Aufruf-Optionen</a><br>
<a href="#World_Wide_Web">World Wide Web</a><br>
<a href="#Copyright">Copyright</a><br>
<a href="#H&#228ufig_auftretende_Probleme">H&#228ufig auftretende Probleme</a><br>
<a href="#Andere_n&#252tzliche_Programme">Andere n&#252tzliche Programme</a><br>
<a href="#Weitere_Hilfethemen">Weitere Hilfethemen</a><br>
<p>
<hr>
<h1><a name="Installation">Installation</a></h1>
Zur Installation von GSview verwenden Sie 
das Installationsprogramm <b>setup.exe</b>. 
GSview f&#252;r MS-Windows wird als selbstentpackendes Archiv bereitgestellt. 
Die Ausf&#252;hrung des Archivs startet das Installationsprogramm. 
Ghostscript muss gesondert installiert werden. 
<p>Wenn die Installation manuell durchgef&#252;hrt werden soll, lesen Sie das 
Hilfethema <a href="#Manuelle_Installation">Manuelle Installation</a>. 
<p>Die Konfiguration findet beim ersten Start von GSview statt. 
Wenn Sie die Konfiguration sp&#228;ter &#228;ndern wollen, verwenden Sie 
<a href="#Optionen">Optionen</a> | <a href="#Einfache_Konfiguration">Einfache Konfiguration</a> oder 
<a href="#Optionen">Optionen</a> | <a href="#Fortgeschrittene_Konfiguration">Fortgeschrittene Konfiguration</a>. 
<p>Siehe auch <a href="#Optionen">Optionen</a> | <a href="#Sprache">Sprache</a>. 
<p>
<a href="#Beschaffung_von_Ghostscript">Beschaffung von Ghostscript</a><br>
<a href="#Ghostscript_installieren">Ghostscript installieren</a><br>
<a href="#Deinstallation_von_GSview">Deinstallation von GSview</a><br>
<a href="#Manuelle_Installation">Manuelle Installation</a><br>
<a href="#Fortgeschrittene_manuelle_Installation">Fortgeschrittene manuelle Installation</a><br>
<a href="#Installation_im_Netzwerk">Installation im Netzwerk</a><br>
<a href="#GSview_vom_Datei-Manager_oder_Windows_Explorer_starten">GSview vom Datei-Manager oder Windows Explorer starten</a><br>
<p>
<hr>
<h2><a name="Beschaffung_von_Ghostscript">Beschaffung von Ghostscript</a></h2>
GSview ben&#246;tigt Aladdin or AFPL Ghostscript.  GSview und Ghostscript 
sind gesondert erh&#228;ltlich von 
<pre>
 http://www.cs.wisc.edu/~ghost/
</pre>
<p>Um GSview zu konfigurieren, muss man Ghostscript und GSview 
beschaffen und installieren und dann GSview starten. 
<p>
<p>
<hr>
<h2><a name="Ghostscript_installieren">Ghostscript installieren</a></h2>
AFPL Ghostscript ist als selbstentpackendes Archiv 
erh&#228;ltlich, welches sich selbst installiert. 
Details der manuellen Installation von Ghostscript lese man in den 
Ghostscript-Dokumentationsdateien Install.htm and Use.htm nach. 
<p>
<p>
<hr>
<h2><a name="Deinstallation_von_GSview">Deinstallation von GSview</a></h2>
Um GSview von Windows 95 oder NT 4.0 zu deinstallieren, 
benutzen Sie <b>Installieren/Deinstallieren</b> aus dem Windows Men&#252;. 
<p>
<a href="#Manuelle_Deinstallation">Manuelle Deinstallation</a><br>
<p>
<hr>
<h3><a name="Manuelle_Deinstallation">Manuelle Deinstallation</a></h3>
Um GSview zu deinstallieren, l&#246;schen Sie die Dateien im 
Verzeichnis <b>gsview</b>. 
L&#246;schen Sie auch 
<pre>
 c:\windows\gsview32.ini
</pre>
<p>aus dem entsprechenden Systemverzeichnis. 
<p>For Windows NT l&#246;schen Sie evtl. auch gsview32.ini aus den 
Nutzerprofil-Verzeichnissen. 
<p>Entfernen Sie die <b>Ghostgum</b>-Gruppe aus dem Programm-Manager oder 
Startmen&#252;. 
<p>Wenn Sie wissen, wie die Registrierungsdatenbank editiert wird, l&#246;schen 
Sie die folgenden Eintr&#228;ge: 
<pre>
 HKEY_CLASSES_ROOT\psfile
 HKEY_CLASSES_ROOT\.eps
 HKEY_CLASSES_ROOT\.ps
 HKEY_CLASSES_ROOT\MIME\Database\Content Type\application/postscript
</pre>
<p>Wenn Sie PDF mit GSview assoziiert hatten, m&#252;ssen Sie auch 
<pre>
 HKEY_CLASSES_ROOT\pdffile
 HKEY_CLASSES_ROOT\.pdf
 HKEY_CLASSES_ROOT\MIME\Database\Content Type\application/pdf
</pre>
<p>entfernen. 
<p>Ghostscript wird am besten mittels  <b>Installieren/Deinstallieren</b> 
aus dem Windows Men&#252; entfernt. 
<p>Um Ghostscript manuell zu deinstallieren, muss man die Dateien 
im <b>gsN.NN</b>-Verzeichnis l&#246;schen (N.NN ist die Ghostscript- 
Versionsnummer). 
<p>
<p>
<hr>
<h2><a name="Manuelle_Installation">Manuelle Installation</a></h2>
Wir empfehlen Ihnen, GSview mit dem Installationsprogramm zu installieren. 
Im folgenden wird beschrieben, wie die Installation ohne das Installationsprogramm 
durchzuf&#252;hren ist. 
<p>Legen Sie die Umgebungsvariable TEMP an, die auf ein Verzeichnis f&#252;r 
tempor&#228;re Dateien zeigt. 
Beispiel: 
<pre>
  SET TEMP=c:\temp
</pre>
<p>Voraussetzung hierf&#252;r ist, da&#223; dieses Verzeichnis bereits angelegt und 
beschreibbar ist. 
<p>Anschlie&#223;end installieren Sie das Programm Ghostscript einschlie&#223;lich 
aller Bibliotheksdateien (lib/*) und Fonts. 
F&#252;r die Installation ben&#246;tigen Sie die Version von Ghostscript, die in der 
<a href="#Inhaltsübersicht">Inhalts&#252;bersicht</a> angegeben ist, da das Programm GSview mit anderen 
Ghostscript-Versionen nicht kompatibel ist. 
Installieren Sie Ghostscript in das Verzeichnis c:\gs\gsN.NN 
(Ersetzen Sie N.NN durch die Ghostscript-Versionsnummer.) 
<p>Erstellen Sie das Verzeichnis c:\ghostgum\gsview. 
<p>Anschlie&#223;end kopieren Sie 
GSview f&#252;r Windows, indem Sie gsview32.exe, gsv16spl.exe, gvwgs32.exe, 
gsvw32de.dll, gsvw32fr.dll, 
gsviewen.hlp, gsviewde.hlp, gsviewfr.hlp, 
und printer.ini 
in das Verzeichnis <b>c:\ghostgum\gsview</b>. 
<p>Starten Sie das Programm GSview und w&#228;hlen Sie die passende Ghostscript- 
Version (i.allg. die neueste).  F&#252;r sp&#228;tere &#196;nderungen w&#228;hlen Sie 
<a href="#Optionen">Optionen</a> | <a href="#Einfache_Konfiguration">Einfache Konfiguration</a>. 
<p>F&#252;r mehr Kontrolle &#252;ber die Konfiguration siehe 
<a href="#Fortgeschrittene_manuelle_Installation">Fortgeschrittene manuelle Installation</a>. 
<p>
<p>
<hr>
<h2><a name="Fortgeschrittene_manuelle_Installation">Fortgeschrittene manuelle Installation</a></h2>
Anstatt den Men&#252;punkt <a href="#Optionen">Optionen</a> | <a href="#Einfache_Konfiguration">Einfache Konfiguration</a> zu w&#228;hlen, 
verwenden Sie <a href="#Optionen">Optionen</a> | <a href="#Fortgeschrittene_Konfiguration">Fortgeschrittene Konfiguration</a>. 
<p>Geben Sie zuerst korrekte Werte in die drei Textfelder ein (s. 
<a href="#Fortgeschrittene_Konfiguration">Fortgeschrittene Konfiguration</a>). 
<p>W&#228;hlen Sie entweder im Dialog <a href="#Fortgeschrittene_Konfiguration">Fortgeschrittene Konfiguration</a> 
die Markierungsk&#228;stchen <b>Kopiere Druckerstandards</b>, 
<b>Assoziiere .ps Dateien mit GSview</b> und 
<b>Erzeuge Startmen&#252;eintr&#228;ge</b> oder f&#252;hren Sie die folgenden drei Schritte 
aus: 
<p>1. Schlie&#223;en Sie GSview, dann h&#228;ngen Sie printer.ini an die GSview 
INI-Datei c:\windows\gsview32.ini an. 
<p>2. F&#252;gen Sie die .ps und .eps (und optional .pdf) Dateitypen der 
Registrierungsdatenbank zu. 
<p>3. Erstellen Sie einen Programm-Manager- oder Startmen&#252;-Eintrag f&#252;r 
GSview. 
<p>Befinden Sie auf Ihrem System Type 1 Fonts, kann Ghostscript diese 
verarbeiten. 
Um sich hierzu Beispiele anzuschauen, lesen Sie die Dateien <b>fontmap.os2</b> 
und <b>fontmap.atm</b>,  die mit Ghostscript geliefert werden. 
Siehe auch <b>Fonts</b>. 
<p>Wenn bei der Arbeit mit GSview Probleme auftreten, finden Sie erste 
L&#246;sungsans&#228;tze in <a href="#Häufig_auftretende_Probleme">H&#228;ufig auftretende Probleme</a>. 
<p>
<p>
<hr>
<h2><a name="Installation_im_Netzwerk">Installation im Netzwerk</a></h2>
Installieren Sie das Programm GSview in ein Netzwerk-Verzeichnis. 
<p>Wenn Sie GSview zum ersten Mal aufrufen oder das Programm starten, nachdem 
die Versionsnummer ge&#228;ndert wurde, f&#252;hrt GSview die Konfiguration des 
lokalen Computers durch. 
<p>Unter Windows 3.x darf kein UNC-Pfad verwendet werden! Mit Windows 95 
sind keine Probleme bekannt. 
<p>GSview versucht nutzerspezifische Konfigurationsdateien zu unterst&#252;tzen. 
Wenn Benutzerprofile unter Windows 95 oder NT benutzt werden, dann 
speichert Gsview die INI Datei in dem Verzeichnis des in der Registrierungs- 
datenbank angegebenen Benutzerprofils. Wird dieses nicht gefunden, aber die 
Umgebungsvariable USERPROFILE existiert und ist ein Verzeichnis, wird die 
INI Datei dort gespeichert. 
Anderenfalls wird die INI-Datei standardm&#228;&#223;ig im Windows-Verzeichnis 
gespeichert. 
Existiert ein Nutzerprofilverzeichnis, welches aber schreibgesch&#252;tzt ist, 
wird es Probleme bei der Nutzung von GSview geben. 
<p>Wenn Sie es verhindern wollen, da&#223; das Installationsprogramm beim ersten Start 
von Gsview oder bei Updates von Gsview <a href="#Einfache_Konfiguration">Einfache Konfiguration</a> anzeigt, dann  
sollten Sie eine INI Datei in das GSview Verzeichnis kopieren. 
<b>Bei zuk&#252;nftigen Updates kann es jedoch erforderlich sein, diese Datei wieder 
zu entfernen.</b> 
Diese sollte nur jene Eintr&#228;ge enthalten, die in der Benutzerkonfiguration 
&#252;berschrieben werden sollen. 
Die vorgeschlagene Methode ist zuerst Gsview zu installieren und dann zu 
konfigurieren. 
Kopieren Sie 
gsview32.ini 
aus dem Systemverzeichnis oder dem 
Benutzerprofil-Verzeichnis in das GSview Verzeichnis und entfernen Sie alle 
Eintr&#228;ge bis auf: 
<pre>
 [GSview-4.4]
 Version=4.4
 GSversion=800
 Configured=1
 GhostscriptDLL=E:\gs\gs8.00\bin\gsdll32.dll
 GhostscriptInclude=E:\gs\gs8.00\lib;E:\gs\fonts
 GhostscriptOther=-dNOPLATFONTS -sFONTPATH="c:\psfonts"
</pre>
<p>Wenn ein Benutzer GSview startet, dann wird normalerweise seine INI Datei benutzt. 
Startet GSview das erste Mal oder die Version von Gsview stimmt nicht mit der in 
der INI Datei &#252;berein, dann passiert folgendes: 
<p>1. Die INI Datei in dem Gsview Verzeichnis wird gelesen und &#252;berschreibt die 
INI-Datei des Benutzers. 
<p>2. Die Druckerliste wird gem&#228;&#223; printer.ini aus dem GSview-Verzeichnis aktualisiert. 
<p>3. Dateiverkn&#252;fungen (.ps, .eps, .pdf) werden NICHT angelegt oder ver&#228;ndert. 
Wenn Sie dieses Verhalten &#228;ndern m&#246;chten, so w&#228;hlen Sie 
<a href="#Optionen">Optionen</a> | <a href="#Fortgeschrittene_Konfiguration">Fortgeschrittene Konfiguration</a>. 
<p>4. Programmmanagergruppen / Startmen&#252;eintr&#228;ge / Programmobjekte werden NICHT 
ver&#228;ndert. Wenn Sie dieses Verhalten &#228;ndern m&#246;chten, so w&#228;hlen Sie 
<a href="#Optionen">Optionen</a> | <a href="#Fortgeschrittene_Konfiguration">Fortgeschrittene Konfiguration</a>. 
<p>Wenn Sie unter Windows NT4/2000 installieren und "All Nutzer" w&#228;hlen, 
dann schreibt das Installationsprogramm die gsview32.ini in Ihr GSview- 
Verzeichnis. Sie m&#252;ssen vorher Ghostscript installiert haben. 
<p>Wenn ein Benutzer das GSview-Deinstallationsprogramm aufruft, versucht dieses 
GSview und Ghostscript im Netzwerk zu l&#246;schen.  Stellen Sie deshalb sicher, da&#223; 
die Verzeichnisse von GSview und Ghostscript vor Benutzern schreibgesch&#252;tzt sind. 
Um ganz sicher zu sein, k&#246;nnen Sie auch die Datei <b>uninstal.txt</b> aus dem GSview- 
Verzeichnis nehmen. 
<p>Alternativ k&#246;nnen Sie GSview auf jedem Computer ohne R&#252;ckfragen installieren 
indem Sie das selbstenpackende Archiv durch folgenden Aufruf des Setupprogramms 
entpacken: 
<pre>
 setup -name "Your Name" -number XXXXX-XXXXX "c:\ghostgum"
</pre>
<p>
<p>
<hr>
<h2><a name="GSview_vom_Datei-Manager_oder_Windows_Explorer_starten">GSview vom Datei-Manager oder Windows Explorer starten</a></h2>
Wenn Sie das GSviev-Programm setup.exe verwendet haben und bei der 
Installation alle Fragen mit Ja beantwortet haben, sind die folgenden 
Konfigurationen bereits vorgenommen worden. Wurde das Register 
w&#228;hrend der Installation von GSview nicht aktualisiert, lesen Sie im 
folgenden, wie Sie manuell vorgehen m&#252;ssen. 
<p>Um PostScript-Dateien &#252;ber den Datei-Manager &#246;ffnen zu k&#246;nnen, indem Sie 
auf eine Datei doppelklicken, m&#252;ssen Sie folgenderma&#223;en vorgehen: 
<p>Starten Sie mit dem Befehl <b>Datei </b>| <b>Ausf&#252;hren</b> im <b>Programm-Manager</b> den 
Registriereditor, indem Sie <b>regedit</b> eingeben. 
W&#228;hlen Sie im <b>Registriereditor</b> den Befehl 
<b>Bearbeiten </b>| <b>Dateityp hinzuf&#252;gen</b> und geben Sie folgendes ein: 
<pre>
 Bezeichner = psfile
 Dateityp = PostScript
 Ma&#223;nahme = &#214;ffnen
 Befehl = c:\ghostgum\gsview\gsview32 %1
 Verwendet DDE = deaktiviert
 Ma&#223;nahme = Drucken
 Befehl = c:\ghostgum\gsview\gsview32 /p %1
 Verwendet DDE = deaktiviert
</pre>
<p>Dr&#252;cken Sie anschlie&#223;end auf <b>OK</b>. 
<p>W&#228;hlen Sie anschlie&#223;end im <b>Datei-Manager</b>, den Befehl 
<b>Datei </b>| <b>Verkn&#252;pfen</b> und tragen in den Feldern folgendes ein: 
<pre>
 Dateien mit Dateinamenerweiterung = ps
 Verkn&#252;pfen mit = PostScript (gsview)
</pre>
<p>Dr&#252;cken Sie auf <b>OK</b>. 
<p>Wenn Sie jetzt auf eine PostScript-Datei doppelklicken, wird GSview vom 
Datei-Manager aus gestartet. 
Wird eine PostScript-Datei an den <b>Druck-Manager </b>geleitet, druckt 
GSview diese Datei. 
Da dieses bei einem PostScript-Drucker nicht sinnvoll ist, m&#252;ssen Sie in 
diesem Fall die Zeile  Vorgang = Drucken aus dem Register entfernen. 
<p>Unter Windows 95 erfolgt die Konfiguration im <b>Windows Explorer</b>. 
<p>Starten Sie den Windows Explorer. W&#228;hlen Sie den Befehl 
<b>Ansicht </b>| <b>Optionen </b>. Klicken Sie auf die Registerkarte <b>Datentypen</b> 
und anschlie&#223;end auf die Schaltfl&#228;che <b>Neuer Typ</b>. 
F&#252;llen Sie die Felder folgenderma&#223;en: 
<pre>
 Beschreibung = PostScript
 Verkn&#252;pfte Erweiterung = PS EPS
</pre>
<p>Klicken Sie auf die Schaltfl&#228;che <b>Neu</b> und tragen folgendes in die 
Felder ein: 
<pre>
 Vorgang = open
 Anwendung f&#252;r diesen Vorgang = c:\ghostgum\gsview\gsview32.exe
</pre>
<p>Dr&#252;cken Sie auf <b>OK</b>. 
<p>Dr&#252;cken Sie erneut auf die Schaltfl&#228;che <b>Neu</b> und tragen folgendes ein: 
<pre>
 Vorgang = drucken
 Anwendung f&#252;r diesen Vorgang = c:\ghostgum\gsview\gsview32.exe /p
</pre>
<p>Klicken Sie auf die Schaltfl&#228;che <b>OK</b>. 
<p>Klicken Sie auf die Schaltfl&#228;che<b> Schlie&#223;en</b>. 
<p>Klicken Sie auf die Schaltfl&#228;che<b> Schlie&#223;en</b>. 
<p>
<p>
<hr>
<h1><a name="Registrierung">Registrierung</a></h1>
Wenn Sie die Entwicklung von GSview unterst&#252;tzen wollen, 
oder die Startseite von GSview nicht mehr sehen wollen, 
dann registrieren Sie GSview. Es besteht keine Verpflichtung 
GSview zu lizensieren, es ist vef&#252;gbar im Rahmen der 
Aladdin Free Public Licence, die in der Datei <b>LICENCE</b> zu 
finden ist. 
Dies erlaubt die freie Benutzung, schr&#228;nkt aber die 
kommerzielle Verwendung ein. 
<p>Die Registrierungsgeb&#252;hr betr&#228;gt zur Zeit AUD$40. 
GSview kann online registriert werden unter 
<pre>
 http://www.ghostgum.com.au/
</pre>
<p>oder durch Fax oder Email des Registrierungsformulars, 
welches in der Datei <b>regorder.txt</b> im GSview Verzeichnis 
zu finden ist. 
Wir bevorzugen die online Registrierung. 
<p>
<p>
<hr>
<h1><a name="Document_Structuring_Conventions_(DSC-Kommentare)">Document Structuring Conventions (DSC-Kommentare)</a></h1>
Mit der Entwicklung dieser Konventionen hat Adobe einen Zusatz zur 
eigentlichen Seitenbeschreibungssprache geschaffen, der Informationen 
&#252;ber die Darstellung der Seiteninhalte und die Ressourcen enth&#228;lt, 
die zum Ausdrucken einer PostScript-Datei ben&#246;tigt werden. 
<p>Wenn eine Datei diese DSC-Kommentare enth&#228;lt, kann GSview &#252;ber die 
Funktionen <a href="#Seiten_auswählen">Gehe zu Seite</a> bzw. 
<a href="#Seiten_auswählen">Vorherige Seite</a> vor- bzw. zur&#252;ckbl&#228;ttern. Somit k&#246;nnen einzelne Seiten 
extrahiert oder separat ausgedruckt werden. 
<p>Enth&#228;lt eine Datei keine DSC-Kommentare, kann GSview die Seiten nur 
sequentiell in der urspr&#252;nglichen Reihenfolge anzeigen. 
<p>Der erste Eintrag bei DSC-kompatiblen Dateien lautet: 
<pre>
 %!PS-Adobe-3.0
</pre>
<p>Die Nummer 3.0 entspricht der DSC-Versionsnummer. 
Bei einigen Programmen enthalten die PostScript-Dateien als erstes Zeichen 
in der Zeile das Steuerzeichen Ctrl-D, das vor den oben aufgef&#252;hrten 
Kommentar gesetzt wird. 
GSview erkennt in diesem Fall, da&#223; diese Dateien nicht den 
DSC-Konventionen entsprechen, erm&#246;glicht aber trotzdem eine Anzeige 
mit den unterschiedlichen M&#246;glichkeiten der Seitenauswahl. 
Wenden Sie sich in diesem Fall an die Firma, die das entsprechende 
Programm und damit die PostScript-Datei entwickelt hat. 
Um diese PostScript-Dateien DSC-kompatibel zu machen, editieren Sie die 
Datei und entfernen das Zeichen Ctrl-D. 
<p>Die Seitenbeschreibungen von DSC-kompatible Dateien sehen 
folgenderma&#223;en aus: 
<pre>
 %%Pages: 24
 %%Page: 1 1
</pre>
<p>&#220;ber diese Zeilen erh&#228;lt GSview Informationen dar&#252;ber, wie viele Seiten 
ein Dokument enth&#228;lt und wo diese Seiten beginnen. 
GSview ben&#246;tigt diese Informationen, um einzelne Seiten ausw&#228;hlen 
zu k&#246;nnen. 
<p>EPS-Dateien (Encapsulated PostScript Files) beschreiben einzelne Seiten 
und enthalten eine Vielzahl von  <b>DSC</b>- und PostScript-Kommentaren. 
EPS-Dateien beginnen mit der Kommentarzeile: 
<pre>
 %!PS-Adobe-3.0 EPSF-3.0
</pre>
<p>EPS-Dateien werden im allgemeinen daf&#252;r verwendet, Graphiken in andere 
Dokumente einzubetten und ben&#246;tigen daher einen Bounding Box-Kommentar 
f&#252;r die Gr&#246;&#223;enberechnung dieser Graphiken: 
<pre>
  %%BoundingBox: llx lly urx ury
</pre>
<p>Dabei geben die Werte llx, lly, urx und ury die x- und y-Koordinaten 
der linken unteren (lower left) und der rechten oberen (upper right) 
Ecken einer Bounding Box an (die Bounding Box ist das kleinste 
Rechteck, das die Zeichnung voll umschlie&#223;t). 
<p>Einige EPS-Dateien enthalten Preview-Teile des PostScript-Dokumentes. 
Diese Preview-Teile k&#246;nnen unterschiedliche Formate haben: 
Windows-Metafile-Format, TIFF-Format oder das EPSI-Format. 
Beim Windows Metafile-Format oder beim TIFF-Format enth&#228;lt die 
EPS-Datei unter DOS  einen bin&#228;ren Header, der Ausrichtung und L&#228;nge 
des Preview-Teils sowie den PostScript-Teil der Datei n&#228;her beschreibt. 
Beim EPSI-Format ist der Preview-Teil in den DSC-Kommentaren enthalten. 
Diese beginnen mit: 
<pre>
 %%BeginPreview: width height depth lines
</pre>
<p>Mit der Funktion <a href="#EPS_Vorschau_(Preview)">EPS Vorschau einf&#252;gen</a> kann eine EPS-Datei um diesen 
Preview-Teil erg&#228;nzt werden. 
<p>
<p>
<hr>
<h1><a name="PDF-Format_(Portable_Document_Format)">PDF-Format (Portable Document Format)</a></h1>
PDF-Dateien k&#246;nnen mit GSview zwar angezeigt und ausgedruckt werden, 
es k&#246;nnen jedoch verschiedene Probleme dabei auftreten: 
<p>Bei der Anzeige ignoriert GSview die Papiergr&#246;&#223;e im Men&#252; "Formate" und 
verwendet stattdessen die /MediaBox aus der PDF-Datei. 
Wenn  <a href="#Optionen">Optionen</a> | <a href="#EPS_Ausschnitt">EPS Ausschnitt</a> aktiviert ist, verwendet GSview die 
/CropBox aus der PDF-Datei. 
<p>Um die Seitenanzahl bestimmen zu k&#246;nnen, mu&#223; GSview eine PDF-Datei 
<a href="#Datei_öffnen">&#214;ffnen</a>. Wenn Sie stattdessen die Funktion <a href="#Datei_öffnen">Auswahl Datei</a> anw&#228;hlen, 
kann GSview folgende Funktionen nicht nutzen: <a href="#Text_extrahieren_und_Suche">Text extrahieren</a>, <a href="#Text_extrahieren_und_Suche">Suche</a>, 
<a href="#Seiten_auswählen">Gehe zu Seite</a> sowie alle Funktionen, bei denen die Seitenanzahl des 
Dokumentes wichtig ist. 
<p>Die Unterst&#252;tzung von pdfmark Verweisen ist schlecht. 
<p>Um eine Postscript-Datei in eine PDF-Datei zu konvertieren, benutzen sie 
<a href="#Datei_öffnen">Datei</a> | <a href="#Konvertierung">Konvertierung</a> und w&#228;hlen als Ger&#228;t <b>pdfwrite</b>. 
<p>Um eine PDF-Datei in eine Postscript-Datei zu konvertieren, benutzen sie 
<a href="#Datei_öffnen">Datei</a> | <a href="#Konvertierung">Konvertierung</a> und w&#228;hlen als Ger&#228;t <b>pswrite</b>. 
<p><a href="#Datei_öffnen">Datei</a> | <a href="#Extrahiere">Extrahiere</a> funktioniert nicht bei PDF-Dateien. 
Das Extrahieren von PDF-Seiten extrahiert Postscript statt PDF. 
<p>Um mehrere Dateien im Batch-Betrieb zu konvertieren, sehen sie sich bitte 
<pre>
 die Dateien ps2pdf.bat und pdf2ps.bat
</pre>
<p>im Ghostscript Verzeichnis an. Sie m&#252;ssen 
gswin32c.exe 
anstelle von gs.exe benutzen. Ferner m&#252;ssen sie den Inkludierungspfad setzen, 
entweder mit <b>-I</b> oder mit der Umgebungsvariablen <b>GS_LIB</b>. 
<p>
<p>
<hr>
<h1><a name="Datei_&#246;ffnen">Datei &#246;ffnen</a></h1>
Mit dem Befehl <b>&#214;ffnen</b> im Men&#252; <b>Datei</b> wird eine Datei ge&#246;ffnet und die 
erste Seite dieser Datei angezeigt. 
<p>Enth&#228;lt die Datei <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-Kommentare, k&#246;nnen mit den Funktionen 
<a href="#Seiten_auswählen">N&#228;chste Seite</a>, <a href="#Seiten_auswählen">Vorherige Seite</a> und <a href="#Seiten_auswählen">Gehe zu Seite</a> einzelne Seiten 
ausgew&#228;hlt werden. 
<p>Enth&#228;lt die Datei dagegen keine <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-Kommentare, k&#246;nnen Sie die 
Funktionen <a href="#Seiten_auswählen">Vorherige Seite</a> und <a href="#Seiten_auswählen">Gehe zu Seite</a> nicht anw&#228;hlen. 
&#214;ffnen Sie in diesem Fall erst eine neue Datei, nachdem die letzte 
Seite der Datei angezeigt wurde. 
<p>Ist die Datei ge&#246;ffnet, werden der Dateiname und die aktuelle Seitenzahl 
(wenn m&#246;glich) angezeigt. Befindet sich der Cursor auf der ausgew&#228;hlten 
Seite, wird mittels Koordinaten zus&#228;tzlich die Cursorposition angegeben. 
Welche Einheit hierbei angezeigt werden soll, definieren Sie in 
<a href="#Optionen">Optionen</a> | <b>Einheiten</b>. Sie k&#246;nnen zwischen Punkt (PostScript), 
Inch und Millimeter w&#228;hlen. Die Angabe der Cursorposition kann z.B. 
bei der Berechnung von Bounding Boxen hilfreich sein. 
<p>Der Befehl <b>Auswahl Datei</b> hat eine &#228;hnliche Funktion wie der Befehl 
<b>&#214;ffnen</b>, mit diesem Befehl kann die Datei jedoch nicht auf dem 
Bildschirm dargestellt werden. Benutzen Sie diesen Befehl, um eine Datei 
kurz zu &#246;ffnen und sie anschlie&#223;end zu drucken. 
<p>Mit dem Befehl <b>Speichern unter</b> fertigen Sie eine Kopie des aktuellen 
Dokumentes an. 
Verwenden Sie diese Funktion z.B., wenn GSview von einer anderen Anwendung 
als PostScript-Viewer benutzt wird und die angezeigte Datei gespeichert 
werden soll. 
<p>Mit dem Befehl <b>Schlie&#223;en</b> wird das aktuelle Dokument geschlossen. 
Schlie&#223;en Sie ein Dokument immer, bevor Sie es mit einem anderen Programm 
weiterbearbeiten. Wird ein Dokument nicht geschlossen und GSview erkennt, 
da&#223; sich die Dateil&#228;nge oder das Datum ge&#228;ndert haben, wird Ghostscript 
beendet und das Dokument erneut eingelesen. 
<p>Siehe auch <a href="#Drucken">Drucken</a>. 
<p>
<p>
<hr>
<h1><a name="Seiten_ausw&#228;hlen">Seiten ausw&#228;hlen</a></h1>
Mit dem Befehl <b>Ansicht</b> | <b>N&#228;chste Seite</b> oder dem Symbol <b>+</b> der 
Hilfsmittelpalette gelangen Sie auf die n&#228;chste Seite eines Dokumentes. 
Dieser Befehl funktioniert auch, wenn die Datei keine <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-Kommentare 
enth&#228;lt. 
<p>Mit dem Befehl <b>Ansicht</b> | <b>Vorherige Seite</b> oder dem Symbol <b>-</b> gelangen 
Sie auf die vorherige Seite des Dokumentes. 
<p>Der Befehl <b>Ansicht</b> | <b>Wiederaufbau</b> oder <b>F5</b> wird verwendet, um die 
aktuelle Seite neu aufzubauen. 
<p>Der Befehl <b>Anzeige</b> | <b>Gehe zu Seite</b> oder das Symbol mit der Hand &#246;ffnet 
ein Dialogfeld, in dem Sie die Seite ausw&#228;hlen m&#252;ssen, die als n&#228;chstes 
angezeigt werden soll. 
In diesem Dialogfeld werden die Bezeichnungen der Seiten angegeben, 
da es sinnvoller ist, diese anzugeben als aufeinanderfolgende 
Seitenzahlen. 
<p>Mit dem Befehl <b>Anzeige</b> | <b>N&#228;chste Seite oben</b> oder der Leertaste 
gelangen Sie an den Anfang der n&#228;chsten Seite. 
<p>Mit dem Befehl <b>Anzeige</b> | <b>Vorherige Seite oben</b> oder der 
BackSpace-Taste gelangen Sie an den Anfang der vorherigen Seite. 
<p>Die Befehle <b>Vorherige Seite</b>, <b>Wiederaufbau</b> und <b>Gehe zu Seite</b> 
funktionieren nur, wenn die Datei <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-Kommentare enth&#228;lt. 
<p><b>Anzeige</b> | <b>Fenster an Seite anpassen</b> oder <b>F6</b> &#228;ndern die Aufl&#246;sung 
der Anzeige, so dass die gesamte Seite in das aktuelle Fenster passt. 
Wiederholte Ausl&#246;sung f&#252;hrt zur Anpassung der Breite oder H&#246;he der 
Seite an das Fenster. 
<p><b>Anzeige</b> | <b>Vollbild</b> oder <b>F4</b> zeigen die Seite im Vollbildmodus 
(ohne Titelbalken, Rollbalken usw.) an. 
Durch Dr&#252;cken der Escape-Taste kehrt man zur normalen Anzeige zur&#252;ck. 
<p>
<p>
<hr>
<h1><a name="Datei-Informationen">Datei-Informationen</a></h1>
Im oberen Bildschirmbereich werden der Dateiname und die aktuelle 
Seitenzahl angezeigt. 
Befindet sich der Cursor auf der ausgew&#228;hlten Seite, wird zus&#228;tzlich 
die Cursorposition relativ zur linken unteren Ecke der Seite angegeben. 
Welche Einheit hierbei angezeigt werden soll, definieren Sie in 
<a href="#Optionen">Optionen</a> | <a href="#Maßeinheiten">Ma&#223;einheiten</a>. Sie k&#246;nnen zwischen Punkt (PostScript), 
Inch und Millimeter w&#228;hlen. 
Die Angabe der Cursorposition kann z.B. bei der Berechnung von 
Bounding Boxen hilfreich sein. 
<p>Nach Auswahl des Befehls <b>Info</b> im Men&#252; <b>Datei </b>wird ein Dialogfeld mit 
Informationen bez&#252;glich der <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-Kommentare im aktuellen Dokument 
angezeigt. 
<p>Im Feld <a href="#Datei_öffnen">Datei</a> wird der vollst&#228;ndige Pfad der Datei angegeben. 
<p>Im Feld <b>Typ</b> steht entweder<b> DSC</b>,<b> EPS</b>, <b>Keine DSC Anweisungen</b> oder 
<b>Ignoriere DSC Anweisungen</b>. 
<a href="#Document_Structuring_Conventions_(DSC-Kommentare)">EPS</a> (Encapsulated PostScript File) ist ein Einzelseitendokument, das 
eine Folge von <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-Kommentaren und PostScript-Befehlen enth&#228;lt. 
<b>EPS </b>-Dateien werden normalerweise in andere Dokumente eingebettet. 
Die Meldung <b>Ignoriere DSC Anweisungen</b> erhalten Sie, wenn die Funktion 
<a href="#Optionen">Optionen</a> | <a href="#Ignoriere_DSC">Ignoriere DSC</a> aktiviert ist. 
Enth&#228;lt das Dokument die Steuerzeichen Ctrl+D oder eine PJL-Anweisung, 
bedeutet dies, da&#223; das Dokument nicht DSC-kompatibel ist, da der Anfang des 
Dokumentes nicht korrekt ist. Wie das Ctrl+D-Problem behoben werden 
kann, lesen Sie unter dem Hilfethema <b>H&#228;ufig aufretende Probleme</b>. 
Um Probleme mit PJL-Anweisungen zu vermeiden, setzen Sie bei 
PostScript-Dokumenten, die an andere Drucker weitergeleitet 
werden sollen, keinen HP-Laserjet-Druckertreiber ein. 
<p>Die Eintragung im Feld <b>Titel</b> kann dazu benutzt werden, Titelseiten 
auszudrucken und Dokumente weiterzuleiten oder zu erkennen. 
<p>Im Feld <b>Datum</b> wird angezeigt, wann das Dokument erzeugt wurde. 
<p>Bei der <a href="#PS_zu_EPS">Bounding Box</a> handelt es sich um einen Kasten (Rahmen), 
der alle dargestellten Punkte auf der Seite umschlie&#223;t. Dabei geben die 
Werte die x- und y-Koordinaten der linken unteren (lower left) und der 
rechten oberen (upper right) Ecken der Bounding Box in Standard- 
Nutzerkoordinaten (1/72 Zoll) an. 
<p>Die <a href="#Seitenausrichtung">Ausrichtung</a> ist die Standard-Seitenausrichtung und entweder Hoch- 
oder Querformat. Siehe Men&#252; <a href="#Seitenausrichtung">Seitenausrichtung</a>. 
<p>Die <b>Seitenordnung</b> kann <b>Ascending</b> (aufsteigend), <b>Descending</b> 
(absteigend) oder <b>Special</b> (spezial) sein. 
Wird <b>Descending</b> angegeben, so dreht GSview automatisch die Reihenfolge 
um, so da&#223; die Seiten beim Anzeigen und Drucken trotzdem in aufsteigender 
Reihenfolge dargestellt werden. Beim Extrahieren und Drucken kann GSview 
instruiert werden, die Seiten in absteigender (umgekehrter) Reihenfolge 
auszugeben. <b>Special</b> vermeidet eine Umordnung der Seiten. 
<p>Im Feld <b>Papierformat</b> wird das Papierformat angegeben, gefolgt von der 
Standardeinstellung f&#252;r H&#246;he und Breite in Standard-Nutzerkoordinaten 
(1/72 Zoll) an.. 
<p>Das Feld <b>Seiten</b> enth&#228;lt die Gesamtanzahl der Seiten des Dokumentes. 
<p>Das Feld <b>Seite</b> enth&#228;lt die Seitenbezeichnung und Seitenzahl. 
<p>Im Feld <b>Bitmap </b>ist die Gr&#246;&#223;e des Bitmaps in Pixeln angegeben. 
Diese Angabe wird zum Kopieren des Dokumentes in die Zwischenablage 
ben&#246;tigt. 
<p>
<p>
<hr>
<h1><a name="Drucken">Drucken</a></h1>
Der Befehl <b>Drucken</b> im <a href="#Datei_öffnen">Datei</a>-Men&#252; erlaubt Dokumente mittels Ghostscript 
auszudrucken. GSview verwendet drei Methoden zum Drucken: 
<a href="#Windows_GDI-Drucker">Windows GDI-Drucker</a>, <a href="#Ghostscript-Gerät">Ghostscript-Ger&#228;t</a> oder <a href="#PostScript-Drucker">PostScript-Drucker</a>. 
<p><a href="#Windows_GDI-Drucker">Windows GDI-Drucker</a> nutzt Ghostscript um Bitmaps f&#252;r jede Seite zu 
erzeugen, und druckt diese mit dem Standard-Windowsdruckertreiber. 
Das ist die langsamste Druckmethode, die aber mit den meisten Druckern 
funktionieren sollte. 
<p><a href="#Ghostscript-Gerät">Ghostscript-Ger&#228;t</a> nutzt die Ghostscript-Druckertreiber. 
Das ist schneller, aber setzt voraus, dass Ghostscript einen Treiber f&#252;r 
den angeschlossenen Drucker bereitstellt un dass man dessen Namen kennt. 
Zum Beispiel verwendet der HP LaserJet 4 den Treiber ljet4. 
N&#228;here Einzelheiten findet man in der Dokumentation zu Ghostscript. 
<p><a href="#PostScript-Drucker">PostScript-Drucker</a> verwendet zum Drucken nicht Ghostscript, sondern 
schickt die Dateien direkt zum Drucker. 
<p>Es gibt zahlreiche Wechselbeziehungen zwischen den Einstellungen im 
Druckerdialog. Z.B. sperrt die Auswahl von <a href="#Ghostscript-Gerät">Ghostscript-Ger&#228;t</a> den 
<b>Eigenschaften</b>-Druckknopf, weil dieser daf&#252;r nicht relevant ist. 
N&#228;here Einzelheiten findet man in den folgenden Abschnitten. 
<p>Siehe auch <a href="#Dateikonvertierungen_und_Tricks">Dateikonvertierungen</a> und <a href="#Konvertierung">Konvertierung</a>. 
<p>
<a href="#Seitenauswahl">Seitenauswahl</a><br>
<a href="#Windows_GDI-Drucker">Windows GDI-Drucker</a><br>
<a href="#Ghostscript-Ger&#228t">Ghostscript-Ger&#228t</a><br>
<a href="#PostScript-Drucker">PostScript-Drucker</a><br>
<a href="#Drucke_Datei">Drucke Datei</a><br>
<a href="#Einstellung">Einstellung</a><br>
<a href="#Seitengr&#246&#223enanpassung">Seitengr&#246&#223enanpassung</a><br>
<p>
<hr>
<h2><a name="Seitenauswahl">Seitenauswahl</a></h2>
Beim Drucken kann ein Seitenbereich ausgew&#228;hlt werden. 
Innerhalb dieses Bereichs kann man alle, alle ungeraden oder alle geraden 
Seiten w&#228;hlen. Wenn man z.B. ungerade Seiten im Bereich von 10 bis 20 
w&#228;hlt, wird der Druck mit Seite 11 begonnen. 
<p>Der <b>Seitenauswahl</b>-Druckknopf kann blockiert sein, wenn die Druckmethode 
keine Seitenauswahl gestattet. 
<p>Das Markierungsk&#228;stchen <b>Absteigend</b> f&#252;hrt zum Druck der Seiten in absteigender 
Folge. Es ist nur freigegeben, wenn das Dokument <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-Kommentare enth&#228;lt. 
<p>Will man bestimmte Seiten aus einem <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-Dokument mit spezieller Seitenordnung 
(d.h. mit Seiten, die nicht umsortiert werden k&#246;nnen) drucken, so muss man 
<a href="#Windows_GDI-Drucker">Windows GDI-Drucker</a> und <a href="#Ignoriere_DSC">Ignoriere DSC</a> w&#228;hlen. 
<p>
<p>
<hr>
<h2><a name="Windows_GDI-Drucker">Windows GDI-Drucker</a></h2>
Diese Methode nutzt Ghostscript um ein Bitmap f&#252;r jede Seite zu 
erzeugen, und druckt diese mit dem Standard-Windowsdruckertreiber. 
Das sollte mit allen Druckern funktionieren, die Rastergrafik unterst&#252;tzen. 
<p>Im Interesse maximaler Druckgeschwindigkeit wird als Standard ein 
Monochrombitmap verwendet. 
Will man farbige Ausdrucke, so muss man dies mit dem <b>Einstellungs</b>- 
Druckknopf freigeben. 
<p>Um die Verarbeitung von Anfragen der PostScript- oder PDF-Dokumente 
nach Seitengr&#246;&#223;en&#228;nderungen durch GSview zu beeinflussen, siehe 
Abschnitt <a href="#Seitengrößenanpassung">Seitengr&#246;&#223;enanpassung</a>. 
<p><a href="#Optionen">Optionen</a> ist im Allgemeinen leer, kann aber Ghostscript-Kommandozeilen- 
optionen enthalten. Vorsicht bei deren Nutzung! 
<p>Diese Druckmethode erlaubt ausgew&#228;hlte Seiten auch dann zu drucken, wenn 
ein Postscriptdocument keine <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-Kommentare enth&#228;lt. Dies wird durch 
Berechnung aller Seiten mit anschlie&#223;ender Versendung nur der ausgew&#228;hlten 
Seiten an den Drucker erreicht. Dadurch kann die Methode sehr langsam sein. 
<p>
<p>
<hr>
<h2><a name="Ghostscript-Ger&#228;t">Ghostscript-Ger&#228;t</a></h2>
Die <b>W&#228;hle Ghostscript-Ger&#228;t</b>-Dialogbox erlaubt die Auswahl des Ghostscript- 
Druckers und der Aufl&#246;sung. 
Die Standardliste verf&#252;gbarer Ger&#228;te und Aufl&#246;sungen wird im Abschnitt 
[Devices] von gsview32.ini gespeichert und entstammt der Standard-Version 
von Ghostscript 6.0. 
Man kann andere Ger&#228;te oder Aufl&#246;sungen verwenden. 
<p>Zur Verarbeitung von Anforderungen der PostScript- oder PDF-Dokumente 
nach Seitengr&#246;&#223;en&#228;nderungen durch GSview, siehe Abschnitt 
<a href="#Seitengrößenanpassung">Seitengr&#246;&#223;enanpassung</a>. 
<p>Einige Ghostscript-Optionen k&#246;nnen entweder in das <a href="#Optionen">Optionen</a>-Feld 
oder mit dem <b>Eigenschaften</b>-Druckknopf eingegeben werden. 
<p>Der <b>uniprint</b>-Druckknopf w&#228;hlt das uniprint-Ger&#228;t und zeigt eine Liste 
der daf&#252;r verf&#252;gbaren Konfigurationsdateien (*.upp) an. 
W&#228;hlt man eine dieser Konfigurationsdateien aus, wird deren Name im 
<a href="#Optionen">Optionen</a>-Feld der Druckereinstellungen angezeigt. 
Die Konfiguration des uniprint-Ger&#228;tes ist in der Ghostscriptdatei 
<b>Devices.htm</b> genauer beschrieben. 
<p>
<p>
<hr>
<h2><a name="PostScript-Drucker">PostScript-Drucker</a></h2>
Wird <b>PostScript-Drucker</b> gew&#228;hlt, werden die ausgew&#228;hlten Seiten unter 
Umgehung von Ghostscript direkt an die Druckerwarteschlange geschickt. 
Das &#228;hnelt <b>Datei </b>| <a href="#Drucke_Datei">Drucke Datei</a>, au&#223;er da&#223; man die zu druckenden Seiten 
angeben kann. 
<p>Wenn ein PostScript-Drucker &#252;ber eine serielle Schnittstelle angeschlossen 
ist, muss manchmal ein Ctrl+D-Steuerzeichen nach der Postscriptdatei 
gesendet werden und, abh&#228;ngig vom Verhalten anderer Programme, manchmal 
auch vorher. 
Das ist Teil des seriellen Kommunikationsprotokolls, welches diese Drucker 
verwenden, es ist nicht Bestandteil von PostScript. 
Im <b>Einstellungen</b>-Dialog kann man angeben, ob Ctrl+D vor und/oder nach der 
Postscriptdatei gesendet werden soll. 
<p>Einige PostScript-Drucker verstehen mehrere Druckersprachen und erfordern einen 
Vorspann um den PostScript-Modus einzuschalten. 
Z.B. erfordern HP LaserJet-Drucker (mit PostScript-Option) den folgenden 
Vorspann 
<pre>
 ^[%-12345X@PJL JOB
 @PJL ENTER LANGUAGE = POSTSCRIPT
</pre>
<p>and the following epilog 
<pre>
 ^[%-12345X@PJL EOJ
 ^[%12345X
</pre>
<p>Die Vorspann- und Nachspanndateien erlauben eine Datei vor und nach der 
Postscriptdatei an den Drucker zu senden. 
<p>Eine weitere Anwendung eines Vorspanns kann die Einschaltung von Duplex- 
Druck sein: 
<pre>
 &lt;&lt; /Duplex true /Tumble false &gt;&gt; setpagedevice
</pre>
<p>Wenn das Dokument <a href="#PDF-Format_(Portable_Document_Format)">PDF</a> ist, wird Ghostscript zur Konvertierung in 
Postscript verwendet, welches dann zum Drucker geschickt wird. 
<p>
<p>
<hr>
<h2><a name="Drucke_Datei">Drucke Datei</a></h2>
<b>Datei | Drucke Datei</b> schickt eine Datei an eine lokale Schnittstelle unter 
Umgehung des Windowsdruckertreibers. 
Das ist n&#252;tzlich um ein Dokument an einen PostScript-Drucker zu schicken oder 
um eine von Ghostscript erzeugte Ausgabedatei an einen Drucker zu schicken. 
ausw&#228;hlen. 
<p>Es k&#246;nnen alle Seiten, einzelne Seiten oder beliebige Kombinationen 
ausgedruckt werden. 
Mit Hilfe der Schaltfl&#228;chen <b>Alle</b>, <b>Ungerade</b> und <b>Gerade</b> ist eine 
schnellere Auswahl m&#246;glich. 
Wenn ein fortlaufender Bereich von Seiten markiert wurde, so bezieht sich 
<b>Gerade</b> und <b>Ungerade</b> auf diesen Bereich. 
Markieren sie <b>Umgekehrt</b>, so werden die Seiten in umgekehrter Reihenfolge 
gedruckt. 
<p><p>
<p>
<hr>
<h2><a name="Einstellung">Einstellung</a></h2>
Im Dialogfeld <b>Druckereinstellung</b> befindet sich die Schaltfl&#228;che 
<b>Einstellung</b>, mit der Sie f&#252;r einige Ger&#228;tetreiber spezielle 
Einstellungen vornehmen und einen Seitenversatz bestimmen k&#246;nnen. 
<p>F&#252;r jeden Ger&#228;tetyp kann ein Seitenversatz definiert werden. 
Dieser dient dazu, Abweichungen zwischen dem Original eines 
Ghostscript-Drucker und einem anderen Drucker zu korrigieren. 
Durch Erh&#246;hen des X-Wertes wird ein Bild nach rechts 
verschoben. Durch Erh&#246;hen des Y-Wertes wird ein Bild 
nach unten verschoben. 
<p>Die Schaltfl&#228;che <b>Einstellung</b> wird im allgemeinen daf&#252;r verwendet, 
BitsperPixel f&#252;r einen Farbdrucker festzulegen oder andere Farb- oder 
Dichtekorrekturen vorzunehmen. 
<p>Die Einstellungen m&#252;ssen f&#252;r jedes Ger&#228;t gesondert vorgenommen werden.  
Wenn Sie den Wert der <b>BitsPerPixel</b> f&#252;r ein Ger&#228;t &#228;ndern, bleiben die 
Einstellungen f&#252;r andere Ger&#228;te von dieser &#196;nderung unber&#252;hrt. 
<p>Wenn Sie im Dialogfeld <b>Einstellung</b> die Schaltfl&#228;che <b>OK</b> anklicken, 
werden die Einstellungen in die Datei 
gsview32.ini 
geschrieben. 
<p>In GSview finden Sie einige vordefinierte Einstellungen, die allerdings 
nicht immer mit den Einstellungen in Ghostscript &#252;bereinstimmen. 
&#220;ber die Schaltfl&#228;chen <b>Bearbeiten </b>und <b>Neu</b> k&#246;nnen Sie die Einstellungen 
f&#252;r das jeweilige Ger&#228;t neu definieren bzw. ver&#228;ndern. 
Siehe hierzu auch das Hilfethema <a href="#Einstellung_bearbeiten">Einstellung bearbeiten</a>. 
<p>
<a href="#Einstellung_bearbeiten">Einstellung bearbeiten</a><br>
<p>
<hr>
<h3><a name="Einstellung_bearbeiten">Einstellung bearbeiten</a></h3>
Nicht jedes Ger&#228;t unterst&#252;tzt die Verwendung dieser optionalen 
<a href="#Einstellung">Einstellung</a>. Um herauszufinden, welches Ger&#228;t die Funktion 
<a href="#Einstellung">Einstellung</a> unterst&#252;tzt und welche <a href="#Einstellung">Einstellung</a> von welchem Ger&#228;t 
erkannt wird, lesen Sie die Ghostscript-Datei "devices.txt" oder schauen 
Sie im Ghostscript Source Code nach. 
<p>Es gibt zwei M&#246;glichkeiten, neue Einstellungen zu definieren oder die 
Einstellungen zu bearbeiten. 
<p>1. M&#246;glichkeit: 
Klicken Sie auf die Schaltfl&#228;che <a href="#Zwischenablage">Bearbeiten</a> oder <b>Neu</b> im Dialogfeld 
<a href="#Einstellung">Einstellung</a>. 
<p>Beim Einstellungstyp mu&#223; zwischen Nummer und Text unterschieden werden. 
Nummern-Einstellungen entsprechen der Option <b>-d</b> in der 
Ghostscript-Kommentarzeile. Text-Einstellungen entsprechen der Option 
<b>-s</b> in der Ghostscript Kommentarzeile. Jede Einstellung besteht aus 
einem <b>Namen</b> und einem <b>Wert</b>: 
<b>-dNAME=VALUE</b> oder <b>-sNAME=VALUE</b>. 
Der hier eingetragene <b>VALUE</b> stammt aus der Liste von <b>Werten</b>, die im 
Dialogfeld <b>Bearbeiten Eigenschaften</b> eingegeben wurde. 
In den Zeilen <b>Name</b> und <b>Wert</b> d&#252;rfen keine Leerzeichen eingegeben 
werden. Geben Sie die <b>Werte</b> durch Kommata getrennt ein. 
<p>Um eine Einstellung zu l&#246;schen, w&#228;hlen Sie diese Einstellung im Dialogfeld 
aus, klicken auf die Schaltfl&#228;che <a href="#Zwischenablage">Bearbeiten</a> und anschlie&#223;end auf die 
Schaltfl&#228;che <b>L&#246;schen</b>. 
<p>2. M&#246;glichkeit: 
Editieren Sie die GSview INI-Datei. 
<p>F&#252;r jedes Ger&#228;t mu&#223; die Datei 
gsview32.ini 
in diesem Fall um zwei Sektionen erg&#228;nzt werden. 
Das folgende Beispiel verdeutlicht, wie die Datei f&#252;r den cdjcolor-Treiber 
editiert werden mu&#223;. 
F&#252;gen Sie zun&#228;chst eine Sektion mit den aktuellen Werten ein. 
Diese Sektion enth&#228;lt die Optionen, die in unter GSview im Feld 
<a href="#Einstellung">Einstellung</a> erscheinen. 
Das erste Zeichen ist ein <b>s</b> (f&#252;r Text) oder ein <b>d</b> (f&#252;r Nummer). 
<pre>
 [cdjcolor]
 dBitsPerPixel=24
 dDepletion=1
 dShingling=2
 dBlackCorrect=4
</pre>
<p>Als n&#228;chstes f&#252;gen Sie eine Sektion mit den Werten ein, die im Feld 
<b>Wert</b> erscheinen sollen. 
<pre>
 [cdjcolor values]
 dBitsPerPixel=1,3,8,16,24
 dDepletion=1,2,3
 dShingling=0,1,2
 dBlackCorrect=0,1,2,3,4,5,6,7,8,9
</pre>
<p>GSview f&#252;gt der Liste automatisch den Wert <b>[Undefiniert]</b> hinzu. 
<p>Sobald eine Datei gedruckt wird, wird der Inhalt der Sektion [cdjcolor] 
der Datei 
gsview32.ini 
wie folgt an Ghostscript weitergeleitet: 
<pre>
 -dBitsPerPixel=24 -dDepletion=1 -dShingling=2 -dBlackCorrect=4
</pre>
<p>Handelt es sich um einen <b>[Undefiniert]</b>-Wert, wird die Einstellung nicht 
an Ghostscript weitergeleitet. 
<p>
<p>
<hr>
<h2><a name="Seitengr&#246;&#223;enanpassung">Seitengr&#246;&#223;enanpassung</a></h2>
Wenn <b>Feste Seitengr&#246;&#223;e</b> markiert ist (Standard), wird GSview die 
Seitengr&#246;sse aus dem Formatmen&#252; verwenden und Versuche des PostScript- 
oder PDF-Dokumentes, die Seitengr&#246;sse zu &#228;ndern ignorieren. 
Das ist n&#252;tzlich f&#252;r PDF-Dateien die sowohl Hoch- als auch Querformatseiten 
enthalten. 
<p>Wurde <b>Anpassung an Seitengr&#246;&#223;e</b> markiert, wird jede vom Dokument gew&#228;hlte 
Seitengr&#246;&#223;e skaliert, so dass sie zur Seitengr&#246;&#223;e aus dem Formatmen&#252; passt. 
Das ist n&#252;tzlich wenn man eine A4-Seite auf Letterpapier drucken will 
(obwohl es besser ist, A4-Papier zu kaufen). 
Das funktioniert nicht mit Ghostscript 6.30 or &#228;lter. 
<p>Wenn <b>Variable Seitengr&#246;&#223;e</b> markiert ist, verwendet  GSview die Standardgr&#246;sse 
aus dem Formatmen&#252;, aber erlaubt den Dokumenten, diese zu &#228;ndern. 
<p><p>
<p>
<hr>
<h1><a name="Konvertierungen">Konvertierungen</a></h1>
Es gibt verschiedene M&#246;glichkeiten, PostScript- und PDF-Dateien zu 
konvertieren. 
<p><a href="#Datei_öffnen">Datei</a> | <a href="#Konvertierung">Konvertierung</a> nutzt Ghostscript um PostScript oder PDF 
in Bitmaps, PostScript oder PDF umzuwandeln. 
<p><a href="#Datei_öffnen">Datei</a> | <a href="#Extrahiere">Extrahiere</a> erlaubt eine Seitenfolge aus einem PostScript- 
Dokument zu kopieren. 
<p><a href="#Datei_öffnen">Datei</a> | <a href="#PS_zu_EPS">PS zu EPS</a> erlaubt die Aktualisierung der bounding box und eine 
&#196;nderung des Headers von PS zu EPS. 
Vor Verwendung dieser Option sollte man die Dokumentation genau lesen. 
<p><a href="#Zwischenablage">Bearbeiten</a> | <a href="#EPS_Vorschau_(Preview)">EPS Vorschau einf&#252;gen</a> f&#252;gt ein Vorschaubitmap in eine EPS- 
Datei ein. 
<p><a href="#Zwischenablage">Bearbeiten</a> | <a href="#EPS_Vorschau_(Preview)">Extrahiere EPS</a> extrahiert PostScript oder das Vorschaubitmap 
aus einer DOS-EPS-Datei. 
<p><a href="#Zwischenablage">Bearbeiten</a> | <a href="#Konvertierung_in_Vektor_Format">Konvertierung in Vektor Format</a> verwendet pstoedit um 
PostScript oder PDF in ein editierbares Vektorformat umzuwandeln. 
<p><a href="#Zwischenablage">Bearbeiten</a> | <a href="#Text_extrahieren_und_Suche">Text extrahieren</a> verwendet pstotext um Text aus einem 
PostScript- oder PDF-Dokument zu extrahieren. 
<p><a href="#Zwischenablage">Bearbeiten</a> | <a href="#Zwischenablage">Kopieren</a> kopiert das Anzeigebitmap in die Zwischenablage. 
<a href="#Zwischenablage">Bearbeiten</a> | <a href="#Zwischenablage">Einf&#252;gen</a> kopiert ein DIB-Bitmap aus der Zwischenablage in 
eine Datei. 
<a href="#Zwischenablage">Bearbeiten</a> | <a href="#Zwischenablage">Konvertiere Bitmap</a> wandelt ein DIB-Bitmap aus der 
Zwischenablage in ein ger&#228;teabh&#228;ngiges Zwischenablage-Bitmap um. 
<p>
<p>
<hr>
<h1><a name="Dateikonvertierungen_und_Tricks">Dateikonvertierungen und Tricks</a></h1>
Einige g&#228;ngige Dateikonvertierungen unter Mithilfe von GSview und 
Ghostscript sind: 
<p>Konvertierung von PostScript zu PDF. 
Datei | <a href="#Konvertierung">Konvertierung</a>, w&#228;hlen Sie pdfwrite, 300dpi. 
Mit Ghostscript 5.50 werden Zeichens&#228;tze mit Nichtstandard-Encodings 
als Bitmaps importiert.  Wenn Sie 72dpi w&#228;hlen sehen die Zeichen sehr 
rau aus. Ghostscript 6.0 bettet Fonts ein. 
<p>Konvertierung von PDF zu PostScript. 
Datei | <a href="#Konvertierung">Konvertierung</a>, w&#228;hlen Sie pswrite, 300dpi. 
<p>Konvertierung von Level 2 PostScript in Level 1 PostScript. 
Datei | <a href="#Konvertierung">Konvertierung</a>, w&#228;hlen Sie psmono, 300dpi. 
Anstelle von 300dpi sollten Sie die Aufl&#246;sung ihres Druckers w&#228;hlen. 
<p>Konvertierung in ein Bitmap. 
Datei | <a href="#Konvertierung">Konvertierung</a>, w&#228;hlen Sie bmp16m, 72dpi. 
<p>Konvertierung in ein editierbares Vektor Format (pstoedit). 
Bearbeiten | <a href="#Konvertierung_in_Vektor_Format">Konvertierung in Vektor Format</a> ODER Konvertierung in PDF 
wie oben beschrieben. 
<p>Extrahiere Text (pstotext). 
Bearbeiten | <b>Extrahiere Text</b> 
<p>Vorschau in eine EPS Datei einf&#252;gen. 
Bearbeiten | <a href="#EPS_Vorschau_(Preview)">EPS Vorschau einf&#252;gen</a>. Siehe <b>EPS Vorschau hinzuf&#252;gen</b>. 
<p>EPS Vorschau l&#246;schen. 
Bearbeiten | <a href="#EPS_Vorschau_(Preview)">Extrahiere EPS</a> | PostScript 
<p>Anzeige mit abgerundeten Ecken. 
Formate | <a href="#Anzeige_Einstellungen">Anzeige Einstellungen</a>.  Setzen Sie <b>Text Alpha</b> und 
<b>Graphik Alpha</b> auf 4.  Sie m&#252;ssen die Anzeige auf mindestens 
8 Bit pro Pixel einstellen. 
<p>Speichern der dargestellten Bitmap. 
Bearbeiten | <a href="#Zwischenablage">Kopieren</a> zum Kopieren in die Zwischenablage. 
Um eine BMP Datei abzuspeichern benutzen Sie Bearbeiten | <a href="#Zwischenablage">Kopieren</a> 
und dann <a href="#Zwischenablage">Einf&#252;gen</a>... 
<p>Erzeugen einer Bitmap mit abgerundeten Ecken (Anti-Aliasing). 
1. Anzeigen mit abgerundeten Ecken und dann speichern der Bitmap. 
ODER 
2. 
Konvertierung unter Verwendung eines Bitmapger&#228;tes und setzen der Eigenschaften 
<pre>
   -dTextAlphaBits=4 -dGraphicsAlphaBits=4
</pre>
<p>
<a href="#Konvertierung">Konvertierung</a><br>
<a href="#Extrahiere">Extrahiere</a><br>
<a href="#PS_zu_EPS">PS zu EPS</a><br>
<a href="#EPS_Vorschau_(Preview)">EPS Vorschau (Preview)</a><br>
<a href="#Benutzerdefinierte_Vorschau">Benutzerdefinierte Vorschau</a><br>
<a href="#Konvertierung_in_Vektor_Format">Konvertierung in Vektor Format</a><br>
<a href="#Text_extrahieren_und_Suche">Text extrahieren und Suche</a><br>
<a href="#Zwischenablage">Zwischenablage</a><br>
<p>
<hr>
<h2><a name="Konvertierung">Konvertierung</a></h2>
<b>Datei </b>| <b>Konvertierung</b> nutzt Ghostscript um PostScript oder PDF 
in Bitmaps, PostScript or PDF umzuwandeln. 
<p>Sie m&#252;ssen ein Ghostscript-Ausgabeger&#228;t und eine Aufl&#246;sung w&#228;hlen. 
Die Standardliste der verf&#252;gbaren Ger&#228;te und Aufl&#246;sungen wird im 
Abschnitt [Convert] der Datei 
gsview32.ini 
gespeichert und entstammt der Standarddistribution von Ghostscript 6.01. 
Sie k&#246;nnen andere Ger&#228;te oder Aufl&#246;sungen verwenden. 
<p>Einige Ghostscript-Optionen k&#246;nnen entweder im Feld <a href="#Optionen">Optionen</a> oder 
mit dem <b>Einstellungen</b>-Button eingegeben werden. 
<p>Es k&#246;nnen alle Seiten, einzelne Seiten oder beliebige Kombinationen 
umgewandelt werden. 
Die Buttons <b>Alle</b>, <b>Ungerade</b> und <b>Gerade</b> erm&#246;glichen eine schnelle 
Seitenauswahl. 
Wenn ein einzelner zusammenh&#228;ngender Seitenblock markiert ist, w&#228;hlen 
die Buttons <b>Ungerade</b> und <b>Gerade</b> aus diesem Bereich aus. 
Die Checkbox <b>Absteigend</b> veranlasst die Umwandlung mit der letzten 
Seite zu beginnen. 
<p>Zur Verarbeitung von Anforderungen der PostScript- oder PDF-Dokumente 
nach Seitengr&#246;&#223;en&#228;nderungen durch GSview, siehe Abschnitt 
<a href="#Seitengrößenanpassung">Seitengr&#246;&#223;enanpassung</a>. 
<p>Siehe auch <a href="#Konvertierungen">Konvertierungen</a>. 
<p>
<p>
<hr>
<h2><a name="Extrahiere">Extrahiere</a></h2>
<b>Extrahiere</b> erlaubt eine Seitenfolge aus dem aktuellen Dokument in ein 
neues Dokument zu kopieren. Es k&#246;nnen zum Beispiel zehn Seiten aus der 
Mitte des aktuellen Dokumentes in eine andere Datei geschrieben werden, 
die sp&#228;ter gedruckt wird. 
Das Markierungsk&#228;stchen <b>Absteigend</b> veranlasst die Abspeicherung der 
extrahierten Seiten der letzten Seite zu beginnen. 
<p>Siehe auch <a href="#Konvertierungen">Konvertierungen</a>. 
<p>
<p>
<hr>
<h2><a name="PS_zu_EPS">PS zu EPS</a></h2>
Normalerweise ist es nicht m&#246;glich, eine PostScript-Datei in eine 
<b>EPS-Datei</b> umzuwandeln. Viele PostScript-Dateien, die eine Seite 
beschreiben, k&#246;nnen dennoch umgewandelt werden. Voraussetzung ist, 
da&#223; die erste Zeile folgenderma&#223;en aussieht: 
<pre>
 %!PS-Adobe-3.0 EPSF-3.0
</pre>
<p>Anschlie&#223;end mu&#223; der <b>%%Bounding Box</b>-Kommentar hinzugef&#252;gt werden. 
<p>EPS-Dateien dienen dazu, Grafiken in andere Dokumente einzubetten, und 
ben&#246;tigen daher einen Bounding Box-Kommentar f&#252;r die Gr&#246;&#223;enberechnung 
dieser Graphiken: 
<pre>
 %%BoundingBox: llx lly urx ury
</pre>
<p>Dabei geben die Werte llx, lly, urx und ury die x- und y-Koordinaten der 
linken unteren (lower left) und der rechten oberen (upper right) Ecken 
einer Bounding Box an (die Bounding Box ist das kleinste kantenparallele 
Rechteck, das die Zeichnung voll umschlie&#223;t). 
<p><b>Wird der Befehl PS zu EPS nicht richtig angewendet, kann es sein, da&#223; 
PostScript-Dateien mit falschen DSC-Kommentaren erzeugt werden und da&#223; 
Probleme beim Einbetten in ein anderes Dokument auftreten.</b> 
<p>Soll eine PostScript-Datei in eine <b>EPS-Datei</b> umgewandelt werden, 
darf die Datei nur eine Seite enthalten. 
Enth&#228;lt die Datei <b>DSC-Kommentare</b> und besteht aus mehreren Seiten, 
extrahieren Sie vorher mit dem Befehl <a href="#Datei_öffnen">Datei</a> | <a href="#Extrahiere">Extrahiere</a> die 
gew&#252;nschte Seite. Enth&#228;lt die Datei keine <b>DSC-Kommentare</b>, 
mu&#223; die Datei per Hand editiert werden, damit die gew&#252;nschte Seite 
extrahiert werden kann. 
<p>Folgende Operatoren d&#252;rfen auf keinen Fall in <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">EPS</a>-Dateien 
enthalten sein: 
<pre>
 banddevice   clear         cleardictstack  copypage
 erasepage    exitserver    framedevice     grestoreall
 initclip     initgraphics  initmatrix      quit
 renderbands  setglobal     setpagedevice   setpageparams
 setshared    startjob      letter          note
 legal        a3            a4              a5
</pre>
<p>Die nachfolgend genannten Operatoren sollten nur in 
Ausnahmef&#228;llen verwendet werden: 
<pre>
 nulldevice   setgstate     sethalftone    setmatrix
 setscreen    settransfer   setcolortransfer
</pre>
<p>Sorgen Sie daf&#252;r, da&#223; die beschriebenen Einschr&#228;nkungen und 
Voraussetzungen beachtet werden. 
<p>Um zu &#252;berpr&#252;fen, ob eine Datei einen der aufgelisteten Operatoren 
enth&#228;lt, aktivieren Sie den Men&#252;punkt <a href="#Optionen">Optionen</a> | <a href="#EPS_Warnung">EPS Warnung</a> und 
<a href="#Datei_öffnen">&#214;ffnen</a> anschlie&#223;end die Datei. Nachdem die Seite auf dem Bildschirm 
angezeigt wurde, <a href="#Datei_öffnen">Schlie&#223;en</a> Sie die Datei und lassen sich mit der 
<a href="#Datei_öffnen">Datei</a> | <a href="#Meldungen_anzeigen">Meldungen anzeigen</a> die entsprechenden Meldungen anzeigen. 
Falls einer dieser Operatoren verwendet wurde, erhalten Sie die 
folgenden Meldungen: 
<pre>
 Warning: EPS files must not use ...
</pre>
<p>W&#228;hlen Sie in diesem Fall nicht die Funktion <b>PS zu EPS</b> und deaktivieren 
Sie die Option <a href="#EPS_Warnung">EPS Warnung</a>. 
<p>Bevor die Funktion <b>PS zu EPS</b> verwendet werden kann, mu&#223; die Datei auf 
dem Bildschirm angezeigt werden. 
<p>Bei Dateien, die keine <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-Kommentare enthalten, kann &#252;ber die Funktion 
<b>PS zu EPS</b> eine Bounding Box bestimmt werden. Daraufhin entstehen 
<a href="#Document_Structuring_Conventions_(DSC-Kommentare)">EPS</a>-Dateien, bei denen das urspr&#252;ngliche Dokument 
"von <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">EPS</a> umh&#252;llt" wird. 
<p>Bei Dateien, die <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-Kommentare enthalten, ver&#228;ndert die Funktion 
<b>PS zu EPS</b> die erste Zeile folgenderma&#223;en 
<pre>
 %!PS-Adobe-3.0 EPSF-3.0
</pre>
<p>Anschlie&#223;end kann der <b>%%BoundingBox</b>-Kommentar ge&#228;ndert oder erg&#228;nzt 
werden. 
<p>Bei <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">EPS</a>-Dateien wird der <b>%%BoundingBox</b>-Kommentar durch die Funktion 
<b>PS zu EPS</b> ge&#228;ndert. 
<p>Mit der Funktion <b>PS zu EPS</b> wird die Datei nicht auf die <b>%%BoundingBox</b> 
zugeschnitten. Dazu m&#252;&#223;te der eigentliche PostScript-Code ge&#228;ndert werden. 
<b>PS zu EPS</b> ver&#228;ndert lediglich die 'DSC'-Kommentare. 
<p>Wenn <b>Berechne automatisch die Bounding Box</b> aktiviert ist, berechnet GSview 
die bounding box der nichtwei&#223;en Pixel. 
Ist die Option nicht aktiviert, muss die bounding box durch Anklicken am 
linken, unteren, rechten und oberen Rand bestimmt werden. 
<p>Mit der Funktion <b>PS zu EPS</b> wird kein Preview-Bild in ein Dokument eingef&#252;gt. 
Erzeugen Sie dazu eine <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">EPS</a>-Datei mit einer korrekten 
<b>%%BoundingBox</b>-Kommentar und w&#228;hlen anschlie&#223;end den Men&#252;punkt 
<b>Bearbeiten </b>| <b>F&#252;ge EPS Vorschau ein</b> an. 
<p>Siehe hierzu auch die Hilfethemen <b>F&#252;ge EPS Vorschau ein</b>, <a href="#Extrahiere">Extrahiere</a>, 
und <a href="#EPS_Warnung">EPS Warnung</a>. 
<p>
<p>
<hr>
<h2><a name="EPS_Vorschau_(Preview)">EPS Vorschau (Preview)</a></h2>
Mit dem Befehl <b>EPS Vorschau einf&#252;gen</b> wird das Anzeigebitmap zur Hinzuf&#252;gung 
einer Vorschau zur EPS-Datei verwendet. Auf diese Art kann eine DOS-EPS-Datei 
mit einer Windows Metafile (WMF)- oder TIFF-Vorschau oder eine EPSI-Datei mit 
einer Interchange-Vorschau erzeugt werden. 
Um ein Preview-Bild einzuf&#252;gen, gehen Sie folgenderma&#223;en vor: 
<p>1. Deaktivieren Sie <b>Optionen | Ignoriere DSC</b>. 
<p>2. Stellen Sie mit <a href="#Optionen">Optionen</a> | <a href="#Zeige_Bounding_Box">Zeige Bounding Box</a> sicher, da&#223; das 
Dokument einen korrekten Bounding Box-Kommentar enth&#228;lt. Eine Bounding Box 
kann &#252;ber den Befehl <a href="#Datei_öffnen">Datei</a> | <a href="#PS_zu_EPS">PS zu EPS</a> erzeugt bzw. ver&#228;ndert werden. 
<p>3. W&#228;hlen Sie <a href="#Seitenausrichtung">Ausrichtung</a> | <a href="#Seitenausrichtung">Hochformat</a> aus. 
<p>4.  W&#228;hlen Sie <b>Formate </b>| <a href="#Anzeige_Einstellungen">Anzeige Einstellungen</a> und w&#228;hlen Sie die 
entsprechende Aufl&#246;sung f&#252;r die Vorschau. 
Bei einer hohen Aufl&#246;sung wird die EPS-Datei allerdings sehr gro&#223;. 
<p>5. <a href="#Datei_öffnen">&#214;ffnen</a> Sie eine EPS-Datei, die noch keinen Preview-Teil enth&#228;lt. 
<p>6.  W&#228;hlen Sie den Befehl <b>Bearbeiten </b>| <b>EPS Vorschau einf&#252;gen</b>. Geben Sie 
anschlie&#223;end den Preview-Typ sowie den neuen Namen der EPS-Datei an. 
GSview erzeugt dann eine neue Datei, die die PostScript-EPS-Datei 
und die aus dem Anzeigebitmap erzeugte Vorschau enth&#228;lt. 
M&#246;gliche Preview-Typen sind <b>Interchange</b>, 
<b>TIFF 4</b>, <b>TIFF 6 unkomprimiert</b>, <b>TIFF 6 komprimiert</b> und 
<b>Windows Metafile (WMF)</b>. 
Wird eine Interchange-Vorschau eingef&#252;gt, mu&#223; das Dokument die 
Kommentar-Zeile <b>%%EndComments</b> enthalten, 
damit GSview die Vorschau an die richtige Stelle setzt. 
Eine Interchange-Vorschau wird immer monochrom dargestellt. 
Beim Format TIFF 4 handelt es sich um ein unkomprimiertes Baseline Bilevel 
Image (1 bit/pixel) wie im TIFF 6.0-Memorandum beschrieben, jedoch ohne 
Tags, die nicht in der TIFF 4-Spezifikation beschrieben sind.. 
Das Programm WordPerfect 5.1 ben&#246;tigt z.B. den Preview-Typ TIFF 4. 
Das Format TIFF 6 kann ein Baseline Bilevel Image, ein Baseline 
Palette-colour Image (4 or 8 bits/pixel)  oder ein Baseline RGB Full 
Colour Image (24 bits/pixel) nach TIFF 6.0-Spezifikation sein. 
Eine TIFF 6-Vorschau ist entweder unkomprimiert oder komprimiert mit 
packbits. 
Eine WMF-Vorschau enth&#228;lt ein unkomprimiertes Bitmap. 
<p>7. Nach dem Einf&#252;gen w&#228;hlen Sie wieder die urspr&#252;ngliche Seitenausrichtung 
und setzen die Werte in <b>Formate </b>| <a href="#Anzeige_Einstellungen">Anzeige Einstellungen</a> wieder zur&#252;ck. 
<p>Zum Entfernen/Extrahieren des PostScript- bzw. Preview-Teils einer DOS 
EPS-Datei w&#228;hlen Sie nacheinander die Befehle <a href="#Datei_öffnen">Datei</a> | <a href="#Datei_öffnen">Auswahl Datei</a>, 
<b>Bearbeiten </b>| <b>Extrahiere EPS</b> und anschlie&#223;end die 
Funktion <b>PostScript</b> oder <b>Preview</b>. 
<p>Siehe auch <a href="#PS_zu_EPS">PS zu EPS</a>. 
<p>
<p>
<hr>
<h2><a name="Benutzerdefinierte_Vorschau">Benutzerdefinierte Vorschau</a></h2>
Mit dem Befehl <b>Bearbeiten </b>| <a href="#EPS_Vorschau_(Preview)">EPS Vorschau einf&#252;gen</a> | <b>Benutzer 
definiert</b> k&#246;nnen bereits vorhandene TIFF- oder WMF-Dateien in eine 
EPS-Datei eingef&#252;gt werden, um eine DOS-EPS-Datei zu erzeugen. 
Dies bietet sich an, wenn eine Anwendung in eine EPS- oder eine WMF-Datei 
exportieren kann, jedoch keine DOS-EPS-Datei mit einer WMF-Vorschau 
erzeugen kann. Die EPS-Datei <b>mu&#223;</b> einen Bounding Box-Kommentar 
enthalten, der mit der TIFF- oder WMF-Vorschaudatei &#252;bereinstimmt. 
Die EPS-Datei mu&#223; nicht zwingend auf dem Bildschirm angezeigt werden. 
Die Funktion <b>Benutzer definiert</b> kann auch verwendet werden, 
nachdem die Datei &#252;ber den Men&#252;punkt <a href="#Datei_öffnen">Auswahl Datei</a> ge&#246;ffnet wurde. 
<p>Sie k&#246;nnen auch eine Preview einf&#252;gen, die keine &#196;hnlichkeit mit 
PostScript hat. Dies ist allerdings nicht w&#252;nschenswert. 
<p>
<p>
<hr>
<h2><a name="Konvertierung_in_Vektor_Format">Konvertierung in Vektor Format</a></h2>
Sie k&#246;nnen eine Postscript oder PDF Datei in ein editierbares 
Vektorformat konvertieren, indem Sie das Programm <b>pstoedit</b> 
von Wolfgang Glunz benutzen. 
<b>pstoedit</b> unterliegt der GNU Public Licence und ist nicht in GSview 
enthalten.  Es muss gesondert von der pstoedit-Homepage 
<pre>
 http://www.pstoedit.net/pstoedit 
</pre>
<p>oder von 
<pre>
 http://www.cs.wisc.edu/~ghost/gsview/pstoedit.htm
</pre>
<p>geladen werden. 
<p>Um <b>pstoedit</b> innerhalb von GSview zu benutzen, verwenden Sie 
<b>Bearbeiten | Konvertierung in Vektor Format</b>. 
Es werden 3 Dialogboxen angezeigt. 
<p>Der erste Dialog ist f&#252;r die pstoedit Einstellungen. 
<p>W&#228;hlen Sie ein Ausgabe-<b>Format</b> aus. 
<p><b>Zeichne Text als Polygone</b> sollte ausgew&#228;hlt werden, wenn die Postscriptdatei 
Text enth&#228;lt und das Ausgabeformat dies nicht unterst&#252;tzt (z.B. gnuplot). 
Dies kann eine sehr gro&#223;e Ausgabedatei bewirken. 
<p>Wenn <b>Konvertiere in ISO-Latin1</b> ausgew&#228;hlt ist, konvertiert pstoedit alle 
Zeichen in die Kodierung, die ISO-Latin1 entspricht, dies ist HTML und 
MS-Windows. Dies ist die Standardeinstellung. 
Wenn Sie dies abstellen, wird die Kodierung der Postscriptdatei unver&#228;ndert 
in die Ausgabe &#252;bernommen. 
<p>Wenn das Ausgabeformat Kurven nicht wie in Postscript unterst&#252;tzt, 
dann werden alle Kurven durch Linien approximiert. Die Option 
<b>Flachheit</b> wird benutzt, um diese N&#228;herung zu kontrollieren. 
Dieser Parameter wird direkt an das Postscriptkommando setflat 
&#252;bergeben. Kleine Werte erzeugen eine glattere Kurve aber mehr 
Liniensegmente. 
<p>Manchmal haben Zeichens&#228;tze, die innerhalb von Postscriptprogrammen 
verwendet werden, keinen Namen. 
Z.B. kommt dies in Postscriptdateien vor, die von dvips erzeugt 
wurden. In diesem Fall verwendet pstoedit einen Ersatzzeichensatz. 
Der Default daf&#252;r ist Courier. Ein anderer Zeichensatz kann durch 
die Option <b>Standard-Zeichensatz</b> angegeben werden. Hier kann au&#223;er 
Courier noch Helvetica und Times-Roman angegeben werden. 
<p>Einige der Ausgabeformate bieten extra Optionen. Bitte lesen Sie 
das pstoedit-Handbuch f&#252;r weitere Informationen. So bietet z.B. 
das Java-Ausgabeformat <b>Treiberoptionen</b> um den Namen der Java-Klasse 
anzugeben. 
<p>Der zweite Dialog (er wird nicht angezeigt, wenn Seitennummerierung 
nicht verf&#252;gbar ist) spezifiziert die Seite, die konvertiert werden 
soll oder, sofern vom Ausgabeformat unterst&#252;tzt, den Bereich 
der zu konvertierenden Seiten. 
<p>Im dritten Dialog kann der Name der Ausgabedatei angegeben werden. 
<p>Nicht alle <b>pstoedit</b> Formate unterst&#252;tzen Bitmap-Grafiken. 
Wenn Sie Bitmap-Ausgaben ben&#246;tigen, lesen Sie bitte den Abschnitt 
<a href="#Dateikonvertierungen_und_Tricks">Dateikonvertierungen und Tricks</a>. 
<p>F&#252;r weitere Details lesen Sie bitte das pstoedit-Handbuch. 
<p>Siehe auch <a href="#Konvertierungen">Konvertierungen</a>. 
<p>
<p>
<hr>
<h2><a name="Text_extrahieren_und_Suche">Text extrahieren und Suche</a></h2>
Bei dem Versuch, den Text eines PostScript-Dokumentes zu 
extrahieren, k&#246;nnen Probleme auftreten, da einzelne W&#246;rter "abgehackt 
werden k&#246;nnen", der Text kodiert sein kann, Ligaturen 
(=spezielle Zeichen f&#252;r die Kombination zweier oder mehrerer Buchstaben, 
z.B. die Zeichen f und i) vorhanden sein k&#246;nnen oder evtl. kein 
Zusammenhang zwischen der Position eines Wortes in 
der PostScript-Datei und seiner Position auf der Seite besteht. 
Die Qualit&#228;t eines extrahierten Textes h&#228;ngt also in erste Linie von der 
Beschaffenheit des Textes ab. 
<p>Im Programm GSview gibt es zwei M&#246;glichkeiten, den Text einer 
PostScript-Datei zu extrahieren. 
<p>Mit der schnellen Methode wird der komplette Text extrahiert. 
<p>Die zweite Methode, die pstotext und Ghostscript verwendet, 
ist zwar langsamer, extrahiert den Text daf&#252;r aber wesentlich genauer. 
<p>Um die Methoden auszuw&#228;hlen, aktivieren bzw. deaktivieren Sie die 
Funktion <a href="#Optionen">Optionen</a> | <a href="#PSzuText">PSzuText</a>. 
Siehe dazu auch die folgenden Hilfethemen: 
<p>Siehe auch <a href="#Konvertierungen">Konvertierungen</a>. 
<p>
<a href="#Schnelles_extrahieren_und_Suchen">Schnelles extrahieren und Suchen</a><br>
<a href="#PSzuText_Text_extrahieren_und_Suchen">PSzuText Text extrahieren und Suchen</a><br>
<p>
<hr>
<h3><a name="Schnelles_extrahieren_und_Suchen">Schnelles extrahieren und Suchen</a></h3>
In PostScript-Dateien ist der Text normalerweise genauso angeordnet wie er 
auf der Seite erscheint, wobei die PostScript Strings (Textanweisungen) in 
Klammern angegeben sind. Es k&#246;nnen ganze Textzeilen im St&#252;ck oder Zeichen 
f&#252;r Zeichen ausgegeben werden. Bei diesen PostScript-Dokumenten lassen 
sich mit dem Extrahieren von Text relativ gute Ergebnisse erzielen. 
<p>Mit dem Befehl <a href="#Zwischenablage">Bearbeiten</a> | <a href="#Text_extrahieren_und_Suche">Text extrahieren</a> wird ein aus mehreren Strings 
bestehender Text auf einer bestimmten Seite extrahiert und in eine 
Textdatei ausgegeben. Zeilenumbr&#252;che in der Textdatei entsprechen 
den Zeilen der PostScript-Datei. Trennstellen bleiben einschlie&#223;lich 
des Trennstriches erhalten. 
Mit dem Programm ps2ascii.ps aus dem Ghostscript-Paket wurde eine 
wesentlich effektivere Methode geschaffen, mit der Textbestandteile 
einer PostScript-Datei extrahiert werden k&#246;nnen. Alternativ dazu kann 
auch das Programm <b>pstotext</b> verwendet werden, das auf der Ghostscript 
<a href="#World_Wide_Web">WWW</a>-Seite aufgef&#252;hrt ist. 
<b>pstotext</b> kann in GSview ausgef&#252;hrt werden, wenn die Option 
<a href="#Optionen">Optionen</a> | <a href="#PSzuText">PSzuText</a> aktiviert ist. 
<p>Mit dem Befehl <a href="#Zwischenablage">Bearbeiten</a> | <a href="#Text_extrahieren_und_Suche">Suche</a> k&#246;nnen Sie einen bestimmten Text 
suchen. 
Geben Sie dazu den gesuchten Text ein und bestimmen den Seitenbereich, 
in dem gesucht werden soll. 
Anschlie&#223;end wird die erste Seite angezeigt, die diesen Text enth&#228;lt. 
Beachten Sie dabei allerdings folgende Punkte: 
Beim Suchen k&#246;nnen weder im eigentlichen Text noch in dem Text, nach dem 
gesucht wird, Leerzeichen erkannt werden. Dies bedeutet, da&#223; bei der Suche 
nach "diese" sowohl "Diese" als auch "Die serielle" gefunden 
w&#252;rden. Dabei erh&#228;lt man keine Information dar&#252;ber, wo sich das Wort auf 
einer Seite befindet, da diese Information ohne einen 
PostScript-Interpreter nicht angezeigt werden kann. 
Dar&#252;ber hinaus funktioniert der Befehl <a href="#Text_extrahieren_und_Suche">Suche</a> nicht bei Dateien, 
die nicht <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-kompatibel sind bzw. eine bestimmte Seitenanordnung haben. 
<p>Mit dem Befehl <b>Bearbeiten </b>| <a href="#Text_extrahieren_und_Suche">Suche n&#228;chsten</a> wird die Suche auf der 
n&#228;chsten Seite fortgesetzt. 
<p>
<p>
<hr>
<h3><a name="PSzuText_Text_extrahieren_und_Suchen">PSzuText Text extrahieren und Suchen</a></h3>
Diese Methode verwendet pstotext und Ghostscript, um Text aus 
PostScript-Dateien zu extrahieren. Bevor Sie den Suchvorgang oder das 
Extrahieren starten k&#246;nnen, wird die gesamte PostScript-Datei verarbeitet. 
Dabei wird eine Text-Indexdatei erzeugt. Dieser Vorgang nimmt zwar l&#228;ngere 
Zeit in Anspruch, wenn die Indexdatei jedoch erzeugt ist, l&#228;uft das Suchen 
sehr schnell ab. 
<p>Pstotext verwendet den ISO-Latin1 Zeichensatz. 
Weitere Informationen zu pstotext erhalten Sie in: 
<pre>
 http://www.research.digital.com/SRC/virtualpaper/pstotext.html
</pre>
<p>Der Befehl <a href="#Seitenausrichtung">Ausrichtung</a> mu&#223; aktiviert sein, damit die Ausrichtung des 
Textes richtig ist. 
<p>Mit dem Befehl <a href="#Zwischenablage">Bearbeiten</a> | <a href="#Text_extrahieren_und_Suche">Text extrahieren</a> wird der Text bestimmter 
Seiten extrahiert und in eine Textdatei ausgegeben. 
<p>Mit dem Befehl <a href="#Zwischenablage">Bearbeiten</a> | <a href="#Zwischenablage">Kopieren</a> k&#246;nnen Sie W&#246;rter in die 
Zwischenablage kopieren. 
<p>Mit dem Befehl <a href="#Zwischenablage">Bearbeiten</a> | <a href="#Text_extrahieren_und_Suche">Suche</a> k&#246;nnen Sie einen bestimmten Text 
suchen. 
Geben Sie dazu den gesuchten Text ein und bestimmen den Seitenbereich, 
in dem gesucht werden soll. 
Anschlie&#223;end wird die erste Seite angezeigt, die diesen Text enth&#228;lt. 
Der gesuchte Text wird zun&#228;chst in einzelne W&#246;rter zerlegt. 
Diese werden im gesamten Dokument gesucht. Wenn Sie z. B. nach dem Wort 
<b> Fisch</b> suchen, erhalten Sie <b> Fisch</b>,<b> Fische</b> und<b> Meeresfisch</b>. 
Suchmuster '*' (0 oder beliebig viele Zeichen) und '?' (genau ein Zeichen) 
werden unterst&#252;tzt, sollten jedoch nicht am Wortanfang oder am Wortende 
eingegeben werden. 
Das Suchmuster expandiert dabei nicht &#252;ber die Wortgrenzen hinaus. 
Mehrere vollst&#228;ndige W&#246;rter, wie z. B. <b>GSview ist ein</b>, k&#246;nnen gefunden 
werden. 
Wurde der gesuchte Text gefunden, wird das erste Wort dieser Textstelle 
markiert. 
Der Befehl <a href="#Text_extrahieren_und_Suche">Suche</a> kann nur bei Dateien angewendet werden, 
die <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-kompatibel sind. Bei <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-kompatiblen Dateien, die eine 
bestimmte Seitenanordnung haben, funktioniert er nicht. 
<p>Mit dem Befehl <a href="#Zwischenablage">Bearbeiten</a> | <a href="#Text_extrahieren_und_Suche">Suche n&#228;chsten</a> wird die Suche fortgesetzt. 
<p>Normalerweise sollten Sie sollten Sie folgendes benutzen: 
<a href="#Optionen">Optionen</a> | <a href="#PSzuText">PSzuText</a> | <b>Normal</b> 
<p><a href="#Optionen">Optionen</a> | <a href="#PSzuText">PSzuText</a> | <b>Dvips Cork Encoding</b> 
ist nur relevant f&#252;r Postscript Dateien, die von dvips aus TeX oder 
LaTeX  Dokumenten erzeugt wurden. Ungl&#252;cklicherweise unterscheidet 
dvips nicht,  welche Zeichensatzkodierungen verwendet wurden. 
<p>
<p>
<hr>
<h2><a name="Zwischenablage">Zwischenablage</a></h2>
Mit dem Befehl <b>Kopieren</b> aus dem Men&#252; <b>Bearbeiten</b> kann der Inhalt des 
GSview-Fensters als Bitmap in die Zwischenablage kopiert werden. 
Das Bitmap wird dann als ger&#228;teunabh&#228;ngiges Bitmap (DIB/BMP-Format) gespeichert. 
<p>Eine weitere M&#246;glichkeit, ein Bitmap zu erzeugen, besteht in der 
Verwendung eines BMP-Treibers. Siehe hierzu auch <a href="#Drucken">Drucken</a>. 
<p>Mit dem Befehl <b>Einf&#252;gen</b> werden Device Independent Bitmaps aus der 
Zwischenablage als BMP-Dateien gespeichert. 
<p>Mit dem Befehl <b>Konvertiere Bitmap</b> kann ein ger&#228;teunabh&#228;ngiges Bitmap 
in ger&#228;teabh&#228;ngiges Bitmap umgewandelt werden und umgekehrt. 
Enth&#228;lt die Zwischenablage ein ger&#228;teunabh&#228;ngiges Bitmap (BMP-Format), 
wird es in ein ger&#228;teabh&#228;ngiges Bitmap umgewandelt und der Zwischenablage 
hinzugef&#252;gt. 
Enth&#228;lt die Zwischenablage keine Farbpalette, wird sie aus dem 
ger&#228;teunabh&#228;ngigen Bitmap erzeugt und der Zwischenablage hinzugef&#252;gt. 
Diese Option ist notwendig, da einige Anwendungen (insbesondere 
Paintbrush) ein ger&#228;teunabh&#228;ngiges Bitmap in der Zwischenablage nicht 
erkennen k&#246;nnen. 
<p>Wird bei einem Dokument der Befehl <a href="#Text_extrahieren_und_Suche">Text extrahieren</a> oder <a href="#Text_extrahieren_und_Suche">Suche</a> 
verwendet und  <a href="#PSzuText">PSzuText</a> ist aktiviert, erzeugt GSview eine Indexdatei 
mit den im Dokument enthaltenen W&#246;rtern. 
Werden W&#246;rter mit der Maus markiert, 
kopiert der Befehl <b>Kopieren</b> nicht ein Bitmap, sondern diese W&#246;rter in 
die Zwischenablage. 
Das Markieren eines Textes ist allerdings erst m&#246;glich, wenn der Befehl 
<a href="#Text_extrahieren_und_Suche">Text extrahieren</a> oder <a href="#Text_extrahieren_und_Suche">Suche</a> angewendet wird und dabei 
<a href="#Optionen">Optionen</a> | <a href="#PSzuText">PSzuText</a> aktiviert ist. 
<p>
<p>
<hr>
<h1><a name="Messen">Messen</a></h1>
L&#228;ngen k&#246;nnen gemessen werden indem die Cursorposition 
in der Statuszeile abgelesen wird oder mit der Dialogbox 
<b>Bearbeiten |</b> <b>Messen</b>. 
<p>Diese Dialogbox zeigt den Startpunkt, Endpunkt, Abstandsvektor 
und die Entfernung und den Winkel zwischen diesen Punkten. 
Der Startpunkt wird durch dr&#252;cken der linken Maustaste gesetzt. 
Der Default Startpunkt ist auf der linken unteren Ecke der Seite. 
Die m&#246;glichen Einheiten sind pt, mm, Zoll oder Benutzerdefiniert. 
<p>Benutzerdefinierte Einheiten erlauben Ihnen die Koordinaten so 
anzuzeigen, wie sie in der Postscript-Datei angegeben wurden. 
Benutzerdefinierte Einheiten werden gew&#246;hnlich angegeben indem 
mit einer Einheitsmatrix gestartet wird und dann einen Reihe 
von Transformationen darauf angewendet werden. 
Wenn eine Postscript-Datei Querformat aufruft durch 
<pre>
 90 rotate
 0 -595 translate
</pre>
<p>k&#246;nnen Sie zur Anzeige von Benutzerkoordinaten folgende 
Transformationen im Dialog eingeben: 
<pre>
 Custom
 initmatrix
 90 rotate
 0 -595 translate
 invertmatrix
 Ok
</pre>
<p>Die aktuelle Transformationsmatrix (Current Transformation 
Matrix - CTM) wird im oberen Teil des Dialogs angezeigt. 
Sie k&#246;nnen dort direkt die CTM eingeben wenn Sie Mathematik 
m&#246;gen. 
Es ist allerdings einfacher, wenn Sie die Werte in den 
Eingabefeldern eingeben, diese werden aber erst dann aktiv wenn 
einer der Transformationskn&#246;pfe (Translation, Rotation, Skalierung) 
bet&#228;tigt wird. 
<p>Siehe auch <b>Einheiten</b>. 
<p>
<p>
<hr>
<h1><a name="Optionen">Optionen</a></h1>
Das Men&#252; <b>Optionen</b> enth&#228;lt die folgenden Befehle: 
<p>
<a href="#Einfache_Konfiguration">Einfache Konfiguration</a><br>
<a href="#Fortgeschrittene_Konfiguration">Fortgeschrittene Konfiguration</a><br>
<a href="#Kl&#228nge">Kl&#228nge</a><br>
<a href="#Ma&#223einheiten">Ma&#223einheiten</a><br>
<a href="#Sprache">Sprache</a><br>
<a href="#PSzuText">PSzuText</a><br>
<a href="#DSC_Warnungen">DSC Warnungen</a><br>
<a href="#Optionen_speichern">Optionen speichern</a><br>
<a href="#Schreibschutz_f&#252r_Dateien">Schreibschutz f&#252r Dateien</a><br>
<a href="#Merke_letztes_Verzeichnis">Merke letztes Verzeichnis</a><br>
<a href="#Hilfsmittelpalette">Hilfsmittelpalette</a><br>
<a href="#Fenster_an_Seite_anpassen">Fenster an Seite anpassen</a><br>
<a href="#Automatisches_Neuzeichnen">Automatisches Neuzeichnen</a><br>
<a href="#EPS_Ausschnitt">EPS Ausschnitt</a><br>
<a href="#EPS_Warnung">EPS Warnung</a><br>
<a href="#Ignoriere_DSC">Ignoriere DSC</a><br>
<a href="#Zeige_Bounding_Box">Zeige Bounding Box</a><br>
<p>
<hr>
<h2><a name="Einfache_Konfiguration">Einfache Konfiguration</a></h2>
Die einfache Konfiguration erlaubt die Auswahl der zu verwendenden 
Ghostscript-Version. Es wird davon ausgegangen, dass Sie bereits 
Aladdin oder AFPL Ghostscript 5.50 oder neuer installiert haben. 
Haben Sie Ghostscript noch nicht installiert, lesen Sie in 
<a href="#Beschaffung_von_Ghostscript">Beschaffung von Ghostscript</a> nach. 
F&#252;r weitere Konfigurationseinstellungen von GSview, siehe 
<a href="#Fortgeschrittene_Konfiguration">Fortgeschrittene Konfiguration</a>. 
<p>Einfache Konfiguration stellt korrekte Pfade f&#252;r Ghostscript ein und 
kopiert eine Druckerstandardeinstellungen in die INI-Datei. 
<p>Die Registry oder das Start-Menu werden nicht ge&#228;ndert. 
<p>
<p>
<hr>
<h2><a name="Fortgeschrittene_Konfiguration">Fortgeschrittene Konfiguration</a></h2>
<b>Ghostscript DLL</b> teilt GSview mit, wo das die Ghostscript-DLL zu finden 
ist. 
Der Standard f&#252;r Win32 ist 
<pre>
 c:\gs\gsN.NN\bin\gsdll32.dll
</pre>
<p>Tragen Sie dazu den korrekten Suchpfad f&#252;r Ghostscript in das Feld 
<b>Ghostscript Suchpfad</b> ein. In diesem Suchpfad m&#252;ssen alle Verzeichnisse 
vorhanden sein, die die Ghostscript-Bibliotheksdateien (gs_*.ps und die Datei 
Fontmap) sowie die Ghostscript-Fonts (*.pfb) enthalten. Zum Beispiel: 
<pre>
  c:\gs\gsN.NN\lib;c:\gs\fonts
</pre>
<p>Setzen Sie dabei auf keinen Fall die Option <b>-I</b> vor den Suchpfad. 
<p>Das Feld <b>Ghostscript Optionen</b> wird normalerweise freigelassen. 
Wenn allerdings z.B. die <b>Plattform Fonts</b> unter MS-Windows ausgeschaltet 
werden sollen, tragen Sie die Option <b>-dNOPLATFONTS</b> in dieses Feld ein. 
<p>Sollen nicht im Fontmap aufgelistete Fonts gesucht werden, f&#252;gen Sie 
-sFONTPATH in dieses Feld ein. Zum Beispiel: 
<pre>
  -dNOPLATFONTS -sFONTPATH="c:\psfonts"
</pre>
<p>Wenn Sie einen falschen <b>Ghostscript DLL</b>-Eintrag verwenden, kann GSview 
Ghostscript nicht laden. 
Wenn Sie einen falschen <b>Ghostscript Include Path</b> verwenden, kann Ghostscript 
nicht initialisiert werden und wird wieder entladen. 
<p>Auswahl von <b>Copy printer defaults</b> aktualisiert gsview32.ini mit den Werten 
aus der Datei printer.ini. 
<p>Auswahl von <b>Associate .ps files with GSview</b> aktualisert die Registry, so 
dass PostScript-Dateien mit GSview assoziiert werden. 
<p>Auswahl von <b>Associate .pdf files with GSview</b> aktualisert die Registry, so 
dass PDF-Dateien mit GSview assoziiert werden. 
<p>Auswahl von <b>Create Start Menu items</b> f&#252;gt GSview dem Startmen&#252; hinzu. 
<p>Es gibt kein <b>Undo</b> f&#252;r die von den vier Checkboxen ausgeloesten Aktionen. 
Die Assoziierungen und Hinzuf&#252;gung zum Startmenu werden normalerweise durch 
das Setup-Programm (mit Undo-Funktion) vorgenommen. 
<p>Lesen Sie hierzu auch den Punkt <a href="#Installation">Installation</a>. 
<p>
<p>
<hr>
<h2><a name="Kl&#228;nge">Kl&#228;nge</a></h2>
Mit der Option <b>Kl&#228;nge</b> k&#246;nnen verschiedene Aktionen akustisch untermalt 
werden. Dabei kann f&#252;r jede Aktion <b>Kein Ton</b>, <b>Piepton</b> oder <b>Audiodateien</b> 
ausgew&#228;hlt werden. 
<p>F&#252;r die Verwendung von Audiodateien ist eine Soundkarte erforderlich. 
Unter MS-Windows 3.0 ist die Erzeugung von Kl&#228;ngen mittels Audiodateien 
nicht m&#246;glich. 
<p>Folgende Aktionen k&#246;nnen akustisch untermalt werden: 
<p><b>Ausgabe Seite</b>: Der PostScript-Operator showpage wurde ausgef&#252;hrt. 
<p><b>Keine Seite</b>: Sie haben eine ung&#252;ltige Seite ausgew&#228;hlt. 
Beispiel: Sie klicken auf <a href="#Seiten_auswählen">Vorherige Seite</a>, obwohl Sie sich auf der 
ersten Seite eines Dokumentes mit <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-Kommentaren befinden. 
<p><b>Keine Numerierung</b>: Sie haben einen Befehl ausgew&#228;hlt, der die 
Seitennumerierung erfordert, diese ist aber nicht vorhanden. 
Beispiel: Sie klicken beim Anzeigen des Dokumentes auf <a href="#Seiten_auswählen">Gehe zu Seite</a>, 
obwohl keine <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-Kommentare vorhanden sind. 
<p><b>Nicht offen</b>: Sie haben einen Befehl ausgew&#228;hlt, bei dem ein Dokument 
ge&#246;ffnet sein mu&#223;, es ist jedoch kein Dokument ge&#246;ffnet. 
Beispiel: Sie klicken auf <a href="#Seiten_auswählen">Gehe zu Seite</a>, obwohl kein Dokument ge&#246;ffnet 
ist. 
<p><b>Fehler</b>: verschiedene Fehlerarten 
<p><b>Start</b>: Das Programm GSview wird gestartet. 
<p><b>Verlassen</b>: Das Programm GSview wird beendet. 
<p><b>Besch&#228;ftigt</b>: Es werden Befehle ausgef&#252;hrt, deshalb ist kein Dialog 
m&#246;glich. 
<p>Bei <b>Keine Seite</b>, <b>Fehler</b> und <b>Besch&#228;ftigt</b> lauten die 
Standardeinstellungen <b>Piepton</b>, bei allen anderen <b>kein Ton</b>. 
<p>
<p>
<hr>
<h2><a name="Ma&#223;einheiten">Ma&#223;einheiten</a></h2>
Mit der Option <b>Ma&#223;einheiten</b> legen Sie fest, in welcher Einheit die 
Cursorposition in der Statuszeile angegeben wird. Folgende Ma&#223;einheiten 
sind m&#246;glich: Zoll, Millimeter (mm) und Punkt (pt). Die 
Voreinstellung ist pt. 
<p>Die Aufl&#246;sung der Einheiten kann durch Auswahl von 
<b>Einheiten</b> | <b>Feine Aufl&#246;sung</b> erh&#246;ht werden. 
<p>Siehe auch <a href="#Messen">Messen</a>. 
<p>
<p>
<hr>
<h2><a name="Sprache">Sprache</a></h2>
GSview ist in Englisch, Niederl&#228;ndisch, Franz&#246;sisch, Deutsch, Griechisch,  
Italienisch und Spanisch verf&#252;gbar. 
&#220;ber die Funktion <b>Optionen </b>| <b>Sprache</b> k&#246;nnen Sie die Einstellung ver&#228;ndern. 
<p>Unter Windows NT k&#246;nnen alle verf&#252;gbaren Sprachen unabh&#228;ngig  
von den L&#228;ndereinstellungen gew&#228;hlt werden. 
Auf anderen Systemen h&#228;ngen  die verf&#252;gbaren Sprachen von den L&#228;ndereinstellungen 
ab, insbesondere von den gew&#228;hlten locales oder Systemcodeseiten (code pages). 
<p><p>
<p>
<hr>
<h2><a name="PSzuText">PSzuText</a></h2>
Gsview unterst&#252;tzt zwei verschiedene Methoden, um Text zu suchen und 
aus dem Postscriptdokument zu extrahieren. 
Die <b>Schnelle Textsuche</b> verwendet eine sehr simple Extraktion der 
Postscriptkommandos aus dem Dokument. 
Diese Methode st&#246;&#223;t relativ schnell an ihre Grenzen. 
Diese Methode wird via <b>PSzuText</b> | <b>Deaktiviert</b> gew&#228;hlt. 
<p>Die mit <b>PSzuText Textsuche</b> angeschaltete Methode verwendet das externe 
Programm pstotext und Ghostscript um Worte und ihre Koordinaten 
aus einem Dokument zu extrahieren. 
Dies ist die genauere Methode, sie ben&#246;tigt jedoch auch erheblich mehr Zeit. 
Hierbei gibt es zwei Modi. <b>Normal</b> sollte bei den meisten Dokumenten 
eingeschaltet werden, lediglich bei Dateien, die durch dvips erzeugt wurden, 
sollte <b>Dvips Cork Encoding</b> aktiviert werden. 
<p>Voreinstellung ist <b>Normal</b>. 
<p>
<p>
<hr>
<h2><a name="DSC_Warnungen">DSC Warnungen</a></h2>
Einige Dokumente enthalten Fehler in den DSC-Kommentaren. 
Der Schwellenwert der Warnungen kann bei <a href="#Optionen">Optionen</a> | <b>DSC Warnungen</b> 
eingestellt werden. 
Wenn sie ausgestellt sind, dann nimmt GSview an, dass die DSC- 
Kommentare korrekt sind. <b>Fehler</b> benachrichtigt Sie &#252;ber Fehler 
in den DSC-Kommentaren. <b>Warnungen</b> benachtigt Sie bei Fehlern 
und Warnungen. <b>Alle</b> informiert Sie &#252;ber jede Unregelm&#228;&#223;igkeit 
in den DSC-Kommentaren. Voreinstellung ist <b>Warnungen</b>. 
<p>Wenn Sie angegeben haben, da&#223; Sie &#252;ber Fehler und Warnungen 
informiert werden wollen, gibt ihnen die DSC Warnungsbox 
folgende M&#246;glichkeiten: 
<b>OK</b> weist GSview an zu raten, was wahrscheinlich gemeint war 
(das mu&#223; nicht das gewesen sein, was der DSC-Kommentar tats&#228;chlich 
bedeutet), <b>Abbruch</b> bewegt GSview dazu, die DSC-Kommentare als korrekt 
anzunehmen, <b>DSC Kommentare ignorieren</b> l&#228;&#223;t GSview alle DSC-Kommentare 
ignorieren. 
<p>Wenn <b>DSC Warnungen</b> den Wert <b>Aus</b> hat, dann nimmt GSview <b>Abbruch</b> an. 
Dokumente mit inkorrekten DSC-Kommentaren verursachen wahrscheinlich 
Probleme. 
<p>
<p>
<hr>
<h2><a name="Optionen_speichern">Optionen speichern</a></h2>
Mit der Option <b>Speichere Optionen jetzt</b> werden die Position des 
GSview-Fensters, die Fenstergr&#246;&#223;e, der zuletzt benutzte Drucker, 
das zuletzt ausgew&#228;hlte Verzeichnis sowie alle Optionen aus den Men&#252;s 
<a href="#Optionen">Optionen</a> und <a href="#Seitenformat">Formate</a> in der Initialisierungsdatei 
gsview32.ini im Windows-Systemverzeichnis (oder f&#252;r Windows 95 oder NT 4 
im Nutzerprofilverzeichnis, falls Nutzerprofile verwendet werden) 
gespeichert. Wird das Programm gestartet, liest GSview diese Datei. 
<p>Ist die Option <b>Einstellungen beim Beenden speichern</b> aktiviert, werden 
die oben aufgelisteten Einstellungen gespeichert, wenn Sie das Programm 
beenden. 
<p>
<p>
<hr>
<h2><a name="Schreibschutz_f&#252;r_Dateien">Schreibschutz f&#252;r Dateien</a></h2>
Ist die Option <b> Schreibschutz f&#252;r Dateien </b> aktiviert, erh&#228;lt Ghostscript das 
Kennzeichen <b>-dSAFER</b>. 
Damit werden die Operatoren zum L&#246;schen oder Umbenennen von Dateien deaktiviert. 
Au&#223;erdem k&#246;nnen Dateien dann nur noch schreibgesch&#252;tzt ge&#246;ffnet werden. 
Dies ist die Standard-Einstellung. 
<p>Ist die Option <b>Schreibschutz f&#252;r Dateien</b> deaktiviert, kann Ghostscript 
Dateien ver&#228;ndern. 
<p>
<p>
<hr>
<h2><a name="Merke_letztes_Verzeichnis">Merke letztes Verzeichnis</a></h2>
Ist die Option <b>Merke letztes Verzeichnis</b> aktiviert, wird beim Beenden 
von GSview das aktuelle Verzeichnis gespeichert. 
Wenn Sie GSview beim n&#228;chsten Mal wieder aufrufen,  wird automatisch 
wieder dieses Verzeichnis angew&#228;hlt. 
In der Voreinstellung ist diese Option aktiviert. 
<p>Ist die Option <b>Merke letztes Verzeichnis</b> deaktiviert, ist das aktuelle 
Verzeichnis beim Starten von GSview das Verzeichnis, in dem sich Gsview 
befindet, oder das entsprechende Arbeitsverzeichnis. 
<p>
<p>
<hr>
<h2><a name="Hilfsmittelpalette">Hilfsmittelpalette</a></h2>
Ist die Option <b>Hilfsmittelpalette</b> aktiviert, wird am 
oberen 
Bildschirmrand eine Hilfsmittelpalette eingeblendet. In der 
Default-Einstellung ist diese Option aktiviert. 
In der Hilfsmittelpalette sind folgende Symbole enthalten (Anordnung 
von 
links nach rechts): 
<p>
<img src="gvwopen.gif">
<a href="#Datei_öffnen">Datei</a> | <a href="#Datei_öffnen">&#214;ffnen</a> 
<p>
<img src="gvwprint.gif">
<a href="#Datei_öffnen">Datei</a> | <a href="#Drucken">Drucken</a> 
<p>
<img src="gvwinfo.gif">
<a href="#Datei_öffnen">Datei</a> | <a href="#Datei-Informationen">Info</a> 
<p>
<img src="gvwhelp.gif">
<b>Hilfe</b> | <b>Inhalt</b> 
<p>
<img src="gvwgoto.gif">
<a href="#Seiten_auswählen">Anzeige</a> | <a href="#Seiten_auswählen">Gehe zu Seite</a> 
<p>
<img src="gvwprevs.gif">
<b>Springe 5 Seiten r&#252;ckw&#228;rts</b> 
<p>
<img src="gvwprev.gif">
<a href="#Seiten_auswählen">Anzeige</a> | <a href="#Seiten_auswählen">Vorherige Seite</a> 
<p>
<img src="gvwnext.gif">
<a href="#Seiten_auswählen">Anzeige</a> | <a href="#Seiten_auswählen">N&#228;chste Seite</a> 
<p>
<img src="gvwnexts.gif">
<b>Springe 5 Seiten vorw&#228;rts</b> 
<p>
<img src="gvwback.gif">
<a href="#Seiten_auswählen">Anzeige</a> | <b>Gehe zur&#252;ck</b> 
<p>
<img src="gvwfwd.gif">
<a href="#Seiten_auswählen">Anzeige</a> | <b>Gehe vorw&#228;rts</b> 
<p>
<img src="gvwmagp.gif">
<b>Erh&#246;he Aufl&#246;sung um 1,2</b> 
<p>
<img src="gvwmagm.gif">
<b>Verringere Aufl&#246;sung um 1/1,2</b> 
<p>
<img src="gvwfind.gif">
<b>Bearbeiten </b>| <a href="#Text_extrahieren_und_Suche">Suche</a> 
<p>
<img src="gvwfindn.gif">
<b>Bearbeiten </b>| <a href="#Text_extrahieren_und_Suche">Suche n&#228;chsten</a> 
<p>Wenn Sie die Symbole "Erh&#246;he bzw. verringere Aufl&#246;sung" anklicken, sollte 
die Option<b> Automatisches Neuzeichnen</b> aktiviert sein. 
Anstelle der Hilfsmittel kann auch der Befehl <b>Formate </b>| 
<a href="#Anzeige_Einstellungen">Anzeige Einstellungen</a> verwendet werden. 
Ist die Option <b>Hilfsmittelpalette</b> deaktiviert, zeigt GSview keine 
Hilfsmittelpalette an. 
<p>
<p>
<hr>
<h2><a name="Fenster_an_Seite_anpassen">Fenster an Seite anpassen</a></h2>
Ist die Option <a href="#Seiten_auswählen">Fenster an Seite anpassen</a> aktiviert, bewirken 
Ver&#228;nderungen der Seitengr&#246;&#223;e oder -ausrichtung, da&#223; das Fenster 
vergr&#246;&#223;ert oder verkleinert wird um sich der neuen Seitengr&#246;&#223;e anzupassen. 
Wenn die Fenstergr&#246;&#223;e ver&#228;ndert wird, erzwingt GSview, da&#223; das 
Fenster niemals gr&#246;&#223;er wird, als die darzustellende Seite. 
<p>&#196;nderungen der Fenstergr&#246;&#223;e werden nur vorgenommen, wenn die Fenstergr&#246;&#223;e 
oder die Seitengr&#246;&#223;e ver&#228;ndert werden; dies geschieht nicht unmittelbar 
durch Setzen der Option. 
In der Vollbilddarstellung wird diese Option ignoriert. 
<p>Ist die Option <a href="#Seiten_auswählen">Fenster an Seite anpassen</a> deaktiviert, wird die 
Fenstergr&#246;&#223;e nicht ver&#228;ndert. Die Fl&#228;che zwischen der angezeigten Seite 
und dem Fensterrahmen wird dann hellgrau angezeigt. 
Deaktivieren Sie die Option, wenn z.B. die Fenstergr&#246;&#223;e nicht verkleinert 
werden soll, weil Seiten geringer Aufl&#246;sung angezeigt werden sollen. 
Das ist auch die Voreinstellung. 
<p>Siehe auch <a href="#Seiten_auswählen">Anzeige</a> | <a href="#Seiten_auswählen">Fenster an Seite anpassen</a>. 
<p>
<p>
<hr>
<h2><a name="Automatisches_Neuzeichnen">Automatisches Neuzeichnen</a></h2>
Ist die Option <b>Automatisches Neuzeichnen</b> aktiviert, werden 
<a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-kompatible Dokumente neu auf dem Bildschirm aufgebaut, 
wenn die <a href="#Seitenausrichtung">Ausrichtung</a>, die <a href="#Anzeige_Einstellungen">Aufl&#246;sung</a>, die <a href="#Anzeige_Einstellungen">Farbtiefe</a> oder 
<a href="#Seitenformat">Formate</a>-Einstellungen ver&#228;ndert werden. 
Das ist Voreinstellung. 
<p>Ist diese Option bei <b>nicht-DSC-Dokumenten</b> aktiviert, beginnt 
GSview den Bildschirmaufbau bei der ersten Seite. 
<p>Ist die Option <b>Automatisches Neuzeichnen</b> deaktiviert, verwenden Sie 
stattdessen den Befehl <a href="#Seiten_auswählen">Anzeige</a> | <a href="#Seiten_auswählen">Wiederaufbau</a>, nachdem eine der oben 
aufgef&#252;hrten Einstellungen ge&#228;ndert wurde. 
<p>
<p>
<hr>
<h2><a name="EPS_Ausschnitt">EPS Ausschnitt</a></h2>
Ist die Option <b>EPS Ausschnitt</b> aktiviert, wird das Bitmap auf dem 
Bildschirm direkt in die Bounding Box einer EPS-Datei ausgeschnitten und 
nicht &#252;ber das Seitenformat im Men&#252; <a href="#Seitenformat">Formate</a> definiert. Verwenden Sie 
diese Funktion, um ein Bitmap-Preview in eine EPS-Datei einzuf&#252;gen. 
Wenn eine PDF-DAtei angezeigt wird, f&#252;hrt <b>EPS Ausschnitt</b> zum Abschneiden 
der Anzeige entsprechend der PDF-Crop-Box. 
<p>Ist die Option <b>EPS Ausschnitt</b> deaktiviert, verwendet GSview das 
Seitenformat, das im Men&#252; <a href="#Seitenformat">Formate</a> festgelegt wurde. 
Das ist die Voreinstellung. 
<p>Mit der Option <b>EPS Ausschnitt</b> werden keine Ver&#228;nderungen am 
Ursprungs-Dokument vorgenommen. Es wird lediglich die 
Gr&#246;&#223;e des Ausschnittes festgelegt, der auf dem Bildschirm 
angezeigt werden soll. Das Drucken wird davon nicht beeinflu&#223;t. 
<p>Siehe hierzu auch den Befehl <a href="#Zwischenablage">Bearbeiten</a>| <a href="#EPS_Vorschau_(Preview)">EPS Vorschau einf&#252;gen</a>. 
<p>
<p>
<hr>
<h2><a name="EPS_Warnung">EPS Warnung</a></h2>
Wenn die Option <b>EPS Warnung</b> aktiviert ist, wird bei jedem &#214;ffnen einer 
Datei ein Prolog in Ghostscript geschrieben. 
Sobald PostScript-Operatoren verwendet werden, die in <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">EPS</a>-Dateien nicht 
erlaubt sind, erzeugt dieser Prolog Warnmeldungen, die mit dem Befehl 
<b>Datei </b>| <a href="#Meldungen_anzeigen">Meldungen anzeigen</a> auf dem Bildschirm angezeigt werden k&#246;nnen. 
Beispiel f&#252;r eine Warnmeldung: 
<pre>
 Warning: EPS files must not use /initgraphics
</pre>
<p>Die Option zeigt nicht alle Meldungen an. So k&#246;nnen z.B. "kritische" 
Operatoren eingesetzt werden, ohne da&#223; eine Meldung erzeugt wird. 
Erhalten Sie dennoch eine Meldung, verwenden Sie auf keinen Fall den 
Befehl <a href="#PS_zu_EPS">PS zu EPS</a>. 
<p>In der Voreinstellung ist die Option <b>EPS Warnung</b> deaktiviert. 
<p>Siehe auch <a href="#PS_zu_EPS">PS zu EPS</a>. 
<p>
<p>
<hr>
<h2><a name="Ignoriere_DSC">Ignoriere DSC</a></h2>
Manche Dokumente behaupten f&#228;lschlich, den Adobe DSC-Konventionen zu 
entsprechen. In diesem Fall k&#246;nnen bei dem Versuch, das Dokument anzuzeigen, 
Probleme auftreten. 
Wenn Sie die Option <b>Ignoriere DSC</b> aktivieren, behandelt GSview das 
Dokument so, als ob es keine DSC-Kommentare enth&#228;lt und zeigt die Seiten 
in der urspr&#252;nglichen Reihenfolge an. 
<p>In der Voreinstellung ist die Option <b>Ignoriere DSC</b> deaktiviert. 
<p>
<p>
<hr>
<h2><a name="Zeige_Bounding_Box">Zeige Bounding Box</a></h2>
Nach Auswahl dieser Option wird ein Rechteck &#252;ber die Graphik gezogen, 
das die Position der Bounding Box anzeigt. Die Bounding Box wird nur auf 
dem Bildschirm dargestellt und hat keinen Einflu&#223; auf die 
Druckausgabe. Sie wird nur bei <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-kompatiblen Dokumenten angezeigt 
(Dokumente, die keine DSC-Kommentare enthalten, haben keine Bounding Box). 
<p>In der Voreinstellung ist die Option <b>Zeige Bounding Box</b> deaktiviert. 
<p>
<p>
<hr>
<h1><a name="Seitenausrichtung">Seitenausrichtung</a></h1>
Mit den Befehlen <b>Hochformat</b>, <b>Querformat</b>, <b>Kopf&#252;ber</b> und <b>Umgekehrt 
quer</b> im Men&#252; <b>Ausrichtung </b>bestimmen Sie die Seitenausrichtung, die 
angezeigt werden soll. 
Mit dem Befehl <b>Querformat</b> wird das Papier um 90 Grad im Uhrzeigersinn 
gedreht. 
Mit dem Befehl <b>Umgekehrt quer</b> wird das Papier um 90 Grad gegen den 
Uhrzeigersinn gedreht. 
Die Ausrichtung, die Sie hier w&#228;hlen, gilt nur f&#252;r die Darstellung auf 
dem Bildschirm und hat keine Auswirkung auf das Drucken. 
<p>Wenn die Option <b>Automatisch</b> im Men&#252; <b>Seitenausricht</b> gesetzt ist und 
das Dokument einen <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-Kommentar zur Seitenausrichtung enth&#228;lt 
(%%Orientation oder %%PageOrientation), wird die Seitenausrichtung 
automatisch ausgew&#228;hlt. 
<p>Ist die Option <b>Gedreht quer</b> aktiviert, wird die Bedeutung von <b>Querformat</b> 
und <b>Umgekehrt quer</b> vertauscht. 
Bei den meisten Dokumenten im Querformat ist es erforderlich, sie zur 
Ansicht um 90 Grad im Uhrzeigersinn zu drehen. Da es hier jedoch keinen 
Standard gibt, m&#252;ssen einige Dokumente auch in die entgegengesetzte 
Richtung - also gegen den Uhrzeigersinn - gedreht werden. 
Mit der Funktion <b>Gedreht quer</b> dreht GSview das Dokument gem&#228;&#223; dem 
<b>%%Orientation</b>-Kommentar, den die PostScript-Datei enth&#228;lt, 
automatisch in die richtige Richtung. 
<p>Siehe auch <a href="#Seitenformat">Seitenformat</a> und <a href="#Anzeige_Einstellungen">Anzeige Einstellungen</a>. 
<p>
<p>
<hr>
<h1><a name="Anzeige_Einstellungen">Anzeige Einstellungen</a></h1>
Diese Einstellungen beeinflussen lediglich die Anzeige auf dem Bildschirm. 
<p>Im Feld <b>Aufl&#246;sung</b> wird die Aufl&#246;sung der Anzeige in dpi festgelegt. 
Der Default-Wert f&#252;r einen VGA-Bildschirm betr&#228;gt 96 dpi. Diese Aufl&#246;sung 
kann auch &#252;ber die Symbole der Hilfsmittelpalette ge&#228;ndert werden. 
<p>Bei DSC-kompatiblen Dateien wird durch Dr&#252;cken der rechten Maustaste die 
Standard-Druckeraufl&#246;sung auf die Seite gezoomt. 
Durch erneutes Dr&#252;cken der rechten Maustaste erhalten Sie wieder die 
normale Aufl&#246;sung. Die Eintragung im Feld <b>Zoom Aufl&#246;sung</b> wird in dpi 
angegeben. 
<p>Im Feld <b>Farbtiefe</b> wird die Tiefe des Bitmaps, die auf dem Bildschirm 
dargestellt wird, in bits per pixels festgelegt Als Standard-Einstellung 
wird die maximale Bittiefe eingetragen, die der mitgelieferte 
Bildschirmtreiber bietet. 
W&#228;hlen Sie keine h&#246;here Einstellung, da sonst nur zus&#228;tzlicher Speicher 
f&#252;r das Bitmap ben&#246;tigt wird, die Bildqualit&#228;t aber nicht weiter verbessert 
werden kann. 
<p>Im Feld <b>Text Alpha</b> wird das Antialiasing f&#252;r Schriften (geschickter 
Einsatz von Graustufen zum Gl&#228;tten der Treppenstufen) festgelegt. 
Die Voreinstellung in diesem Feld betr&#228;gt 4 bit (Antialiasing). 
Um das Antialiasing zu deaktivieren, w&#228;hlen Sie 1 bit. 
<p><b>Achtung!</b>: 
Durch die Funktion <b>Text Alpha</b> schaltet GSview die <b>Plattform Fonts</b> aus, 
indem die Option 
<pre>
 -dNOPLATFONTS
</pre>
<p>in das Feld Ghostscript Optionen in 
<b>Optionen </b>| <b>Konfiguriere Ghostscript</b> eingetragen wird. 
<p>Im Feld <b>Graphik Alpha</b> wird das Antialiasing f&#252;r Graphiken und Texte, 
die nicht mehr in den Fonts Cache passen, festgelegt. 
<p>Durch das Antialiasing wird der Bildaufbau langsamer. Dar&#252;ber hinaus kann 
die Funktion nur genutzt werden, wenn im Feld <b>Farbtiefe</b> mindestens 8 
bits/pixel eingetragen ist. 
<p>
<a href="#Zoomen">Zoomen</a><br>
<p>
<hr>
<h2><a name="Zoomen">Zoomen</a></h2>
Um die Darstellung zu vergr&#246;&#223;ern, positionieren Sie den Mauszeiger auf die 
Stelle, die vergr&#246;&#223;ert werden soll, und dr&#252;cken die rechte Maustaste. 
Das Fenster wechselt von der normalen Darstellung in die vergr&#246;&#223;erte 
Zoom-Darstellung. 
In der Statuszeile wird dieses durch die Meldung "Vergr&#246;&#223;ert" angezeigt. 
Der gezoomte Bereich befindet sich in der Bildmitte. 
Um die <b>Zoom</b>-Funktion wieder r&#252;ckg&#228;ngig zu machen, dr&#252;cken Sie erneut 
die rechte Maustaste oder w&#228;hlen Sie eine Funktion aus, bei der der 
Bildschirm wieder aufgebaut wird (z.B. <a href="#Seiten_auswählen">Wiederaufbau</a>, <a href="#Seiten_auswählen">N&#228;chste Seite</a>). 
Die Default-Einstellung f&#252;r das Zoomen betr&#228;gt 300 dpi. 
Diese Einstellung kann jederzeit &#252;ber den Befehl 
<a href="#Seitenformat">Formate</a> | <b>Anzeige Einstellung</b> im Dialogfeld ge&#228;ndert werden. 
<p>Die <b>Zoom</b>-Funktion ist nur bei <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-kompatiblen Dokumenten m&#246;glich. 
<p>Um die gesamte Seite zu vergr&#246;&#223;ern oder zu verkleinern, ver&#228;ndern Sie die 
<a href="#Anzeige_Einstellungen">Aufl&#246;sung</a>. Gehen Sie dazu &#252;ber den Men&#252;punkt 
<a href="#Seitenformat">Formate</a> | <b>Anzeige Einstellung</b> oder benutzen die Symbole der 
Hilfsmittelpalette. 
<p>
<p>
<hr>
<h1><a name="Seitenformat">Seitenformat</a></h1>
&#220;ber das Men&#252; <b>Formate</b> k&#246;nnen Sie die Seitengr&#246;&#223;e ausw&#228;hlen. 
M&#246;gliche Gr&#246;&#223;en sind: 
<pre>
 11x17          11   x 17   inch
 A0              840 x 1189 mm
 A1              594 x 840  mm
 A2              420 x 594  mm
 A3              297 x 420  mm
 A4              210 x 297  mm
 A5              148 x 210  mm
 B4              257 x 364  mm
 B5              182 x 257  mm
 Ledger         17   x 11   inch
 Letter          8.5 x 11   inch
 Legal           8.5 x 14   inch
 Note            8.5 x 11   inch
</pre>
<p>Mit dem Befehl <b>Benutzerdefiniert</b> k&#246;nnen Sie eine individuelle Gr&#246;&#223;e 
definieren (Einheit PostScript Punkt (pt), 1/72 Zoll). So erhalten Sie 
bei der Seitengr&#246;&#223;e 480x360 pt bei einer Aufl&#246;sung von 96 dpi eine 
Bildgr&#246;&#223;e von 640x480 Pixel. 
<p>Enth&#228;lt die Datei einen <a href="#Document_Structuring_Conventions_(DSC-Kommentare)">DSC</a>-Kommentar zum Seitenformat, wie z.B. 
<pre>
 %%DocumentPaperSizes: a4
 %%DocumentMedia: a4 595 842 80 white ( )
</pre>
<p>wird das Seitenlayout automatisch definiert. Handelt es sich bei der 
Beschreibung in der Kommentarzeile nicht um eine der oben genannten 
Gr&#246;&#223;en, wird automatisch <b>Benutzerdefiniert</b> gesetzt. 
<p>Wurde <b>Rotiere Medium</b> aktiviert, werden H&#246;he und Breite der Seite 
vertauscht. Die auf die Seite gezeichnete Abbildung wird nicht 
gedreht. 
Auswahl von <b>A4</b> und <b>Rotiere Medium</b> entspricht der Auswahl von 
<b>Benutzerdefiniert</b> mit einer Abmessung von 842 x 595 pt. 
Es ist eher &#252;blich, die Einstellungen im Men&#252; <a href="#Seitenausrichtung">Seitenausrichtung</a> als 
<b>Rotiere Medium</b> zu w&#228;hlen. 
<p>
<p>
<hr>
<h1><a name="Tastenkombinationen">Tastenkombinationen</a></h1>
In GSview wurden den einzelnen Befehlen folgende Tastenkombinationen 
zugeordnet: 
<b>O</b>, <b>o</b>  Daten &#246;ffnen und anzeigen.  (<a href="#Datei_öffnen">Datei</a> | <a href="#Datei_öffnen">&#214;ffnen</a>) 
<p><b>S</b>, <b>s</b>  Datei schlie&#223;en.  (<a href="#Datei_öffnen">Datei</a> | <a href="#Datei_öffnen">Schlie&#223;en</a>) 
<p><b>N</b>, <b>n</b>, <b>+</b>  N&#228;chste Seite.  (<a href="#Seiten_auswählen">Anzeige</a> | <a href="#Seiten_auswählen">N&#228;chste Seite</a>) 
<p>Leertaste     N&#228;chste Seite oben.  (<a href="#Seiten_auswählen">Anzeige</a> | <b>N&#228;chste Seite oben</b>) 
<p><b>V</b>, <b>v</b>, <b>-</b>  Vorherige Seite.  (<a href="#Seiten_auswählen">Anzeige</a> | <a href="#Seiten_auswählen">Vorherige Seite</a>) 
<p>BackSpace  Vorherige Seite oben.  (<a href="#Seiten_auswählen">Anzeige</a> | <b>Vorherige Seite oben</b>) 
<p><b>G</b>, <b>g</b>  Gehe zu Seite.  (<a href="#Seiten_auswählen">Anzeige</a> | <a href="#Seiten_auswählen">Gehe zu Seite</a>) 
<p><b>I</b>, <b>i</b>  Dateiinformation.  (<a href="#Datei_öffnen">Datei</a> | <a href="#Datei-Informationen">Info</a>) 
<p><b>W</b>, <b>w</b>, <b>F5</b>  Seite wieder aufbauen.  (<a href="#Seiten_auswählen">Anzeige</a> | <a href="#Seiten_auswählen">Wiederaufbau</a>) 
<p><b>A</b>, <b>a</b>  Datei ausw&#228;hlen (&#246;ffnen, aber nicht anzeigen). 
(<a href="#Datei_öffnen">Datei</a> | <a href="#Datei_öffnen">Auswahl Datei</a>) 
<p><b>U</b>, <b>u</b>  Unter einem anderen Namen speichern. 
(<a href="#Datei_öffnen">Datei</a> | <a href="#Datei_öffnen">Speichern unter</a>) 
<p><b>D</b>, <b>d</b>  Alle oder einzelne Seiten drucken.  (<a href="#Datei_öffnen">Datei</a> | <a href="#Drucken">Drucken</a>) 
<p><b>F</b>, <b>f</b>  Wandle alle oder einzelne Seiten in eine PDF- oder 
<pre>
 Bitmap-Datei. (<a href="#Datei_öffnen">Datei</a> | <a href="#Konvertierung">Konvertierung</a>).
</pre>
<p><b>E</b>, <b>e</b>  Mehrere Seiten in andere Datei extrahieren. 
(<a href="#Datei_öffnen">Datei</a> | <a href="#Extrahiere">Extrahiere</a>) 
<p><b>M</b>, <b>m</b>  Ghostscriptmeldungen anzeigen. (<a href="#Datei_öffnen">Datei</a> | <a href="#Meldungen_anzeigen">Meldungen anzeigen</a>) 
<p><b>&lt;</b> Aufl&#246;sung verringern 
<p><b>&gt;</b> Aufl&#246;sung erh&#246;hen 
<p><b>F1</b>  Hilfe.  (<b>Hilfe</b> | <b>Inhalt</b>) 
<p><b>Ctrl+C</b>, <b>Ctrl+Einfg</b>  Angezeigte Bitmap in Zwischenablage kopieren. 
(<a href="#Zwischenablage">Bearbeiten</a> | <a href="#Zwischenablage">Kopieren</a>) 
<p><b>Ctrl+S</b>, Text suchen. (<a href="#Zwischenablage">Bearbeiten</a> | <a href="#Text_extrahieren_und_Suche">Suche</a>) 
<p><b>F3</b>, N&#228;chsten Text suchen. (<a href="#Zwischenablage">Bearbeiten</a> | <a href="#Text_extrahieren_und_Suche">Suche n&#228;chsten</a>) 
<p><b>F4</b>  Ganzer Bildschirm.  (<a href="#Seiten_auswählen">Anzeige</a> | <b>Ganzer Bildschirm</b>) 
<p><b>F6</b>  An Fenster anpassen.  (<a href="#Seiten_auswählen">Anzeige</a> | <b>An Fenster anpassen</b>) 
<p><b>Cursortasten</b>  Um 1/16 Bildschirm verschieben. 
<p><b>Ctrl+Cursor</b> Um einen Bildschirm verschieben. 
<p><b>Bild oben</b>  Bild nach oben rollen (Fensterh&#246;he). 
<p><b>Bild unten</b>  Bild nach unten rollen. 
<p><b>Pos1</b>  Anfang der Seite. 
<p><b>Ende</b>  Ende der Seite. 
<p>
<p>
<hr>
<h1><a name="Aufruf-Optionen">Aufruf-Optionen</a></h1>
GSview ignoriert Gro&#223;/Kleinschreibung der Optionen: 
-p ist dasselbe wie -P.  Unter Windows oder OS/2 kann man auch 
/p oder /P verwenden.  In den folgenden Beispielen ersetze man <b>gsview</b>  
durch <b>gsview32</b> unter Windows und <b>gvpm</b> unter OS/2. 
<p>Verwendung: 
<pre>
 gsview [-d] [-t] [-f[DEVICE]] [-p[QUEUE]]
   [-mPAPERSIZE] [-oORIENTATION] [-rXDPIxYDPI]
   [-geometry WIDTHxHEIGHT[+XOFF+YOFF]] dateiname
</pre>
<p>Optionen: 
<p><b>dateiname</b> Um GSview zu starten und dateiname.ps anzuzeigen: 
<pre>
 gsview -P dateiname.ps
</pre>
<p><b>-p</b> druckt dateiname.ps mittels Ghostscript. 
Das ist ahnlich  <a href="#Datei_öffnen">Datei</a> | <a href="#Drucken">Drucken</a>, ausser dass man nicht 
nach einem Drucker gefragt wird (es wird der zuletzt von  
GSview benutzte Drucker verwendet, oder der Drucker dessen Name 
angegeben wird) und GSview nach dem Drucken beendet wird: 
<pre>
 gsview -p dateiname.ps
</pre>
<p><b>-f</b> konvertiert eine PostScript-Datei (kein PDF) dateiname.ps 
in eine Datei mittels Ghostscript (<a href="#Datei_öffnen">Datei</a> | <a href="#Konvertierung">Konvertierung</a>): 
<pre>
 gsview -f dateiname.ps
</pre>
<p><b>-m</b>PAPERSIZE setzt das Seitenformat. Alle vordefinierten  
Mediengr&#246;&#223;en sind g&#252;ltig. 
<p><b>-o</b>ORIENTATION setzt die Seitenausrichtung auf <b>auto</b>,  
<b>portrait</b>, <b>landscape</b>, <b>upsidedown</b> oder <b>seascape</b>. 
<p><b>-r</b>XDPIxYDPI setzt die Anzeige-, Konvertierungs- oder Druckaufl&#246;sung. 
<p>Um eine Datei auf A4-Papier in Querformat mit 96dpi anzuzeigen: 
<pre>
 gsview -ma4 -olandscape -r96x96 dateiname.ps
</pre>
<p><b>-d</b> Debug-Modus. 
<p>Im Debug-Modus werden die tempor&#228;ren Dateien von GSview nicht gel&#246;scht, so 
da&#223; sie nach dem Beenden von GSview &#252;berpr&#252;ft werden k&#246;nnen. 
Im Debug-Modus werden au&#223;erdem detailliertere Meldungen 
ausgegeben, die &#252;ber <a href="#Datei_öffnen">Datei</a>| <a href="#Meldungen_anzeigen">Meldungen anzeigen</a> angezeigt werden k&#246;nnen. 
Um Debug-Ausgaben in 
c:\gsview.txt 
zu schreiben, verwendet man -d9. 
<p><b>-t</b> Multi-threading.  GSview l&#228;uft standardm&#228;&#223;ig multithreaded, 
au&#223;er f&#252;r Windows 3.1/Win32s. 
Den Threading-Modus k&#246;nnen Sie mit der Option <b>-t</b> &#228;ndern. 
Dabei w&#228;hlen Sie mit <b>-t0</b> den Single-Thread-Modus aus und mit <b>-t1</b> den 
Multi-Thread-Modus. 
<p>Windows unterst&#252;tzt einige weitere Kommandozeilenoptionen. 
<p><b>-s</b> spoolt eine Datei direkt zum Drucker ohne Ghostscript zu verwenden. 
GSview wird beendet wenn die Datei gespoolt wurde. 
Einige Beispiele sind: 
<pre>
 gsview -s dateiname.ps
 gsview -sLPT3: dateiname.ps
 gsview "-sHP DeskJet Portable" dateiname.ps
</pre>
<p><b>-e</b> verwendet DDE um eine Datei in einem bestehenden GSview zu &#246;ffnen oder,  
wenn GSview noch nicht l&#223;uft, in in einem neuen Fenster: 
<pre>
 gsview -e filename
</pre>
<p><b>-x</b> nutzt DDE um ein bestehendes GSview zu schlie&#223;en. 
<pre>
 gsview -x
</pre>
<p>
<a href="#Dynamischer_Datenaustausch_(DDE)">Dynamischer Datenaustausch (DDE)</a><br>
<p>
<hr>
<h2><a name="Dynamischer_Datenaustausch_(DDE)">Dynamischer Datenaustausch (DDE)</a></h2>
GSview implementiert einen DDE-Server mit service="GSview" und topic="GSview". 
Es werden folgende XTYP_EXECUTE-Befehle erkannt: 
<pre>
 [FileOpen("dateiname")]
 [FileExit()]
 [NextPage()]
 [PrevPage()]
 [GoBack()]
 [GotoPage(5)]
 [ShowWindow(nCmdShow)]
 [Command("command line")]
</pre>
<p>Der [Command()]-Befehl versteht nur "dateiname" oder "/P dateiname". 
<p>Senden Sie nicht mehrere Befehle gemeinsam. GSview w&#252;rde keine Fehlermeldung 
erzeugen, aber die asynchrone Befehlsabarbeitung des im Multithread-Modus 
arbeitenden GSview w&#252;rde dazu f&#252;hren, dass der erste Befehl noch nicht 
abgearbeitet w&#228;re, wenn der zweite Befehl empfangen wird. 
Falls Sie mehrere Befehle senden m&#252;ssen, so senden Sie diese separat mit 
Pausen dazwischen. 
<p>Es gibt zwei Kommandozeilenparameter, um von einer Instanz von GSview einen 
DDE-Befehl an eine andere Instanz zu senden. 
Der Parameter /E verwendet [Command("Befehlszeile")][ShowWindow(1)]. 
Der Parameter /X verwendet [FileExit()]. 
<p>
<p>
<hr>
<h1><a name="World_Wide_Web">World Wide Web</a></h1>
Die World Wide Web-Homepage f&#252;r Ghostscript, Ghostview und GSview finden 
Sie unter folgender Adresse: 
<pre>
 http://www.cs.wisc.edu/~ghost/
</pre>
<p>GSview kann online registriert werden unter 
<pre>
 http://www.ghostgum.com.au/
</pre>
<p>F&#252;r verschiedene OS/2 und MS-Windows Web-Browser kann GSview als 
PostScript-Viewer verwendet werden. 
Ausf&#252;hrliche Informationen hierzu erhalten Sie auf der GSview-Homepage. 
<p>Thomas Merz hat ein Ghostscript Handbuch geschrieben, welches im <a href="#PDF-Format_(Portable_Document_Format)">PDF</a> 
Format auf obiger Web-Page zur Verf&#252;gung steht.  Dieses Handbuch ist ein 
Extrakt seines Buches mit dem Titel <b>Die PostScript- und Acrobat-Bibel</b>, 
da&#223; in englisch (<b>PostScript and Acrobat/PDF</b>) und deutsch erh&#228;ltlich ist. 
<p>
<p>
<hr>
<h1><a name="Copyright">Copyright</a></h1>
&#220;ber den Men&#252;punkt <b>&#220;ber GSview</b> erhalten Sie Informationen zum Copyright 
und zur Versions-Nummer. 
<p><pre>
 GSVIEW32.EXE - Bedienung von Ghostscript &#252;ber graphische Oberfl&#228;che
 Copyright (C) 1993-2002, Ghostgum Software Pty Ltd.  Alle Rechte vorbehalten.
</pre>
<p>Diese Datei ist Bestandteil des Programmes GSview. 
<p>Dieses Programm wird ohne jede Gew&#228;hrleistung vertrieben. 
Keiner der Autoren oder Distributoren ist verantwortlich f&#252;r die Folgen 
des Verbrauchs, weder f&#252;r die Fehlerfreiheit noch f&#252;r die des gesamten 
Programmes. Ausf&#252;hrliche Informationen hierzu erhalten Sie in den 
Lizenzbestimmungen "GSview Free Public Licence". 
<p>Jede Kopie von GSview mu&#223; eine Kopie der Lizenz enthalten, und zwar in 
Form einer ASCII-Datei namens LICENCE. Diese gibt Ihnen das Recht, Gsview 
zu kopieren, zu ver&#228;ndern oder zu vertreiben, jedoch nur unter 
den in der Lizenz beschriebenen Bedingungen. 
Unter anderem fordert die  Lizenz, da&#223; das Copyright und dieser Hinweis 
in allen Kopien enthalten ist. 
<p><pre>
     Autor: Russell Lang, Ghostgum Software Pty Ltd
  Internet: gsview@ghostgum.com.au
</pre>
<p>Lesen Sie zun&#228;chst das Thema <a href="#Häufig_auftretende_Probleme">H&#228;ufig auftretende Probleme</a>, 
die GSview-Datei Readme.htm und die entsprechende <a href="#World_Wide_Web">WWW</a>-Seite, 
bevor Sie sich per E-Mail an den Autor wenden. 
<p>Das Programm pstotext (geschrieben von Andrew Birrell und Paul McJones) 
wird von GSview in einem externen DLL verwendet. 
<pre>
  Copyright (C) 1995-1996, Digital Equipment Corporation.
</pre>
<p>Die Lizenz und weitere Informationen hierzu finden Sie in den Dateien 
pstotext.txt bzw. pstotext.zip. Sind Sie mit den Lizenzbestimmungen f&#252;r 
pstotext nicht einverstanden, l&#246;schen Sie die Dateien pstotext.zip, 
pstotxt2.dll und pstotxt3.dll von Ihrem System. 
<p>
<p>
<hr>
<h1><a name="H&#228;ufig_auftretende_Probleme">H&#228;ufig auftretende Probleme</a></h1>
<b>Problem:</b> Kann Ghostscript DLL nicht laden 
<p>GSview ben&#246;tigt die Ghostscript-DLL (gsdll2.dll f&#252;r OS/2, gsdll32.dll f&#252;r 
Win32). Diese Fehlermeldung tritt normalerweise auf, wenn Ghostscript 
nicht installiert ist oder GSview Ghostscript nicht finden kann. 
<p>W&#228;hlen Sie im GSview-Men&#252; <a href="#Optionen">Optionen</a> | <b>Konfiguriere Ghostscript</b> und 
geben Sie den korrekten Pfad f&#252;r <a href="#Fortgeschrittene_Konfiguration">Ghostscript DLL</a> ein. Beispiel: 
<pre>
 c:\gs\gsN.NN\bin\gsdll32.dll
</pre>
<p>Die Fehlermeldung erhalten Sie auch, wenn Ghostscript seine 
Initialisierungsdateien (z.B. gs_init.ps) nicht finden kann. 
In diesem Fall m&#252;ssen Sie den <a href="#Fortgeschrittene_Konfiguration">Ghostscript Suchpfad</a> korrekt einstellen. 
<p>Wenn Sie Win32s verwenden, &#252;berpr&#252;fen Sie, ob nicht bereits eine Kopie von 
Ghostscript DLL von einer Kopie von GSview geladen ist. 
Unter Win32s darf immer nur eine Kopie von Ghostscript DLL geladen sein. 
<p>Wenn die Ghostscript-DLL immer noch nicht korrekt geladen werden kann, 
&#252;berpr&#252;fen Sie, ob Ghostscript alleine konfiguriert und gestartet 
werden kann. 
<p><b>Problem:</b> Im Ghostscript-Fenster erhalten Sie die Fehlermeldung 
<b>Can't find initialization file gs_init.ps</b>. 
<p>Geben Sie den korrekten <a href="#Fortgeschrittene_Konfiguration">Ghostscript Suchpfad</a> an, um auf das Verzeichnis 
zu verweisen, das die Initialisierungsdatei gs_init.ps enth&#228;lt.. 
<p><b>Problem:</b> Im Ghostscript-Fenster erhalten Sie die Fehlermeldung 
<b>gs: Interpreter revision (XXX) does not match gs_init.ps revision (YYY)</b>. 
<p>Geben Sie den korrekten <a href="#Fortgeschrittene_Konfiguration">Ghostscript Suchpfad</a> an, um auf das Verzeichnis 
zu verweisen, das die Initialisierungsdatei gs_init.ps enth&#228;lt.. 
PostScript-Dateien d&#252;rfen nicht mit einer &#228;lteren Version von Ghostscript 
angezeigt werden, weil in diesem Fall unabh&#228;ngig vom <b>Ghostscript 
Suchpfad</b> die alte Initialisierungsdatei geladen wird. 
<p><b>Problem:</b> Im Ghostscript-Fenster erhalten Sie die Fehlermeldung 
<b>Wrong version of DLL found.  Found version XXX  Need version YYY</b>. 
<p>GSview hat die falsche Ghostscript-DLL gefunden. Installieren Sie die 
korrekte Version der Ghostscript-DLL. &#220;berpr&#252;fen Sie, ob sich auf Ihrem 
System nur eine Kopie der Ghostscript-DLL befindet. 
<p><b>Problem:</b> Unter GSview erhalten Sie die Meldung, da&#223; eine aus mehreren 
Seiten bestehende PostScript-Datei, die mit einer MS-Windows-Anwendung 
erzeugt wurde, 0 Seiten enth&#228;lt, und es wird nur die erste Seite 
angezeigt. 
<p>Diese Fehlermeldung erhalten Sie, wenn die Datei falsche DSC-Kommentare 
enth&#228;lt. W&#228;hlen Sie in der Druckereinstellung <b>Drucker</b>, <a href="#Optionen">Optionen</a>, und klicken 
Sie im Feld <b>Drucke in</b> auf <b>Drucker</b>. Dateien, die aus 
mehreren Seiten bestehen, k&#246;nnen nicht &#252;ber den Befehl <b>Drucke in</b> 
<b>EPS-Datei</b> gedruckt werden. 
Verbinden Sie in diesem Fall den Treiber mit der Schnittstelle <b>FILE:</b>. 
Anschlie&#223;end w&#228;hlen Sie im Einstellungsfeld des Treibers das Men&#252; 
<a href="#Optionen">Optionen</a>, <b>Weitere Optionen</b> aus und aktivieren die Funktion <b>Gem&#228;&#223; 
Adobe-Dokumentenstrukturierungsvereinbarung</b>. 
<p>Der DSC-Kommentar <b>%%Pages: 0</b> bedeutet, da&#223; keine Seiten erzeugt wurden. 
Der PostScript-Operator <b>showpage</b> wurde nicht verwendet. 
Wenn ein aus mehreren Seiten bestehenden PostScript-Dokument den Kommentar 
<b>%%Pages: 0</b> enth&#228;lt, &#228;ndern Sie die erste Zeile von <b>%!PS-Adobe-</b> in 
<b>%!</b>. In diesem Fall ignoriert GSview die DSC-Kommentare, 
und es k&#246;nnen alle Seiten des Dokumentes angezeigt werden, 
allerdings nur in der urspr&#252;nglichen Reihenfolge. 
Wenden Sie sich mit Beschwerden bzw. Verbesserungsvorschl&#228;gen an die 
Autoren des Programmes, mit dem die PostScript-Datei erzeugt wurde. 
<p>Einige PostScript-Druckertreiber enthalten einen speziellen Code f&#252;r 
besondere Drucker. 
Bei diesen PostScript-Treibern kann es vorkommen, da&#223; die Druckausgabe 
nicht portierbar ist und daher in GSview nicht angezeigt werden kann. 
Wenn dieses Problem auftritt, verwenden Sie einen der g&#228;ngigen 
PostScript-Treiber wie z.B. <b>Apple LaserWriter II NT</b> f&#252;r PostScript 
Level 2 Drucker oder <b>Apple LaserWriter Plus</b> f&#252;r PostScript Level 1 
Drucker. 
<p>Unter Windows 95 w&#228;hlen Sie in der Druckereinstellung den Men&#252;punkt 
<b>Eigenschaften</b> und klicken auf die Registerkarte <b>PostScript</b>. 
W&#228;hlen Sie anschlie&#223;end im Feld PostScript-Ausgabeformat die Einstellung 
<b>PostScript (Optimale Portierung - ADSC)</b>. 
<p><b>Problem:</b> In GSview erhalten Sie die Meldung "Page ordering is Special" 
<p>Im Dokument ist der DSC-Kommentar <b>%%PageOrder: Special</b> enthalten. 
Dies hat zur Folge, da&#223; die Seiten nicht korrekt angeordnet werden k&#246;nnen 
und GSview die Seiten nur in der urspr&#252;nglichen Reihenfolge 
anzeigen kann. 
Wenn Sie trotzdem fortfahren und die Seiten neu anordnen, k&#246;nnen 
PostScript-Fehler auftauchen, die nur behoben werden k&#246;nnen, 
wenn der PostScript-Code erneut erzeugt wird, allerdings ohne spezielle 
Seitenanordnung. 
<p>Windows 95 erzeugt normalerweise PostScript-Dateien mit einer speziellen 
Seitenanordnung. Um dies zu &#228;ndern, w&#228;hlen Sie in den Druckereigenschaften 
die Registerkarte PostScript und w&#228;hlen dort im Feld 
PostScript-Ausgabeformat die Einstellung <b>PostScript 
(Optimale Portierung - ADSC)</b>. 
<p><b>Problem:</b> PostScript-Dateien, die unter MS-Windows erzeugt wurden, 
beginnen mit dem Steuerzeichen Control-D. 
<p>Windows 3.1: 
Da dieses Probleme sogar auftritt, wenn bei einem PostScript-Treiber das 
Kontrollk&#228;stchen <b>Gem&#228;&#223; Adobe-Dokumentenstrukturierungsvereinbarung</b> 
aktiviert ist, wird es als Fehler des MS-Windows 
PostScript-Druckertreibers betrachtet. 
Hinweise zur L&#246;sung des Problems finden sie in der Datei PRINTERS.WRI. 
Um die Ausgabe von Ctrl-D am Anfang der Datei zu verhindern, 
m&#252;ssen Sie in der Datei win.ini den Abschnitt f&#252;r den Drucker ermitteln 
(mehrere Abschnitte sind m&#246;glich) und folgende Zeile einf&#252;gen: 
<b>CTRLD=0</b>.  Beispiel: 
<p><pre>
 [Apple LaserWriter II NT,FILE]
 CTRLD=0
</pre>
<p>Windows 95: 
<p>Im Konfigurationsmen&#252; des PostScript-Treibers gibt es eine Funktion, mit 
der die Ausgabe von Ctrl-D am Anfang der Datei verhindert werden kann 
(Eigenschaften, Registerkarte PostScript, Schaltfl&#228;che Erweitert). 
Die Voreinstellung lautet "Strg + D nach Auftrag senden". 
<p><b>Problem:</b> PostScript-Dateien, die mit Word f&#252;r Windows 6.0 erzeugt 
wurden, verursachen eine "Missing %%Pages comment"-Meldung. 
<p>Gratulation! Sie haben gerade einen DSC-Kommentarfehler gefunden, 
den Word beim Einbetten einer EPS-Datei macht. 
Word h&#228;tte die eingebettete EPS-Datei mit folgenden Zeilen beginnen 
bzw. beenden sollen: 
<pre>
 %%BeginDocument: dateiname.eps
 %%EndDocument
</pre>
<p>Da Word dies nicht tut, kann GSview nicht angeben, wieviele Seiten das 
Dokument enth&#228;lt und wo sich die einzelnen Seiten befinden. 
<p>Wenden Sie sich mit diesem Problem an Microsoft, da sich in der EPSIMP.FLT 
Filterversion 2.01 ein Fehler befindet, der von Microsoft behoben werden 
mu&#223;. 
<p>Solange dieses Problem auftritt, gibt es zwei unterschiedliche 
Vorgehensweisen: 
<p>1. W&#228;hlen Sie <a href="#Optionen">Optionen</a> | <a href="#Ignoriere_DSC">Ignoriere DSC</a>. 
<p>2. Bearbeiten Sie die PostScript-Datei, um die korrekten DSC-Kommentare 
einzuf&#252;gen. Suchen Sie in der PostScript-Datei nach allen Zeilen, 
die folgenden Kommentar enthalten: 
<pre>
  %MSEPS Preamble
</pre>
<p>Suchen Sie von hier aus die Kommentarzeilen, die sich auf die eingebettete 
EPS-Datei beziehen. Die erste Zeile lautet hier normalerweise: 
<pre>
  %!PS-Adobe-3.0 EPSF-3.0
</pre>
<p>Vor diese Zeilen f&#252;gen Sie folgende Zeile ein: 
<pre>
 %%BeginDocument: AddedByHand
</pre>
<p>Suchen Sie anschlie&#223;end nach Zeilen, die folgenden Kommentar enthalten: 
<pre>
 %MSEPS Trailer
</pre>
<p>Vor diese Zeilen f&#252;gen Sie den Kommentar 
<pre>
 %%EndDocument
</pre>
<p>ein 
<p>Anschlie&#223;end sollte eine korrekte Anzeige der Datei m&#246;glich sein. 
<p><b>Problem:</b> Gsview erkennt keine DSC Anweisungen in Dateien, die mit dem 
Windows 32-Bit Adobe Postscripttreiber 4.10 erzeugt wurden. 
<p>Verwenden Sie nicht das "Tagged binary communications protocol". 
&#196;ndern Sie dies in "Printers | Postscript tab | Advanced... | 
Data format group box | ASCII data". 
<p><b>Problem:</b> Der Versuch irgendeine Datei zu &#246;ffnen ergibt: 
<pre>
 <b>Unrecoverable error: configurationerror in setpagedevice</b>
 Failed to open device or install ViewerPreProcess hook: returns -26
 Page size may have been too large or resolution too high.
 Resetting page size and resolution
</pre>
<p>Entweder die Seitengr&#246;&#223;e oder die Aufl&#246;sung ist zu gro&#223;. Reduzieren 
sie diese entsprechend. 
Es ist jedoch auch m&#246;glich, da&#223; sie die Option <b>-dFIXEDMEDIA</b> in der 
Ghostscript-Umgebungsvariablen GS_OPTIONS angegeben haben. 
Wenn sie mit GSview arbeiten, so sollten sie GS_OPTIONS am besten 
gar nicht benutzen, stattdessen verwenden sie bitte <a href="#Optionen">Optionen</a> | 
<b>Konfiguriere Ghostscript</b> | <b>Ghostscript-Optionen</b>. 
<p><b>Problem:</b> GSview hangt oder braucht sehr lange um eine Datei anzuzeigen. 
<p>Die Auflosung oder die Seitengr&#246;&#223;e kann zu hoch sein. 
Senken sie die Aufl&#246;sung auf 96dpi (Standard) mittels 
<a href="#Seitenformat">Formate</a>| <a href="#Anzeige_Einstellungen">Anzeige Einstellungen</a>. 
&#196;ndern Sie die Seitengr&#246;&#223;e mit dem  <b>Format</b>-Men&#252;. 
<p><p>
<p>
<hr>
<h1><a name="Andere_n&#252;tzliche_Programme">Andere n&#252;tzliche Programme</a></h1>
<b>RedMon</b> ist ein Windows 95 und NT Port Monitor, der es einem erlaubt, 
einen Druckerport an ein Programm umzuleiten. 
RedMon kann zusammen mit Ghostscript und einem nicht postscriptf&#228;higem 
Drucker benutzt werden, um einen Postscriptdrucker zu emulieren. Dieser 
emulierte Drucker kann als Netzwerkdrucker anderen Computern zur 
Verf&#252;gung gestellt werden. Weiteres unter: 
<pre>
  http://www.cs.wisc.edu/~ghost/redmon/
</pre>
<p>RedMon beinhaltet au&#223;erdem ein Kommandozeilenprogramm um eine 
Datei in eine Windows-Druckerwarteschlange zu stellen. 
<p><b>PrintFile</b> von Peter Lerup ist eine Windows-Applikation um Dateien an 
Drucker zu schicken. Es erlaubt die intelligente Verarbeitung von Text-, 
Postscript- und anderen Dateien. Es ist erh&#228;ltlich unter: 
<pre>
  http://hem1.passagen.se/ptlerup/
</pre>
<p>Sehen sie auf der Ghostscript-<a href="#World_Wide_Web">WWW</a>-Seite nach weiteren n&#252;tzlichen 
Programmen nach. 
<p>
<p>
<hr>
<h1><a name="Weitere_Hilfethemen">Weitere Hilfethemen</a></h1>
Zu diesen Themen gelangen Sie &#252;ber die Schaltfl&#228;che <b>Hilfe</b> in jedem 
Dialogfeld. 
<p>
<a href="#Meldungen_anzeigen">Meldungen anzeigen</a><br>
<a href="#bzip2">bzip2</a><br>
<a href="#zlib">zlib</a><br>
<a href="#GSview_intern">GSview intern</a><br>
<p>
<hr>
<h2><a name="Meldungen_anzeigen">Meldungen anzeigen</a></h2>
Das Zusatzprogramm GSview benutzt Ghostscript, um PostScript-Dateien auf 
dem Bildschirm oder dem Drucker auszugeben. &#220;ber den Befehl <b>Zeige 
Meldungen</b> k&#246;nnen Sie sich die Meldungen anzeigen lassen, die 
dabei im Konsolfenster von Ghostscript erscheinen. 
Dieses ist vor allem bei PostScript-Problemen sinnvoll. 
Um den Anfang der Fehlermeldung zu sehen, m&#252;ssen Sie eventuell zur&#252;ckrollen. 
<p>Sie k&#246;nnen den Text, der &#252;ber den Befehl <b>Meldungen anzeigen</b> angezeigt 
werden kann, in die Zwischenablage kopieren. 
Haben Sie keinen Text markiert, wird der gesamte Text in die Zwischenablage 
kopiert. 
Haben Sie dagegen nur einen Teil des Textes markiert, wird nur dieser 
Teil kopiert. 
<p>Im Hilfethema <a href="#Häufig_auftretende_Probleme">H&#228;ufig auftretende Probleme</a> werden einige der 
Fehlermeldungen erkl&#228;rt, die Sie mit <b>Meldungen anzeigen</b> erhalten. 
<p>
<p>
<hr>
<h2><a name="bzip2">bzip2</a></h2>
Wenn Sie versuchen eine Datei zu &#246;ffnen, die mit bzip2 gepackt 
wurde, dann versucht GSview die bzip2-DLL zu laden und die Datei 
in eine tempor&#228;re Datei zu entpacken. 
<p>Wenn Sie die Fehlermeldung <b>Failed to load bzip2 DLL...</b>  bekommen, 
dann ist diese Bibliothek wahrscheinlich nicht verf&#252;gbar. Laden Sie diese 
von demselben  Server, von dem Sie auch GSview geladen haben oder von 
<pre>
 ftp://ftp.cs.wisc.edu/ghost/ghostgum/
</pre>
<p>Kopieren Sie die bzip2-DLL in dasselbe Verzeichnis wie GSview EXE. 
libbz2.dll ist f&#252;r Win32. Zur Zeit ist leider keine bzip2 DLL f&#252;r Win16 
oder OS/2 verf&#252;gbar. 
<p>bzip2 unterliegt dem Copyright 1996-2000 von Julian Seward 
Der Quelltext kann bezogen werden von 
<pre>
 http://sourceware.cygnus.com/bzip2/index.html
</pre>
<p>
<p>
<hr>
<h2><a name="zlib">zlib</a></h2>
Wenn Sie eine Datei bearbeiten wollen, die mit dem Programm gzip 
komprimiert wurde, versucht Gsview die zlib-DLL zu laden und die 
Datei damit automatisch zu entpacken. 
<p>Wenn Sie die Fehlermeldung <b>Failed to load zlib DLL...</b> erhalten, 
dann ist diese wahrscheinlich nicht auf ihrem System installiert. 
Sie k&#246;nnen diese DLL von dort bekommen, wo Sie Gsview erhalten haben, 
oder von ftp://ftp.cs.wisc.edu/ghost/ghostgum/ 
Kopieren Sie die zlib-DLL in dasselbe Verzeichnis wie Gsview.exe. 
zlib16.dll ist f&#252;r Win16. zlib32.dll ist f&#252;r Win32. 
zlib2.dll ist f&#252;r OS/2. 
<p>zlib unterliegt dem Copyright 1995-1996 von Jean-loup Gailly und 
Mark Adler. Der Quelltext kann bezogen werden von 
<pre>
 http://www.info-zip.org/pub/infozip/zlib/
</pre>
<p>
<p>
<hr>
<h2><a name="GSview_intern">GSview intern</a></h2>
GSview verwendet die AFPL Ghostscript-DLL zur Darstellung von 
PostScript-Dateien. 
<p>Unter Win32s kann die GS-DLL nicht von mehreren Anwendungsprogrammen zur 
gleichen Zeit genutzt werden. 
Unter Windows 95, Windows NT und OS/2 kann die GS-DLL von mehreren 
Anwendungen gleichzeitig genutzt werden, wenn gen&#252;gend Speicher vorhanden 
ist. 
Bei Win32s mu&#223; die GS-DLL von GSview entladen werden, wenn diese von 
gvwgs.exe zum Drucken verwendet wird. 
<p>gsv16spl.exe ist eine 16 bit-Windowsanwendung, die von GSview benutzt wird, 
um Dateien, die unter GSview Win32s erzeugt wurden, in den Spooler zu stellen. 
gsv16spl kann nicht f&#252;r sich alleine verwendet werden, sondern mu&#223; von Gsview 
geladen werden. Von Windows 95 oder Windows NT wird gsv16spl.exe nicht ben&#246;tigt. 
<p>Mit gvwgs32.exe (Windows) und gvpgs.exe (OS/2) wird die GS-DLL zum Drucken 
geladen. Man k&#246;nnte sie auch aus der Kommandozeile heraus aufrufen. 
Da sie allerdings die Dateien l&#246;schen, die in der Kommandozeile stehen, 
ist die Verwendung gswin32.exe (Win32), gswin32c.exe (Win32 Konsole) 
oder gsos2.exe (OS/2) sicherer. 
<p><p>
<p><hr>Created automatically by doc2html
</body>
</html>
